[{"title": "is \"obsessiveness\" an actual word?", "selftext": "i'm not sure if i'm allowed to ask questions so if not, i don't mind this being removed or anything.\n\n i was just looking up words for fun.. then it came to me; it looks to stupid to be classified in a dictionary and when i looked up \"obsess\", i don't see any other tenses, same with \"obsessive\". \nyeah, on regular text when you type it, there's no red line under it, at least for me. but, it does it for a load of words on my phone... maybe it's a setting ? in simpler words im saying that i get the red line under normal misspelled words but some spelling errors i've done a lot like \"pgone\" (phone) and \"ypur\"(your) don't have a red line under it because i've done it a lot (if this helps at all, i have an iphone). \n\nim so sorry this is such a stupid question .. but im actually confused and google won't help me.", "id": "144qkmp", "url": "https://www.reddit.com/r/dictionary/comments/144qkmp/is_obsessiveness_an_actual_word/", "created_utc": 1686271637.0, "score": 2, "permalink": "/r/dictionary/comments/144qkmp/is_obsessiveness_an_actual_word/", "comments": ["The OED has this entry : -\n\nobˈsessiveness\n [f. as prec. + -ness.]\nobˈsessiveness\n The quality of being obsessive.\n\n1961: in Webster.\n\n1966: Listener 8 Sept. 366/3 “Mr Storey portrayed very accurately that brand of obsessiveness which salesmen call enthusiasm.”"], "URLs": [], "html_title": []}, {"title": "What's the word for someone who will not accept that they're wrong even though all evidence proves them wrong.", "selftext": "", "id": "144q0g2", "url": "https://www.reddit.com/r/dictionary/comments/144q0g2/whats_the_word_for_someone_who_will_not_accept/", "created_utc": 1686270114.0, "score": 6, "permalink": "/r/dictionary/comments/144q0g2/whats_the_word_for_someone_who_will_not_accept/", "comments": ["Incorrigible", "Bigot, Dogmatist, Stubborn, Pigheaded, Obstinate", "Willfully ignorant", "Asshole? No seriously I think you’re looking for the word “infallible.”", "Possibly bullheaded?", "Ideologist", "I like incorrigible, and stubborn.  I'd say stubborn is a descriptor of the person's behavior, and incorrigible is a descriptor of the person.  Willfully ignorant is typically a legal term if this is a legal issue.", "No, *infallible* refers to an entity incapable of making mistakes/being wrong. OP asks for a word describing someone who thinks they are infallible, but aren't."], "URLs": [], "html_title": []}, {"title": "What’s one word that means when you are happy but/and you realize it will come to and end? So you’re happy but sad at the same time.", "selftext": "", "id": "140jidl", "url": "https://www.reddit.com/r/dictionary/comments/140jidl/whats_one_word_that_means_when_you_are_happy/", "created_utc": 1685898857.0, "score": 1, "permalink": "/r/dictionary/comments/140jidl/whats_one_word_that_means_when_you_are_happy/", "comments": ["Bittersweet", "Melancholy?"], "URLs": [], "html_title": []}, {"title": "What word has the longest length to unique letter ratio in the dictionary?", "selftext": "Just curious, don’t know if it fits. For example, “nanny” has 5 letters, but only 3 unique ones, making the ratio 5:3 (1.67:1). What word has the largest ratio?", "id": "13zledy", "url": "https://www.reddit.com/r/dictionary/comments/13zledy/what_word_has_the_longest_length_to_unique_letter/", "created_utc": 1685817393.0, "score": 5, "permalink": "/r/dictionary/comments/13zledy/what_word_has_the_longest_length_to_unique_letter/", "comments": [], "URLs": [], "html_title": []}, {"title": "what does aneuthanasia mean?", "selftext": "Aneuthanasia is one of track’s title from gorgoroths album quantos possunt ad satanitatem trahunt", "id": "13zkzd6", "url": "https://www.reddit.com/r/dictionary/comments/13zkzd6/what_does_aneuthanasia_mean/", "created_utc": 1685816476.0, "score": 1, "permalink": "/r/dictionary/comments/13zkzd6/what_does_aneuthanasia_mean/", "comments": ["Not euthanasia?", "no Aneuthanasia", "I was wondering how to phrase my reply to avoid ambiguity, I mean an- could be a prefix meaning negation, + the word euthanasia. So maybe it means non-euthanasia, anti-euthanasia, or bad death (eu = good and thanos (?) means death)."], "URLs": [], "html_title": []}, {"title": "Science Word of the Week: Animalcule", "selftext": "https://www.youtube.com/watch?v=BuNmPValFuI", "id": "13ye06c", "url": "https://www.reddit.com/r/dictionary/comments/13ye06c/science_word_of_the_week_animalcule/", "created_utc": 1685715344.0, "score": 2, "permalink": "/r/dictionary/comments/13ye06c/science_word_of_the_week_animalcule/", "comments": ["I used this word 5 times this week on Reddit... But then again, I guess that's to be expected when you make a post about Antonie van Leeuwenhoek like I did.", "Maybe we're just a little into the microscopic world."], "URLs": ["https://www.youtube.com/watch?v=BuNmPValFuI"], "html_title": ["See A Tardigrade Under The Microscope! Animalcules, Explained 🧸🔬 - YouTube"]}, {"title": "Today, I discovered a word accidentally on google", "selftext": "**Ipsilateral:**\n\n*Adjective*\n\nbelonging to or occurring on the same side of the body.", "id": "13y954g", "url": "https://www.reddit.com/r/dictionary/comments/13y954g/today_i_discovered_a_word_accidentally_on_google/", "created_utc": 1685702441.0, "score": 7, "permalink": "/r/dictionary/comments/13y954g/today_i_discovered_a_word_accidentally_on_google/", "comments": ["[That's good. That's damn good.](https://i.imgur.com/9715gCK.gif)", "Read that too fast. Thought you said \"ipsiliteral\".", "Contralateral would be belonging to the opposite side of the body"], "URLs": [], "html_title": []}, {"title": "Why does the 1828 version of Webster dictionary call the planet known today as Uranus, Herschel?", "selftext": "I don't know if this is the correct or best suited subreddit to ask this question, but after reading through the guidelines of many different ones, this one seemed to be the closest....\n\nTo start with, I know that it wasn't until 1850 that Uranus officially became the name of the planet that was universally accepted by astronomers and that for the first 69 years after it's discovery it was known by many different names, some depending on where you were located...\n\nBut from what I have gathered through online reading, it seems that by 1828 there were just two names being predominantly used: Georgium Sidus and Uranus.  Now, it is sort of a no-brainer as to why Webster does not refer to it is Georgium Sidus, named for King George, being that one of the main reasons for the creation of his dictionary was to distance those who lived in the still rather newly independent United States from the British...  But I don't understand why he opted for 'Herschel' (named after the astronomer who discovered it) when as far as I can tell it doesn't seem to have ever been a popular choice or widely used name for the planet at any point, and seems to have been predominantly used the years directly after it's discovery.\n\nWhat makes it even more curious is the definition of the word \"Uranium\" in Webster's 1828 dictionary which reads: \n\nURA'NIUM, n.  [Gr. heaven, or a planet so called.]\nA metal discovered in 1789 by Klaproth, in the mineral called pechblend.  It is occasionally found native in uran-ocher and uran-mica; but more generally it is obtained from pechblend, in which it exists with iron, copper, lead, and sometimes with arsenic, cobalt and zink.\n\nThe \"or a planet so called\" notation right before the definition seems extremely odd when considering Webster's choice as Herschel for the name of the planet.  It almost seems personal.  \n\nAnyone have any ideas?", "id": "13vlcki", "url": "https://www.reddit.com/r/dictionary/comments/13vlcki/why_does_the_1828_version_of_webster_dictionary/", "created_utc": 1685438417.0, "score": 7, "permalink": "/r/dictionary/comments/13vlcki/why_does_the_1828_version_of_webster_dictionary/", "comments": ["I was just thinking that the \"or a planet so called\" notation could possibly be a reference to the fact that the chemist who discovered uranium, Martin Heinrich Klaproth, named his newly discovered element as 'uranium' in order to aid his good friend Johann Elert Bode in his push to have the recently discovered planet officially named Uranus.", "There’s a cgp video on this [here](https://youtu.be/h3ppbbYXMxE)\n\nHave fun learning!!", "That is a weird catch, thanks for bringing it up!\n\nI agree that it seems likely the decision was influenced by Webster’s political goal of making a truly American dictionary. My first though is that maybe the name Herschel was proposed by an American astronomer, but no; Uranus was proposed by the German astronomer Johann Elert Bode, and Herschel was proposed by the French astronomer Jerome Lalande. My guess is that there was still enough debate around the planet’s name in 1828 so that it could’ve gone either way, giving Webster enough leeway to make his own decision. According to Wikipedia, Lalande was elected a Foreign Honorary Member of the American Academy of Arts and Sciences in 1781, so maybe that American connection was enough to tip Webster’s favor towards it. It’s also possible that Uranus was already dominant, but Webster, being a lexicographer and not a scientist, was simply mis-informed about that planet’s most popular name.  \nRegarding Uranium, I agree with u/SaturnMoloch that he probably just included that as relevant etymological information, though he disagreed with the name of the planet itself. The phrase “a planet so-called” makes me imagine him saying “The metal is called X because some people call the planet X, but I think the planet should actually be called Y”.  \nFinally, it’s also possible that the discrepancy around “Uranium” was simply a result of Dictionary fatigue. It’s a well-documented fact that the quality of a dictionary tends to decrease as you go through it, because lexicographers lose energy, time, and funding as they move through the alphabet. This was especially true back when a dictionary was the work of a single scholar, slaving away in solitary drudgery. It’s possible that Webster was full of strong political opinions in the H’s, but by the time he got to the U’s, he was too tired to really care about what the planet was called anymore.", "Thanks for that, I didn't realize that the name Herschel was also used in the encyclopedia for 1828...It seems I may have underrated the popularity of the name 'Herschel', and that it is very possible that Herschel was in fact the widely used term for the planet in the United States in 1828.  The next version of the Webster dictionary which was published in 1841 did change the name of the planet to Uranus though, which was still 9 years prior to Uranus formally being universally accepted as the name of the planet.", "Ye. I’m a knowledge goblin and language is my jam atm (exams are pain) so this post made my brain light up all excited because I knew the answer! Just figured CGP could articulate it better than I. \n\nDictionaries are so fun! I meed to go over the timeline again, but iirc, Jonathan Swift (may be wrong, there are many names) said something akin to “trying to control the English language is like trying to lash the wind” which, just feels so pained and exhausted in context of him trying to write one of the first dictionaries. I can just imagine some guy in the mid 1700s England crying over pages and pages of words because there are just too many. \n\nDon’t take anything I said there as fact btw, like I said, haven’t looked over that unit yet and therefore the name and details may be wrong. The quote “lash the wind” in that context does exist though from around that time period in some guy’s letters or diaries. Also apologies for the excited knowledge goblinery.", "Ye. I’m a knowledge goblin and language is my jam atm (exams are pain) so this post made my brain light up all excited because I knew the answer! Just figured CGP could articulate it better than I. \n\nDictionaries are so fun! I meed to go over the timeline again, but iirc, Jonathan Swift (may be wrong, there are many names) said something akin to “trying to control the English language is like trying to lash the wind” which, just feels so pained and exhausted in context of him trying to write one of the first dictionaries. I can just imagine some guy in the mid 1700s England crying over pages and pages of words because there are just too many. \n\nDon’t take anything I said there as fact btw, like I said, haven’t looked over that unit yet and therefore the name and details may be wrong. The quote “lash the wind” in that context does exist though from around that time period in some guy’s letters or diaries. Also apologies for the excited knowledge goblinery.", "Thanks for linking the CGP video, it seems likely that the name just wasn't properly settled in 1828.  \nThe \"Lash the wind\" comment was written by Samueel Jhonson; it appears in the introduction to his famous English dictionary, first published in 1755. The full quote is \"[...] academies have been instituted, to guard the avenues of their languages, to retain fugitives, and repulse intruders; but their vigilance and activity have hitherto been vain; sounds are too volatile and subtile for legal restraints; to enchain syllables, and to lash the wind, are equally the undertakings of pride, unwilling to measure its desires by its strength.\" He's basically saying that language changes all the time, and even the best efforts of the greatest language scholars are powerless to stop it. I, too, am a silly knowledge goblin with a powerful predilection for lexicographical learning :)"], "URLs": [], "html_title": []}, {"title": "\"Imunna?\"", "selftext": "If I recall some day in the last few months Dictionary.com's word of the day described the linguistic phenomenon exemplified by the use of \"imunna\" as a major contraction of \"I'm going to.\" I can't find it for the life of me. What is this word?", "id": "13v4054", "url": "https://www.reddit.com/r/dictionary/comments/13v4054/imunna/", "created_utc": 1685388325.0, "score": 1, "permalink": "/r/dictionary/comments/13v4054/imunna/", "comments": ["I'm not sure but it does seem similar to things like \"I'mma\" or the use of \"finna\""], "URLs": [], "html_title": []}, {"title": "In need of a word, please!", "selftext": "Searching good ole google for the answer but  perhaps I am not articulating my question very well. \n\nWhat is the word or phrase for a person who creates a false mental image or blueprint of anothers personality? (typically the mental image of the other person is in a negative light and despite there being no history of enacting this false self that was created by another)", "id": "13skko7", "url": "https://www.reddit.com/r/dictionary/comments/13skko7/in_need_of_a_word_please/", "created_utc": 1685125248.0, "score": 1, "permalink": "/r/dictionary/comments/13skko7/in_need_of_a_word_please/", "comments": ["Mischaracterization\n\nMisrepresentation", "Svengali", "Impostor"], "URLs": [], "html_title": []}, {"title": "Does \"monolithic\" work here?", "selftext": "In the story I'm writing, the heroes are being attacked by a giant bird. In one sentence I used the word \"monolithic\" to describe its wings, and while it definitely sounds cool I can't decide if it fits or not.  \n\n\"[...] it flapped its monolithic wings and rose back into the sky.\"", "id": "13r2epi", "url": "https://www.reddit.com/r/dictionary/comments/13r2epi/does_monolithic_work_here/", "created_utc": 1684973354.0, "score": 3, "permalink": "/r/dictionary/comments/13r2epi/does_monolithic_work_here/", "comments": ["I think the etymology of monolith is something like single (really big) rock. Is that what you're going for?", "That's one definition, but Google also lists this: \"large, powerful, and intractably indivisible and uniform.\" Which is why I'm divided on this. The bird is large and powerful, and its wings therefor would be too, and it could be argued that the bird and its wings are \"intractably indivisible\" since they're part of the same creature and \"uniform\" since both wings are more or less identical and move in unison.\n\nBut then again, maybe I'm stretching things here, lol"], "URLs": [], "html_title": []}, {"title": "Brain fart", "selftext": "I’m looking for a word that is used to describe people that are uncompromising in religious or political ideas. I swear it ending in -ist", "id": "13qxkw0", "url": "https://www.reddit.com/r/dictionary/comments/13qxkw0/brain_fart/", "created_utc": 1684962058.0, "score": 1, "permalink": "/r/dictionary/comments/13qxkw0/brain_fart/", "comments": ["Dogmatist", "Zealot?", "That isn’t it but I appreciate you helping", "I love you so much, you mad my day. Now I can go call my coworker a zealot!", "The first word that comes to mind for me is \"devout\" or maybe \"unflinching\" but those don't end with -ist."], "URLs": [], "html_title": []}, {"title": "Heiligenschein [ hahy-li-guhn-shahyn ]", "selftext": "**noun**  \na bright ring, caused by diffraction of light rays, that appears around the shadow cast by a person’s head on wet grass.\n\n  \nIn certain conditions, when sunlight interacts with dewdrops on the grass, a fascinating optical phenomenon called Heiligenschein occurs. Dewdrops form tiny spheres on the blades of grass, which concentrate and reflect light in a peculiar way. When you observe your shadow in these conditions, you might notice a faint glow surrounding it. This glow, known as Heiligenschein, appears as a bright ring caused by the diffraction of light rays. It is visible around the shadow cast by a person's head on wet grass and creates a striking ethereal effect. This phenomenon is not only seen on Earth but also in space, where light bouncing off moon dust can create a halo effect around astronauts' heads, as famously captured in a photo of Neil Armstrong on the Moon.  \n\n\n**Video: Make your shadow glow with science - demonstrates Heiligenschein.**  \nhttps://www.youtube.com/watch?v=Vwia5\\_7\\_pSw", "id": "13motwh", "url": "https://www.reddit.com/r/dictionary/comments/13motwh/heiligenschein_hahyliguhnshahyn/", "created_utc": 1684580387.0, "score": 1, "permalink": "/r/dictionary/comments/13motwh/heiligenschein_hahyliguhnshahyn/", "comments": ["Neat!"], "URLs": ["https://www.youtube.com/watch?v=Vwia5\\_7\\_pSw"], "html_title": ["- YouTube"]}, {"title": "Anyone know the word for when someone thinks “they wouldn’t do that\" etc?", "selftext": "I can’t remember the word and it bothers me", "id": "13l8z04", "url": "https://www.reddit.com/r/dictionary/comments/13l8z04/anyone_know_the_word_for_when_someone_thinks_they/", "created_utc": 1684439547.0, "score": 1, "permalink": "/r/dictionary/comments/13l8z04/anyone_know_the_word_for_when_someone_thinks_they/", "comments": ["Naive", "the action is *uncharacteristic* of them."], "URLs": [], "html_title": []}, {"title": "Simper - Contextual Meaning", "selftext": "", "id": "13l7z60", "url": "/r/grammar/comments/13l7ye2/simper_contextual_meaning/", "created_utc": 1684437229.0, "score": 2, "permalink": "/r/dictionary/comments/13l7z60/simper_contextual_meaning/", "comments": [], "URLs": [], "html_title": []}, {"title": "A word for something that is close to being accurate, but is accurate in the ways that matter most.", "selftext": "In other words, I'm looking for a word that means something is near or almost at being completely exact with the properties of another thing, but it *is* exact in the (semantic) ways it matters the most.\n\nI've looked up \"principally\" and \"fundamentally,\" but they seem to be missing parts of the meaning I wish to convey. Maybe I can only express the above as a phrase. But even if so, any suggestions? I appreciate your time and help.", "id": "13jgds8", "url": "https://www.reddit.com/r/dictionary/comments/13jgds8/a_word_for_something_that_is_close_to_being/", "created_utc": 1684269187.0, "score": 2, "permalink": "/r/dictionary/comments/13jgds8/a_word_for_something_that_is_close_to_being/", "comments": ["I might say “for all intents and purposes”", "Essentially", "Is the word you’re looking for ‘approximately’?"], "URLs": [], "html_title": []}, {"title": "How do you normally hearing the word “childish?”", "selftext": "I’m in a debate over this.\n\nHow do you usually interpret the word when you hear it?\n\nExcuse my grammar above. I just noticed and can’t change it.\n\n[View Poll](https://www.reddit.com/poll/13hmpt1)", "id": "13hmpt1", "url": "https://www.reddit.com/r/dictionary/comments/13hmpt1/how_do_you_normally_hearing_the_word_childish/", "created_utc": 1684096767.0, "score": 1, "permalink": "/r/dictionary/comments/13hmpt1/how_do_you_normally_hearing_the_word_childish/", "comments": ["It could depend on context but usually you would say \"childlike\" for the positive implications--innocent, a sense of wonder, etc.", "But it's \"childish\" not \"childlike\", and \"childish\" is predominantly used as a pejorative term since it is seldom applied towards children as it is rather obvious children are \"childish\", and is almost always aimed at adults to describe their behavior, who are expected to behave maturely, and not immaturely, which \"childish\" is used as a synonym for.", "The word ‘childish’ focuses on the negative aspects of a child.\n\nThe word ‘childlike’ focuses on the positive aspects of a child.", "I agree.", "Speaking of context, I misread yours, but after reading your post again I understand what you are saying, which is that the word \"childlike\", instead of \"childish\" would usually be used when positively comparing someone to a child, which I completely agree with.  Childlike is even defined as: \n\n\"(of an adult) having good qualities associated with a child.\"", "No worries. I appreciate the clarification."], "URLs": ["https://www.reddit.com/poll/13hmpt1)"], "html_title": ["poll"]}, {"title": "Help: what does those \"-\" mean? That isn't syllabic divisions, but then what is it?", "selftext": "I were reading a german dictionary for Old Saxon, and saw that. Example: abandsterro, aband-ster-r-o. Could it be morphological division?", "id": "13h87f5", "url": "https://www.reddit.com/r/dictionary/comments/13h87f5/help_what_does_those_mean_that_isnt_syllabic/", "created_utc": 1684058451.0, "score": 1, "permalink": "/r/dictionary/comments/13h87f5/help_what_does_those_mean_that_isnt_syllabic/", "comments": [], "URLs": [], "html_title": []}, {"title": "New Word: Supergiant -- Learn What makes a star a \"supergiant\"and how does our Sun compare?", "selftext": "\\\\**supergiant. \\[ soo-per-jahy-uhnt \\]**  \n**noun**  \nAstronomy. supergiant star.  \nan extremely large or powerful person, company, thing, etc.  \n\n\n**adjective**  \nextremely large; immense.\n\n&#x200B;\n\nVideo: [https://youtube.com/watch?v=f1QPyssaG\\_w](https://youtube.com/watch?v=f1QPyssaG_w)", "id": "13frrdh", "url": "https://www.reddit.com/r/dictionary/comments/13frrdh/new_word_supergiant_learn_what_makes_a_star_a/", "created_utc": 1683913032.0, "score": 1, "permalink": "/r/dictionary/comments/13frrdh/new_word_supergiant_learn_what_makes_a_star_a/", "comments": [], "URLs": ["https://youtube.com/watch?v=f1QPyssaG\\_w](https://youtube.com/watch?v=f1QPyssaG_w)"], "html_title": ["- YouTube"]}, {"title": "A word that describes being so good at something it is suspicious or guilty", "selftext": "Is there a word that relates to being so good at something so quickly it's suspicious. An example would be being able win a competition of skii jumping after never skiied before. Where it may be possible but highly unlikely and be literally unbelievable. \n\nOr getting so good at something so quickly it invokes guilt. In my head I picture an athlete that has trained for years to achieve something, while someone with natural skill and no hard work can achieve the same thing. Making the naturally gifted person feel as though they didn't earn the outcome. \n\nI know these are both super specific but I'd love to know if there is a word that describes these.", "id": "13fj9wn", "url": "https://www.reddit.com/r/dictionary/comments/13fj9wn/a_word_that_describes_being_so_good_at_something/", "created_utc": 1683893191.0, "score": 1, "permalink": "/r/dictionary/comments/13fj9wn/a_word_that_describes_being_so_good_at_something/", "comments": ["Imposter?"], "URLs": [], "html_title": []}, {"title": "Charlatan", "selftext": "Google definition: *a person **falsely claiming** to have a special knowledge or skill; a fraud.*\n\nFor a person to be considered a charlatan, does the individual have to be aware of the falsehood of their claims? \n\nIn other words: If a person has deluded themselves into believing that they have some skill, even when that is demonstrably false, are they a charlatan?\n\nIf not, is there a better word to describe this person?\n\n(Note: this question is not in regard to any real person, but rather a character from a video game)", "id": "13dmnp8", "url": "https://www.reddit.com/r/dictionary/comments/13dmnp8/charlatan/", "created_utc": 1683715026.0, "score": 3, "permalink": "/r/dictionary/comments/13dmnp8/charlatan/", "comments": ["Generally speaking, yes, the word *Charlatan* usually means someone who is knowingly and willingly deceiving their audience. See also mountebank, humbug, snake oil salesman, huckster, quack, and fraud.   \nI can’t think of any single words that mean a person who has fallen into believing their own lies. There are several phrases, such as “drunk their own Kool-Aid”, “high on their own supply”, or “smelling their own farts”, which all mean roughly the same thing. You could probably use the word Charlatan to get this idea across, but you’d need to provide enough context to show that they had gone so far in their con that they had started to believe it themselves."], "URLs": [], "html_title": []}, {"title": "orrery. Pronounced [ awr-uh-ree ]", "selftext": "**Noun**  \nan apparatus for representing the positions, motions, and phases of the planets, satellites, etc., in the solar system.\n\n**WHAT IS THE ORIGIN OF ORRERY?**  \nOrrery is the namesake of Charles Boyle, Earl of Orrery. Orrery is the anglicized version of the Irish place name (or toponym) Orbhraighe, in which Orbh is an Irish name and -raighe is a common suffix roughly meaning “people of.” Orrery was first recorded in English around 1710.  \nEXAMPLE OF ORRERY USED IN A SENTENCE  \nThe astronaut turned the old orrery’s crank to determine when the next eclipse would occur.\n\n**Explained through this DIY orrery... explaining why we only see one side of the moon.**\n\n[https://youtube.com/watch?v=6Pe7jKbnCZU](https://youtube.com/watch?v=6Pe7jKbnCZU)", "id": "139k4g5", "url": "https://www.reddit.com/r/dictionary/comments/139k4g5/orrery_pronounced_awruhree/", "created_utc": 1683372060.0, "score": 1, "permalink": "/r/dictionary/comments/139k4g5/orrery_pronounced_awruhree/", "comments": [], "URLs": ["https://youtube.com/watch?v=6Pe7jKbnCZU](https://youtube.com/watch?v=6Pe7jKbnCZU)"], "html_title": ["Why You’ve Never Seen the Back Side of the Moon - YouTube"]}, {"title": "Is “depictive” a word?", "selftext": "", "id": "13852kr", "url": "https://www.reddit.com/r/dictionary/comments/13852kr/is_depictive_a_word/", "created_utc": 1683246263.0, "score": 2, "permalink": "/r/dictionary/comments/13852kr/is_depictive_a_word/", "comments": ["yea"], "URLs": [], "html_title": []}, {"title": "Synonym for lip service", "selftext": "What exactly is that term for promoting something but not actually acting on it? It’s like lip service but not exactly. I forgot the term. English is not my first language.", "id": "137gh9c", "url": "https://www.reddit.com/r/dictionary/comments/137gh9c/synonym_for_lip_service/", "created_utc": 1683195829.0, "score": 1, "permalink": "/r/dictionary/comments/137gh9c/synonym_for_lip_service/", "comments": ["I’d say “Lip Service” is a perfectly acceptable phrase. However, you might try “Empty Promises” for something less idiomatic.", "Hypocrisy?", "Flattery?", "sycophant? obsequious?", "It’s synonymous to that. I swear there’s a term for that which I believe was just recently made.", "Found it. It's virtue signaling.", "It’s a new term. I think it’s a compound word. I forgot about it. You use it to express agreement in current social sentiment or attitude but you don’t actually mean it or will act on it."], "URLs": [], "html_title": []}, {"title": "is there a word for \"a journey with the express intent of finding meaning or purpose in one's life - especially after a period of grief or turmoil?\"", "selftext": "", "id": "137azsu", "url": "https://www.reddit.com/r/dictionary/comments/137azsu/is_there_a_word_for_a_journey_with_the_express/", "created_utc": 1683177876.0, "score": 3, "permalink": "/r/dictionary/comments/137azsu/is_there_a_word_for_a_journey_with_the_express/", "comments": ["Spiritual quest", "I can't come up with a more exact one except for *'reflection', 'contemplation', 'meditation', 'rumination'*, which all focus on the ponderance part of your question, but I think they point in the direction you want. Or perhaps *'soul-searching'*?", "In NZ English, going bush. Possibly going walkabout in Australian English but I think there's not necessarily a negative reason for setting out.", "Pilgrimage"], "URLs": [], "html_title": []}, {"title": "WORD BLANK", "selftext": "OK so a while back I saw a word related to light and was wondering if anyone can help me find a word thats definition is something involving \"a sliver of light\" as part of the definition", "id": "134jwhc", "url": "https://www.reddit.com/r/dictionary/comments/134jwhc/word_blank/", "created_utc": 1682940624.0, "score": 2, "permalink": "/r/dictionary/comments/134jwhc/word_blank/", "comments": ["One of the definitions of “ray” is a “a narrow beam of light”", "Gleam?", "Scintilla?", "Coruscation?", "Everyone is giving some great suggestions but the word is a lot more rare like paracosm type rare this is a word that sounds Shakespearean almost", "Thanks but not quite it. This had to be one of the most beautiful words I've ever seen but can't remem", "No sadly", "No but that is nice", "Interesting but no", "Try entering “ray” in a thesaurus?", "crepuscular? 🤔"], "URLs": [], "html_title": []}, {"title": "PLAGA", "selftext": "I was playing wordle and I accidentally typed in PLAGA because I was just trying words.  I tried a few dictionaries but can’t find a consistent definition.  Anyone?", "id": "13472gh", "url": "https://www.reddit.com/r/dictionary/comments/13472gh/plaga/", "created_utc": 1682899177.0, "score": 1, "permalink": "/r/dictionary/comments/13472gh/plaga/", "comments": [], "URLs": [], "html_title": []}, {"title": "Hack together?", "selftext": "Is \"hack together\" a common phrase meaning do something roughly and quickly?  As in, he hacked together the project?  My husband insists that it is, but the only websites that seem to agree with him are less reputable online dictionaries that copy and pasted the same definition.  Thanks!", "id": "1344d1l", "url": "https://www.reddit.com/r/dictionary/comments/1344d1l/hack_together/", "created_utc": 1682892205.0, "score": 3, "permalink": "/r/dictionary/comments/1344d1l/hack_together/", "comments": ["I've never heard that phrase before, and it's not listed as a meaning on the Merriam Webster website. But, if I were to hear him use that phrase in casual conversation, I'd know roughly what he meant, since it's similar to the definition \"working for hire especially with mediocre professional standards\", as in \"*hack* journalism\".  \nLanguage is tricky; I can't agree that it's a \"common phrase\", but I can't say that it's exactly *wrong*, either. Language changes all the time, and this meaning, while novel, is closely-enough related to other meanings to feel mutually intelligible. Still, it sounds like something he made up himself.", "Yeah I've actually heard this before! There's also a variation that I think is more common in England of \"whacking together\" something like a meal or \"whack up\" a cup of tea. There's also hack job as well to describe work like that (roughly done often improvised stuff, inexperienced diy). I will say I'm from Midwest USA which influences a lot of the slang I know and I've got family all over so I pick up a lot of strange things", "I've heard the phrase a few times, but certainly not often. It's meaning is generally similar to [jerry-rig/jury-rig](https://www.dictionary.com/e/jury-rigged-vs-jerry-rigged/), or put together quickly or by unconventional means. \n\nI have heard jerry-rig, or just rig it, more often."], "URLs": [], "html_title": []}, {"title": "retrograde [ re-truh-greyd ] - adjective / verb -- Use case \"Mercury in Retrograde\"", "selftext": "# retrograde [ re-truh-greyd ]\n\n***adjective*** \n\nmoving backward; \n\nhaving a backward motion or direction; \n\nretiring or retreating.inverse or reversed, as order. *Chiefly Biology*. exhibiting degeneration or deterioration.\n\n***verb (used without object),*** **ret·ro·grad·ed, ret·ro·grad·ing.**\n\nto move or go backward; retire or retreat.*Chiefly Biology*. \n\nto decline to a worse condition; \n\ndegenerate.\n\n***verb (used with object),*** **ret·ro·grad·ed, ret·ro·grad·ing.** ***Archaic*****. to turn back.**\n\nRetrograde in the context of the phrase \"Mercury being in Retrograde?\" and the meaning behind that with the word Retrograde embedded in video.   \n\n[https://youtube.com/watch?v=Nj-OlBozSyw](https://youtube.com/watch?v=Nj-OlBozSyw)", "id": "132tduj", "url": "https://www.reddit.com/r/dictionary/comments/132tduj/retrograde_retruhgreyd_adjective_verb_use_case/", "created_utc": 1682776115.0, "score": 1, "permalink": "/r/dictionary/comments/132tduj/retrograde_retruhgreyd_adjective_verb_use_case/", "comments": [], "URLs": ["https://youtube.com/watch?v=Nj-OlBozSyw](https://youtube.com/watch?v=Nj-OlBozSyw)"], "html_title": ["What Does Mercury in Retrograde Mean Astronomically? - YouTube"]}, {"title": "I am looking for a word", "selftext": "What is the word for a person that can easily be replaced? I found 2 words, but they don't use for humans so much. interchangeable and disdisposable", "id": "132rep0", "url": "https://www.reddit.com/r/dictionary/comments/132rep0/i_am_looking_for_a_word/", "created_utc": 1682770665.0, "score": 1, "permalink": "/r/dictionary/comments/132rep0/i_am_looking_for_a_word/", "comments": ["Expendable", "Fungible", "I just realized, also: redundant\n\nWhen a company lays off someone because of redundancy."], "URLs": [], "html_title": []}, {"title": "Where can I find the letter æ?", "selftext": "", "id": "12x7wld", "url": "https://www.reddit.com/r/dictionary/comments/12x7wld/where_can_i_find_the_letter_æ/", "created_utc": 1682322809.0, "score": 3, "permalink": "/r/dictionary/comments/12x7wld/where_can_i_find_the_letter_æ/", "comments": ["On Google. You look up  ae character and find it on Google. Or on a phone you hold a then it will appear then you move your finger over to it then let go. æ.", "Nowhere. It is a symbol to a sound. Used in transcription.", "Here's a useful place: [https://altcodeunicode.com/alt-codes-letter-a-with-accents/](https://altcodeunicode.com/alt-codes-letter-a-with-accents/)\n\nWhenever I'm looking for accents for letters I use \"insert letter here\" accents.\n\non the bottom of this one it features Æ, just like for t accents for altcodeunicode it shows thorn at the bottom as well.\n\nAlso just like eszett, Æ and Thorn have their own wikipedia pages, but personally I find altcodeunicode to be the most useful.\n\nAlso for PC, I believe there is alt and a combination of numbers to get a specific letter.", "Damn Thats lame"], "URLs": [], "html_title": []}, {"title": "What's the Word: Quirk Synonym", "selftext": "I've tried the synonym generators. No joy. There's a word that means something like \"quirk\" or \"eccentricity\" that has a particularly British feel to it (the words bailiwick and higgledy-piggledy \"feel\" like it). It probably doesn't help much, but it would replace quirks in: \"Tim would find dating easier if it wasn't for his own little relationship quirks.\"\n\nAny help is much appreciated!", "id": "12w3wkz", "url": "https://www.reddit.com/r/dictionary/comments/12w3wkz/whats_the_word_quirk_synonym/", "created_utc": 1682245284.0, "score": 1, "permalink": "/r/dictionary/comments/12w3wkz/whats_the_word_quirk_synonym/", "comments": [], "URLs": [], "html_title": []}, {"title": "Whats a word for the the feminine equivalent of emasculation?", "selftext": "Whats the word for the feminine equivalent of emasculation? Is there one?", "id": "12vuo8h", "url": "https://www.reddit.com/r/dictionary/comments/12vuo8h/whats_a_word_for_the_the_feminine_equivalent_of/", "created_utc": 1682222056.0, "score": 3, "permalink": "/r/dictionary/comments/12vuo8h/whats_a_word_for_the_the_feminine_equivalent_of/", "comments": ["*Defeminize* is the only word I can think of."], "URLs": [], "html_title": []}, {"title": "Offline Dictionary - English (Wear OS) Version 2", "selftext": "Android Wear OS Dictionary Application (Not for phones)\n\n&#x200B;\n\n* A Million of words on your wrist\n* Save words for future reference\n* Random Word feature to learn new words\n\n[Offline Dictionary - English – Apps on Google Play](https://play.google.com/store/apps/details?id=com.jackappsdev.dictionary_wear_en)\n\n[(100 Promo Codes)](https://docs.google.com/spreadsheets/d/1WKYT6cvnWxmvMI--t0XpbSjQ5pBtHqTiItwfaDX6ha0/edit#gid=0)\n\nYour feedback is valuable to me. Please take a moment to rate and leave a review about your experience using my app on Google Play\n\nI am happy to hear feedbacks and to improve this application further", "id": "12vuh2q", "url": "https://www.reddit.com/r/dictionary/comments/12vuh2q/offline_dictionary_english_wear_os_version_2/", "created_utc": 1682221616.0, "score": 1, "permalink": "/r/dictionary/comments/12vuh2q/offline_dictionary_english_wear_os_version_2/", "comments": [], "URLs": ["https://play.google.com/store/apps/details?id=com.jackappsdev.dictionary_wear_en)", "https://docs.google.com/spreadsheets/d/1WKYT6cvnWxmvMI--t0XpbSjQ5pBtHqTiItwfaDX6ha0/edit"], "html_title": ["Not Found", "Offline Dictionary - English Promo - Google Sheets"]}, {"title": "What’s that word?", "selftext": "When I took Massage Therapy, there was a word that referred to the direction of massage and blood flow as “to the heart”.\n\nPretty fuxkin’ sure it was “ascentripsis” (aye - sin - trip - sis) but for the life of me and all the spellings I can think of, I can’t find anything about this word and I’m officially pissed about it. I’ve checked any other reference I could think of as a source, including Ayurvedic terminology. A mission has been born. \n\nHelp me find this forsaken word that is currently breaking the internet on my side of the screen. PUHLEASS.", "id": "12vldhg", "url": "https://www.reddit.com/r/dictionary/comments/12vldhg/whats_that_word/", "created_utc": 1682201622.0, "score": 1, "permalink": "/r/dictionary/comments/12vldhg/whats_that_word/", "comments": [], "URLs": [], "html_title": []}, {"title": "Splaggers begone", "selftext": "In a biography of the British author Jan Struther, there's a reference to Struther deleting exclamation marks, which she calls \"splaggers.\"  Don't see the word in OED or Merriam-Webster. If it was her coinage, it was a good one.\nCitation info: \"The Real Mrs Miniver,\" by Ysenda Maxtone Graham. John Murray paperback, 2002, page 59.", "id": "12vf816", "url": "https://www.reddit.com/r/dictionary/comments/12vf816/splaggers_begone/", "created_utc": 1682189120.0, "score": 1, "permalink": "/r/dictionary/comments/12vf816/splaggers_begone/", "comments": [], "URLs": [], "html_title": []}, {"title": "Alex Dainis explains the word: radiant", "selftext": "Alex Dainis explains the word **radiant** \\[ **rey**\\-dee-*uh*nt \\]\n\n***adjective*** emitting rays of light; shining; bright:*the radiant sun; radiant colors.*bright with joy, hope, etc.:*radiant smiles; a radiant future.Physics*. emitted or propagated by radiation.*Heraldry*.\n\n1. noting a partition line having a series of flamelike indentations formed by ogees joined in zigzags; rayonny.\n2. (of a charge, as an ordinary) having an edge or edges so formed.\n\n***noun***  a point or object from which rays proceed.*Astronomy*. the point in the heavens from which a shower of meteors appears to radiate.\n\n&#x200B;\n\n[https://youtube.com/watch?v=MEe8vBpKKcY](https://youtube.com/watch?v=MEe8vBpKKcY)", "id": "12v50m6", "url": "https://www.reddit.com/r/dictionary/comments/12v50m6/alex_dainis_explains_the_word_radiant/", "created_utc": 1682167810.0, "score": 5, "permalink": "/r/dictionary/comments/12v50m6/alex_dainis_explains_the_word_radiant/", "comments": [], "URLs": ["https://youtube.com/watch?v=MEe8vBpKKcY](https://youtube.com/watch?v=MEe8vBpKKcY)"], "html_title": ["The Lyrid Meteor Shower is going to be Radiant! - YouTube"]}, {"title": "Can anyone tell me the term for a point of light in art", "selftext": "I don't know what to say other than what was already said in the thread title. I just want to know what is the correct name for something like this:  \nhttps://imgur.com/vXQg2Ob   \nhttps://imgur.com/OLIvMBa", "id": "12v237x", "url": "https://www.reddit.com/r/dictionary/comments/12v237x/can_anyone_tell_me_the_term_for_a_point_of_light/", "created_utc": 1682159925.0, "score": 1, "permalink": "/r/dictionary/comments/12v237x/can_anyone_tell_me_the_term_for_a_point_of_light/", "comments": [], "URLs": ["https://imgur.com/vXQg2Ob", "https://imgur.com/OLIvMBa"], "html_title": ["Imgur: The magic of the Internet"]}, {"title": "Gift.", "selftext": "I want to buy my brother a dictionary for his graduation gift. He is graduating from highschool and going to College for writing. I wanted to give him a tool that will help. However, I don't know which one is the best for this. I saw this one ([gift idea](https://www.barnesandnoble.com/w/oxford-dictionary-of-english-oxford-dictionaries-staff/1108822751)) but I saw it was published in 2010. How often should you update your dictionaries and is this one too out of date?", "id": "12uhk9o", "url": "https://www.reddit.com/r/dictionary/comments/12uhk9o/gift/", "created_utc": 1682109593.0, "score": 2, "permalink": "/r/dictionary/comments/12uhk9o/gift/", "comments": ["Dictionaries are updated yearly, iirc. If I were you, I would email or call an English professor. Many professors I know are happy to help for things that involve their subjects. You might also ask on r/ENGLISH?"], "URLs": ["https://www.barnesandnoble.com/w/oxford-dictionary-of-english-oxford-dictionaries-staff/1108822751))"], "html_title": ["w oxford dictionary of english oxford dictionaries staff"]}, {"title": "How is this not already a word?", "selftext": "Made a craigslist post for renting out an extra bedroom in my apartment, and while discussing moving a bed into the room with a prospective new roommate, I wrote that it may be hard to maneuver a large, inflexible, or unassembleable bed into the room given the small hallway. I was flabbergasted at the red line under \"unassembleable\". How has this not already been used? Seems pretty simple to me, means \"not able to be assembled\" while also meaning \"not able to be broken down in order to reassemble\"", "id": "12ufk9x", "url": "https://www.reddit.com/r/dictionary/comments/12ufk9x/how_is_this_not_already_a_word/", "created_utc": 1682105677.0, "score": 1, "permalink": "/r/dictionary/comments/12ufk9x/how_is_this_not_already_a_word/", "comments": ["Disassembled. The structure of the sentence is where the problem is.  “it may be hard to maneuver a large, inflexible, assembled bed” or “it may be hard to maneuver a large, inflexible bed that can’t be disassembled” I think would be more correct to say. So it’s not that the word doesn’t exist, it’s that the structure of the sentence you were trying to say didn’t quite work with the word you were attempting to force into place"], "URLs": [], "html_title": []}, {"title": "Can't remember a word!!", "selftext": "So I know there's a word for when you think of doing impulsive things but you know you won't actually do them... It's like the thrill of thinking of these situations.. so when you're driving a car and you're like I could literally swerve off the verge right now. But you don't actually do it. I heard this word once because there's a song about it and an artist was talking about it on Radio 1 but I can't for the life of me remember what it was !! Help :)", "id": "12se25b", "url": "https://www.reddit.com/r/dictionary/comments/12se25b/cant_remember_a_word/", "created_utc": 1681946389.0, "score": 3, "permalink": "/r/dictionary/comments/12se25b/cant_remember_a_word/", "comments": ["Ideation", "I know this isn't right, but https://youtu.be/3L0GjnOOR18?t=5", "It’s not a single word but I think you’re thinking of “call of the void”.", "Intrusive thoughts? Try r/tipofmytongue !", "Also known as “l'appel du vide”. Originally a french phrase."], "URLs": [], "html_title": []}, {"title": "What is the best hardcopy dictionary for a home setting?", "selftext": "I hear that oxford is the best, but I can't be sure; I suppose it's down to preference and interproration.\n\nI want something that is reliable and will last me for years to come. Basically what I'm looking for;\n\n&#x200B;\n\n&#x200B;\n\n1. A generally large book with many entries (I guess somewhere in between a school dictionary and a corpus (something found in a library perhaps.)\n2. Up to date. (As recent as possible)\n3. The physical quality of the book is good and will last a long time (binding, pages, printing etc.)\n4. Hardback\n\n&#x200B;\n\nAny ideas?", "id": "12prx32", "url": "https://www.reddit.com/r/dictionary/comments/12prx32/what_is_the_best_hardcopy_dictionary_for_a_home/", "created_utc": 1681756237.0, "score": 3, "permalink": "/r/dictionary/comments/12prx32/what_is_the_best_hardcopy_dictionary_for_a_home/", "comments": ["In the States, I would use Merriam-Webster collegiate editions.", "New Oxford American Dictionary"], "URLs": [], "html_title": []}, {"title": "Dictionary recommendations (Difficult Words)", "selftext": "Hello!\n\nI've been looking for dictionaries that specifically contain **difficult** and **obscure** words. So far I've found these:\n\n- Archie Hobson - *The Oxford Dictionary of Difficult Words*\n- Eugene Ehrlich - *The Highly Selective Thesaurus for the Extraordinarily Literate*\n- David Olsen - *Roget's Thesaurus of Words for Writers*\n- David Olsen - *Roget's Thesaurus of Words for Intellectuals*\n\nThe *Highly Selective Thesaurus* is a little too... highly selective for practical use, although some entries are definitely useful (and it's very entertaining overall).\n\nThe *Oxford* dictionary was often used by David Foster Wallace – an author I deeply admire. I wonder if there are more such dictionaries that I might have missed. If you know any, please do recommend!\n\nP.S. The goal is practical use **but also edification**, so let loose your suggestions!", "id": "12nmhmj", "url": "https://www.reddit.com/r/dictionary/comments/12nmhmj/dictionary_recommendations_difficult_words/", "created_utc": 1681600533.0, "score": 2, "permalink": "/r/dictionary/comments/12nmhmj/dictionary_recommendations_difficult_words/", "comments": ["Can you give me campers of these words and how often are they used in today’s society?"], "URLs": [], "html_title": []}, {"title": "Help me add a new word to the dictionary", "selftext": "There is a word that doesn't (to my knowledge) exist. That word is tooterful. It means for someone/something to be cat-like, as in elegant, sensitive, friendly, emotionally attached, and other cat-like acts/feelings. At least that's what it will mean once we add it to the dictionary. So please, help me with my mission to add a new word to the dictionary. Tooterful.", "id": "12m4xw4", "url": "https://www.reddit.com/r/dictionary/comments/12m4xw4/help_me_add_a_new_word_to_the_dictionary/", "created_utc": 1681493720.0, "score": 0, "permalink": "/r/dictionary/comments/12m4xw4/help_me_add_a_new_word_to_the_dictionary/", "comments": ["It sounds like it means a beautiful being that has excessive flatulence.", "Which dictionary?", "The written ones", "So you want us to send letters to all the publishing houses that are still making print dictionaries asking them to include your word in their next edition?", "Nah we need to use the word so they recognise it", "Did you make up this word?", "All words are made up"], "URLs": [], "html_title": []}, {"title": "With the Solar Maximum approach great time to teach the Science behind Auroras. What causes them? The colors? Science Word of the Week: Aurora", "selftext": " aurora\n\n\\[ *uh*\\-**rawr**\\-*uh* \\]\n\n*noun*\n\na radiant emission from the upper atmosphere that occurs sporadically over the middle and high latitudes of both hemispheres in the form of luminous bands, streamers, or the like.\n\nExplanatory Video: [https://youtube.com/watch?v=kPVjGRvf8b0](https://youtube.com/watch?v=kPVjGRvf8b0)", "id": "12m4437", "url": "https://www.reddit.com/r/dictionary/comments/12m4437/with_the_solar_maximum_approach_great_time_to/", "created_utc": 1681492114.0, "score": 1, "permalink": "/r/dictionary/comments/12m4437/with_the_solar_maximum_approach_great_time_to/", "comments": [], "URLs": ["https://youtube.com/watch?v=kPVjGRvf8b0](https://youtube.com/watch?v=kPVjGRvf8b0)"], "html_title": ["The Science Behind Auroras’ Spectacular Light Shows - YouTube"]}, {"title": "Adding merriam-webster.com to Definer popup dictionary browser extension", "selftext": "", "id": "12jrv35", "url": "/r/lumetrium_definer/comments/12jpspf/custom_source_example_adding_merriamwebstercom_to/", "created_utc": 1681317555.0, "score": 1, "permalink": "/r/dictionary/comments/12jrv35/adding_merriamwebstercom_to_definer_popup/", "comments": [], "URLs": [], "html_title": []}, {"title": "I made two new words because the phrasal verbs “drop off” and “pick up” annoy me.", "selftext": "Statiere (stay-chur) - To drop off at a location. Derived from the German word for stationing, “stationiere”.\nAccoach - To pick up from a location.", "id": "12hpy7q", "url": "https://www.reddit.com/r/dictionary/comments/12hpy7q/i_made_two_new_words_because_the_phrasal_verbs/", "created_utc": 1681148277.0, "score": 0, "permalink": "/r/dictionary/comments/12hpy7q/i_made_two_new_words_because_the_phrasal_verbs/", "comments": ["What bothers you about drop off and pick up?", "Tell the dictionary people.", "I favor efficiently condensed sentences and had frustrating experiences with those phrases, since they represent simple concepts which require phrasal expression. I believe these words would tidy formal communication.", "Well, I apologize for my brevity. I was in fact surprised at your new words. I may find myself using them."], "URLs": [], "html_title": []}, {"title": "Word for somebody given a title/position they're unqualified for/undeserving of?", "selftext": "", "id": "12h1txs", "url": "https://www.reddit.com/r/dictionary/comments/12h1txs/word_for_somebody_given_a_titleposition_theyre/", "created_utc": 1681087853.0, "score": 1, "permalink": "/r/dictionary/comments/12h1txs/word_for_somebody_given_a_titleposition_theyre/", "comments": [], "URLs": [], "html_title": []}, {"title": "Out of Touch with Common People", "selftext": "Looking for a word to describe someone in a position of authority over you who can relate at all; in the “let them eat cake” sense", "id": "12e5oz2", "url": "https://www.reddit.com/r/dictionary/comments/12e5oz2/out_of_touch_with_common_people/", "created_utc": 1680832322.0, "score": 1, "permalink": "/r/dictionary/comments/12e5oz2/out_of_touch_with_common_people/", "comments": ["stuck in the ivory tower?", "bourgeoisie?", "I mean Boomer kinda has that connotation, being old/out of touch and typically trying to have an authority (like HOAs and Karens and shite) usually used derogatorily"], "URLs": [], "html_title": []}, {"title": "What do you call a person that sounds very confident even when being wrong in an argument?", "selftext": "I feel like the English dictionary has a word for this type of person. \n\nI'm talking about someone who argues something that is totally and completely wrong, but they do it with such confidence and confuse the opposition with their words so much that you would think they are right if you didn't know better.", "id": "12ci9u2", "url": "https://www.reddit.com/r/dictionary/comments/12ci9u2/what_do_you_call_a_person_that_sounds_very/", "created_utc": 1680696657.0, "score": 5, "permalink": "/r/dictionary/comments/12ci9u2/what_do_you_call_a_person_that_sounds_very/", "comments": ["Arrogant?", "I’d also like to know. “Overconfident” or r/confidentlyincorrect come to mind.", "Assertive?", "Blowhard", "Charlatan?", "**wanker**\r  \nnoun\r  \nwank·​er ˈwaŋ-kər \n\n\r  \n1\r chiefly British slang, usually vulgar : a person who masturbates\r  \n2\r chiefly British slang, usually vulgar : JERK, DOLT", "Not the word I am looking for, but I do like it. And it fits the guy like a hat."], "URLs": [], "html_title": []}, {"title": "A word that describes being innately simple or not complicated", "selftext": "As the title asks but with the hinting that anyone trying to make something characterized by this word more complicated is a corrupting or deceitful influence.", "id": "12ayc23", "url": "https://www.reddit.com/r/dictionary/comments/12ayc23/a_word_that_describes_being_innately_simple_or/", "created_utc": 1680556936.0, "score": 1, "permalink": "/r/dictionary/comments/12ayc23/a_word_that_describes_being_innately_simple_or/", "comments": ["My first thought was that it's Elementary, my dear Watson :P  \nIf you want to add the moral/corrupting element, try wholesome, innocent, guileless, uncorrupted, or, in the right context, bucolic.", "I like these options. Thanks."], "URLs": [], "html_title": []}, {"title": "Ever feel foggy when you wake up? There's a Science Word for that... hypnopompic", "selftext": "hypnopompic \\[ hip-n*uh*\\-**pom**\\-pik \\]\n\n*adjective* *Psychology*.\n\nof or relating to the semiconscious state prior to complete wakefulness.\n\n&#x200B;\n\n[https://www.youtube.com/watch?v=EiJPVHQZjFg](https://www.youtube.com/watch?v=EiJPVHQZjFg)", "id": "129j262", "url": "https://www.reddit.com/r/dictionary/comments/129j262/ever_feel_foggy_when_you_wake_up_theres_a_science/", "created_utc": 1680436575.0, "score": 6, "permalink": "/r/dictionary/comments/129j262/ever_feel_foggy_when_you_wake_up_theres_a_science/", "comments": [], "URLs": ["https://www.youtube.com/watch?v=EiJPVHQZjFg](https://www.youtube.com/watch?v=EiJPVHQZjFg)"], "html_title": ["Ever Feel Foggy When You Wake Up? Hypnopompic State Explained! 😴🧠 - YouTube"]}, {"title": "Trying to find out if there's a word or phrase for this type of behaviour", "selftext": "The behaviour in trying to define is one for the following type of situation.\n\nA: *presents incorrect information/process/assessment*\nB: *explains the correction*\nA: *acts like you agreed with them*\n \nAssume the information is not subject to interpretation but factual and demonstrable. This can be repeated several times before the loop ends. It can end either with them leaving the conversation never acknowledging the dissonance, or eventually noticing that the conversation is not progressing and allowing the correction. \n\nI feel like this is probably a behaviour defined in psychology circles but don't know the definition. I'm not sure gaslighting is correct.", "id": "128sabz", "url": "https://www.reddit.com/r/dictionary/comments/128sabz/trying_to_find_out_if_theres_a_word_or_phrase_for/", "created_utc": 1680368890.0, "score": 1, "permalink": "/r/dictionary/comments/128sabz/trying_to_find_out_if_theres_a_word_or_phrase_for/", "comments": ["feigning the reconciliation of a rectification, a performative agreement"], "URLs": [], "html_title": []}, {"title": "Word for a product that is specific or uniquely made for another product..", "selftext": "For example, a cable that is specific for apple phones, there is a word for that and I can’t for the life of me remember what it is. Please help. \n\n\nThanks", "id": "121pk01", "url": "https://www.reddit.com/r/dictionary/comments/121pk01/word_for_a_product_that_is_specific_or_uniquely/", "created_utc": 1679758486.0, "score": 1, "permalink": "/r/dictionary/comments/121pk01/word_for_a_product_that_is_specific_or_uniquely/", "comments": ["Proprietary?", "Yes!!! Thank you!\n\n* you know that feeling when a word you have used a hundred times is right on the tip of your tongue and then  *poof* it’s gone.", "Can you use it in a sentence please", "I get what you're aiming at but proprietary doesn't exactly mean something made specifically for something else", "The proprietary formula was a major success", "Thanks"], "URLs": [], "html_title": []}, {"title": "Science Word for Spring: Fructify", "selftext": "Fruit-Bearing Trees Fructify \n\n[https://youtube.com/watch?v=FyxrIBQBSrA](https://youtube.com/watch?v=FyxrIBQBSrA)\n\n# fructify\n\n\\[ **fruhk**\\-t*uh*\\-fahy, **fr*****oo*****k**\\-, **frook**\\- \\]\n\n&#x200B;\n\n*verb (used without object),* **fruc·ti·fied,** **fruc·ti·fy·ing.**\n\nto bear [fruit](https://www.dictionary.com/browse/fruit); become fruitful:*With careful tending the plant will fructify.*\n\n*verb (used with object),* **fruc·ti·fied,** **fruc·ti·fy·ing.**\n\nto make fruitful or productive; fertilize:*warm spring rains fructifying the earth.*", "id": "121nh66", "url": "https://www.reddit.com/r/dictionary/comments/121nh66/science_word_for_spring_fructify/", "created_utc": 1679754569.0, "score": 5, "permalink": "/r/dictionary/comments/121nh66/science_word_for_spring_fructify/", "comments": [], "URLs": ["https://youtube.com/watch?v=FyxrIBQBSrA](https://youtube.com/watch?v=FyxrIBQBSrA)", "https://www.dictionary.com/browse/fruit);"], "html_title": ["How Do Fruit-Bearing Trees Fructify? 🍋🍊 - YouTube", "Fruit); Definition & Meaning | Dictionary.com"]}, {"title": "?", "selftext": "Is there a word that means you yourself think you're overreacting to something when you are actually not?", "id": "120oivc", "url": "https://www.reddit.com/r/dictionary/comments/120oivc/_/", "created_utc": 1679673416.0, "score": 2, "permalink": "/r/dictionary/comments/120oivc/_/", "comments": ["Are looking for a noun, verb, adjective...?", "Probably an adjective"], "URLs": [], "html_title": []}, {"title": "Anyone know this word", "selftext": "Is there a word or term, for when a Lesbian grooms a man for the purpose of pregnancy then aborts the relationship. With the sole purpose just to get pregnant, using the man as a sperm sample under false pretences.", "id": "11yzly7", "url": "https://www.reddit.com/r/dictionary/comments/11yzly7/anyone_know_this_word/", "created_utc": 1679525040.0, "score": 0, "permalink": "/r/dictionary/comments/11yzly7/anyone_know_this_word/", "comments": ["I doubt this kind of thing happens often enough that it has a specific term to describe it.", "It’s fine to say you don’t know or are unaware. \nPlease don’t dishearten others form answering by invalidating the question."], "URLs": [], "html_title": []}, {"title": "Is there any good meronym dictionary?", "selftext": "If I look up the word boat, I should get: sail, hull, deck, anchor, etc.", "id": "11xgkbf", "url": "https://www.reddit.com/r/dictionary/comments/11xgkbf/is_there_any_good_meronym_dictionary/", "created_utc": 1679404611.0, "score": 3, "permalink": "/r/dictionary/comments/11xgkbf/is_there_any_good_meronym_dictionary/", "comments": [], "URLs": [], "html_title": []}, {"title": "Science Word: Gallinipper", "selftext": "[https://youtube.com/watch?v=DSrbkTBv12A](https://youtube.com/watch?v=DSrbkTBv12A)\n\ngallinipper\n\n\\[ **gal**\\-*uh*\\-nip-er \\] *noun* *Informal* .any of various insects that sting or bite, especially a large American mosquito, *Psorophora ciliata.*", "id": "11vmmhx", "url": "https://www.reddit.com/r/dictionary/comments/11vmmhx/science_word_gallinipper/", "created_utc": 1679235527.0, "score": 3, "permalink": "/r/dictionary/comments/11vmmhx/science_word_gallinipper/", "comments": [], "URLs": ["https://youtube.com/watch?v=DSrbkTBv12A](https://youtube.com/watch?v=DSrbkTBv12A)"], "html_title": ["What’s Worse Than A Mosquito Bite?🦟 A Gallinipper Bite! - YouTube"]}, {"title": "French word used in English to mean \"for lack of a better alternative \" something \"mieux\"", "selftext": "The phrase is French but is used in English to mean \n\n\"For lack of a better alternative \"\n\nI'm 99% certain it is two words and one of the words is \"mieux\" \n\nI believe the second word is mieux \n\n\nXxx mieux\n\nWas a Websters or dictionary .com word of the day within the last couple years \n\nAnyone know", "id": "11mj6ji", "url": "https://www.reddit.com/r/dictionary/comments/11mj6ji/french_word_used_in_english_to_mean_for_lack_of_a/", "created_utc": 1678337717.0, "score": 3, "permalink": "/r/dictionary/comments/11mj6ji/french_word_used_in_english_to_mean_for_lack_of_a/", "comments": ["In lieu of", "Faute de mieux [link](https://www.merriam-webster.com/dictionary/faute%20de%20mieux)", "That's wrong\n\nAnd you didn't read thread", "Thank you !", "What thread OP?", "What's thread?"], "URLs": [], "html_title": []}, {"title": "Hated by God", "selftext": "Hello, I tried Google but I just kept getting Christian stuff lol. Is there a word for someone that is \"Hated by God\"? Not someone that hates god/gods as Google keeps thinking im asking, but someone that God hates? Thanks for any help.", "id": "11mhc19", "url": "https://www.reddit.com/r/dictionary/comments/11mhc19/hated_by_god/", "created_utc": 1678332318.0, "score": 3, "permalink": "/r/dictionary/comments/11mhc19/hated_by_god/", "comments": ["Damned?", "Heathen?", "Forsaken", "Cursed?\n\nThat's the only word I can think of", "Anathema?", "Uncircumcised Philistine.\n\nUnfavored \n\n[God’s hate](https://www.ligonier.org/learn/devotionals/gods-love-and-gods-hatred)", "I'd say \"Abomination\". The word is often used in English translations of the Bible to describe things that are detested by both God and Man, or things that [\"ceremonially impure\"](https://www.etymonline.com/search?q=abomination&ref=searchbar_searchhint), according to Etymonline. Wikipedia has a [short article](https://en.wikipedia.org/wiki/Abomination_(Bible\\)) describing the word in relation to the Bible"], "URLs": [], "html_title": []}, {"title": "Looking for the word for the useless designs, pieces/textures of large objects to give more details. Examples can be seen on movie models of Star Destroyers and the Death Star from the original Star Wars trilogy", "selftext": "", "id": "11m3kmw", "url": "https://www.reddit.com/r/dictionary/comments/11m3kmw/looking_for_the_word_for_the_useless_designs/", "created_utc": 1678299221.0, "score": 1, "permalink": "/r/dictionary/comments/11m3kmw/looking_for_the_word_for_the_useless_designs/", "comments": ["I believe your looking for the word greeble(s) https://en.m.wikipedia.org/wiki/Greeble", "\"Nurnie\" can also be used to describe these details."], "URLs": [], "html_title": []}, {"title": "Looking for a word that means this ⏬️", "selftext": "Any words that describe feeling happiness after severe abuse/trauma? \n\nLike - words to describe someone you knew suffered incredibly and kinda \"Karma\"d their way into deserved joy?", "id": "11ik2x1", "url": "https://www.reddit.com/r/dictionary/comments/11ik2x1/looking_for_a_word_that_means_this/", "created_utc": 1677980977.0, "score": 1, "permalink": "/r/dictionary/comments/11ik2x1/looking_for_a_word_that_means_this/", "comments": ["Schadenfreude, or shameful happiness.", "Happiness due to experiencing the trauma? Or due to \"overcoming/leaving\" the trauma?", "Wait. But wouldn't that mean you are happy DUE TO someone else's misfortune?", "leaving:)", "Oh yes that’s what it means. Sorry I must have misunderstood! Sounds like you want something more like catharsis?", "OMG THAT IS LITERALLY IT. You have so much vocabulary, what a fancy word haha ♡ Thank you very muxh"], "URLs": [], "html_title": []}, {"title": "Science Word of the Week: Pluvial", "selftext": "\\[ **ploo**\\-vee-*uh*l \\]\n\n*adjective*\n\nof or relating to rain, especially much rain; rainy.\n\nRain is an important part of the water cycle. The sun heats up water on the surface, causing it to evaporate. The water vapor then cools and condenses into clouds and droplets and falls back down to Earth as precipitation such as rain and hail and sleet.\n\n[https://youtube.com/watch?v=d0S6NjBjS3w](https://youtube.com/watch?v=d0S6NjBjS3w)", "id": "11h2tzp", "url": "https://www.reddit.com/r/dictionary/comments/11h2tzp/science_word_of_the_week_pluvial/", "created_utc": 1677855572.0, "score": 6, "permalink": "/r/dictionary/comments/11h2tzp/science_word_of_the_week_pluvial/", "comments": ["One of my friend's favorite words!", "It just sounds so nice to say!"], "URLs": ["https://youtube.com/watch?v=d0S6NjBjS3w](https://youtube.com/watch?v=d0S6NjBjS3w)"], "html_title": ["Are Extreme Rain Events On The Rise? Explaining Pluvial Weather ☔ - YouTube"]}, {"title": "Question: What is the word used to describe the adjusting of the amount of water that comes through a faucet?", "selftext": "I feel dumb because I can't remember it and have been thinking about it for a few days now...", "id": "11h2ggp", "url": "https://www.reddit.com/r/dictionary/comments/11h2ggp/question_what_is_the_word_used_to_describe_the/", "created_utc": 1677854560.0, "score": 1, "permalink": "/r/dictionary/comments/11h2ggp/question_what_is_the_word_used_to_describe_the/", "comments": ["Siphon?", "I’d say you adjust the flow of the water?", "No, not quite. Nothing to do with removing or sucking water or whatever fluid out. Just has to do with adjusting the amount, either more or less."], "URLs": [], "html_title": []}, {"title": "Jealousy", "selftext": "Sorry for grammar. This may be the wrong place but I figured it’s better then nothing. I’m looking for a word like jealousy, jealous except nicer/better, let me explain. When someone can do, have or get something that I want it doesn’t make me up set or resent them In anyway I am genuinely happy for them I just wish I could have, get or do it to. I’ve read the definition for jealousy and envy and they are always displayed negative. What is a word that I can use that displays joy but also the want for the same thing as some else?", "id": "11gqhn2", "url": "https://www.reddit.com/r/dictionary/comments/11gqhn2/jealousy/", "created_utc": 1677815641.0, "score": 2, "permalink": "/r/dictionary/comments/11gqhn2/jealousy/", "comments": ["You **aspire** to the same thing.", "Avarice but it’s associated with greed. Covet but it’s associated with jealousy. Sorry, when a religion makes it a sin then it’s kinda hard to find positive language.", "Yes! Thank you I actually think that’s perfect!"], "URLs": [], "html_title": []}, {"title": "help with the word “delusive”", "selftext": "I want to use delusive instead of illusory in a poem and the only example sentence is “the delusive light of Venice”. However, what does that mean? In what ways can the light of a city ‘give a false or misleading impression’? \n\nif anyone has any insight it’d be greatly appreciated. of course, I could go with a word I understand better, but like the aesthetic…", "id": "11due4m", "url": "https://www.reddit.com/r/dictionary/comments/11due4m/help_with_the_word_delusive/", "created_utc": 1677551362.0, "score": 1, "permalink": "/r/dictionary/comments/11due4m/help_with_the_word_delusive/", "comments": ["Venice is an old, old city. The canals and streets (if any) are quite narrow. At the level of a canal, you must typically be somewhat in shade. In that light the dilapidated condition of a building might be less obvious than in bright sunlight or a spot light. The delusive light is obscuring the actual condition of the building."], "URLs": [], "html_title": []}, {"title": "Guys can we please make “evidize” a word", "selftext": "Evidize: a kind of synonym for “shown” in the context of “how this document shows this through this evidence.” \n\nAn example would be “this point of view is evidized in this historical document”\n\nOr\n\n“This document evidizes this claim using [this evidence]”\n\nSomething like that", "id": "11d94gm", "url": "https://www.reddit.com/r/dictionary/comments/11d94gm/guys_can_we_please_make_evidize_a_word/", "created_utc": 1677495572.0, "score": 4, "permalink": "/r/dictionary/comments/11d94gm/guys_can_we_please_make_evidize_a_word/", "comments": ["You can already use \"evidence\" as a verb in that sentence. \"The claim is evidenced by this document...\"", "Oh shit. This is perfect then. I’ve been dancing around that this whole time while writing essays and such. Thank you for the informative response", "No prob, Bob!"], "URLs": [], "html_title": []}, {"title": "Science Word of the Week: Vellicate", "selftext": "Does Your Eyelid Ever Randomly Twitch? You can learn the word and the science behind Vellicate.\n\nhttps://www.youtube.com/watch?v=6ZAH0RAml9A", "id": "11bmn2e", "url": "https://www.reddit.com/r/dictionary/comments/11bmn2e/science_word_of_the_week_vellicate/", "created_utc": 1677336330.0, "score": 3, "permalink": "/r/dictionary/comments/11bmn2e/science_word_of_the_week_vellicate/", "comments": [], "URLs": ["https://www.youtube.com/watch?v=6ZAH0RAml9A"], "html_title": ["Does Your Eyelid Ever Randomly Twitch? Learn Why Muscles Vellicate! - YouTube"]}, {"title": "The money of the rich in China and Russia belongs to the state, not to them.", "selftext": "", "id": "118uhj9", "url": "https://www.reddit.com/r/dictionary/comments/118uhj9/the_money_of_the_rich_in_china_and_russia_belongs/", "created_utc": 1677060591.0, "score": 1, "permalink": "/r/dictionary/comments/118uhj9/the_money_of_the_rich_in_china_and_russia_belongs/", "comments": ["I think this might be posted in the wrong sub.", "Yes sorry lad"], "URLs": [], "html_title": []}, {"title": "Where are the great dictionaries online?", "selftext": "Hi, folks.  I have a 20 pound giant dictionary I love called \"Webster's Third New International Dictionary\".  Is this available online?  I don't mean something similar, I mean every word and character in this book exactly as in the print edition.  I can't find its equal online.  I have tried Oxford English Dictionary online and I don't find it very good and subscription management is awful, I went through a lengthy process to get a paid subscription then had login problems for weeks that cleared up and then the login problems appeared again.  Please help!", "id": "116ste0", "url": "https://www.reddit.com/r/dictionary/comments/116ste0/where_are_the_great_dictionaries_online/", "created_utc": 1676852910.0, "score": 3, "permalink": "/r/dictionary/comments/116ste0/where_are_the_great_dictionaries_online/", "comments": ["I haven't heard of a digitized version of the 3rd Websters (what a beast of a dictionary!) Here is the century dictionary, though. It's a little bit older (I think 1890 something?). Hopefully it might be of some use: \n\n[http://www.global-language.com/CENTURY/](http://www.global-language.com/CENTURY/) \n\nEither way, I'm all for sticking with the original old beasts. There's something magical about stumbling upon a new word in a search for meaning. Good luck finding the digitized websters, though!", "Glad you found what you were looking for. Why do you love the 3rd International so much?", "I found the answer!  I bought the Webster's 3rd New Int'l Dictionary on Amazon Kindle.  Its now on all of my devices for a one time price of $60.  I confirmed that its the exact printed copy I have and the search is perfect, you type in the word and it goes straight to it.  I'm so happy!", "It speaks to the heart of the English language and was compiled pre-feminism, therefore formulated when the university system was still demanding of excellence without mercy, before females flooded into the university system and took cultural control 60 years ago.", "...yeesh"], "URLs": [], "html_title": []}, {"title": "What is this called", "selftext": "pro·nun·ci·a·tion\n\n/prəˌnənsēˈāSH(ə)n/ 《 Can anyone tell me what this is called? It's the pronunciation of the word but what exactly is it called?", "id": "115z938", "url": "https://www.reddit.com/r/dictionary/comments/115z938/what_is_this_called/", "created_utc": 1676773982.0, "score": 2, "permalink": "/r/dictionary/comments/115z938/what_is_this_called/", "comments": ["IPA\n\nhttps://www.internationalphoneticalphabet.org/ipa-sounds/ipa-chart-with-sounds/"], "URLs": [], "html_title": []}, {"title": "Help needed: \"Overflowing myeself\" - I can't find the meaning of \"overflowing oneself\" in any dictionary. Hints? (Context provided in post)", "selftext": "\"I look around for thoughts when I am overflowing myself. While I live on, thought is still in embryo, - it stirs not within me. Anon it begins to assume shape and comeliness, and I deliver it, and clothe it in its garment of language.\" (\"Journal\", Henry David Thoreau)\n\nAnyone knows the meaning of \"overflow\" in that sentence? I just can't figure that out and dictionaries (physical and online) didn't provide any specific usage like this particular one.", "id": "115sdkz", "url": "https://www.reddit.com/r/dictionary/comments/115sdkz/help_needed_overflowing_myeself_i_cant_find_the/", "created_utc": 1676755888.0, "score": 1, "permalink": "/r/dictionary/comments/115sdkz/help_needed_overflowing_myeself_i_cant_find_the/", "comments": ["Maybe 'myself' is used here just to emphasize that the narrator is overflowing, as in \"I look around ... when I myself am overflowing\", rather than the intent being to make 'overflow' a reflexive verb.\n\nNot sure I can properly interpret what the author means either way though, I don't study literature and have no idea of the context of the passage or of Thoreau's philosophy. Definitely agree that that first sentence sounds weird now.", "This is so funny. I just looked up this subreddit because I wanted to express a similar idea, but decided against it. Sorry, I had to say that, it's unrelated to this post. I just found it funny. But with regard to \"overflowing myself\", it sounds very poetic here. I would liken it to being in a state where new ideas are brewing in the mind but haven't been fully articulated yet."], "URLs": [], "html_title": []}, {"title": "Science Word of the Week: Syzygy", "selftext": "In astronomy, syzygy is the alignment of three celestial objects. This can be the Sun, the Earth, and the Moon, or the Sun, the Earth, and a planet.  \n\n\nWe get a syzygy twice every month when the Earth, Moon, and Sun align for the new moon and the full moon. When the Moon is between the Sun and the Earth, you get a solar eclipse. And when the Earth is between the Sun and the Moon, you get a lunar eclipse.\n\n[https://www.youtube.com/watch?v=mqxzSLThQjg](https://www.youtube.com/watch?v=mqxzSLThQjg)", "id": "115muuz", "url": "https://www.reddit.com/r/dictionary/comments/115muuz/science_word_of_the_week_syzygy/", "created_utc": 1676747847.0, "score": 4, "permalink": "/r/dictionary/comments/115muuz/science_word_of_the_week_syzygy/", "comments": [], "URLs": ["https://www.youtube.com/watch?v=mqxzSLThQjg](https://www.youtube.com/watch?v=mqxzSLThQjg)"], "html_title": ["When Three Celestial Objects Align? That’s Syzygy! ☀️🌕🌎 - YouTube"]}, {"title": "what's a word for this feeling?", "selftext": "I want what someone else has but not to take it away from them", "id": "115a6mx", "url": "https://www.reddit.com/r/dictionary/comments/115a6mx/whats_a_word_for_this_feeling/", "created_utc": 1676707091.0, "score": 2, "permalink": "/r/dictionary/comments/115a6mx/whats_a_word_for_this_feeling/", "comments": ["I think envy/envious works here. Jealous would be if you want to take it. Envy is you just want to also have what they have, I’m pretty sure", "That's envy", "Longing \n\nI guess, idk"], "URLs": [], "html_title": []}, {"title": "What’s the word for someone who is a fast learner?", "selftext": "“Adaptable” isn’t quite what I’m looking for as that is more related to being able to work with/in many situations. I’m talking specifically about someone who is able to: 1a) absorb information and 1b) absorb it quickly.\n\nI can’t find anything like that", "id": "1157s26", "url": "https://www.reddit.com/r/dictionary/comments/1157s26/whats_the_word_for_someone_who_is_a_fast_learner/", "created_utc": 1676697965.0, "score": 2, "permalink": "/r/dictionary/comments/1157s26/whats_the_word_for_someone_who_is_a_fast_learner/", "comments": ["Savant?", "Sponge?", "He's a quick study?", "Oh… great shout. This  guy I’m trying to describe certainly is on the spectrum and would actually describe him perfectly. But id like something that’s also reflective of neuro-typical people too", "I did think of that too, but it’s more for a professional environment when an interviewer asks “tell me about yourself”. \n\nI wanna say that - “I’m determined, solutions-oriented and *[a fast learner]*”", "\"a fast learner\" sounds perfectly fine to me"], "URLs": [], "html_title": []}, {"title": "Why is there no word for one's deceased spouse?", "selftext": "I've looked and there doesn't seem to be an English word that fits and you kind of get tired of saying \"my dead wife\".  There's a word for the surviving spouse \"widow/er\" but not the deceased themselves.\n\nPlease tell me I missed it.", "id": "114ypmk", "url": "https://www.reddit.com/r/dictionary/comments/114ypmk/why_is_there_no_word_for_ones_deceased_spouse/", "created_utc": 1676670778.0, "score": 1, "permalink": "/r/dictionary/comments/114ypmk/why_is_there_no_word_for_ones_deceased_spouse/", "comments": ["You're right, no specific word. I think \"late wife\" is what most would say.", "There's also no word for a parent of a lost child. You'd think there would be since childhood mortality rates used to be much higher but no. There's \"orphan\" if you don't have parents, but nothing if you lose your kids. There's not even an easy way to say it besides \"late son/daughter.\" \n\nMy kids are still alive. I just hear this talked about in parenting spaces because it does happen.", "Correct, there is no one-word term. The best choice would be \"late spouse\" or \"deceased spouse\".\n\nThe term “late” is euphemistic, and it comes from an Old English phrase, “of late.\"\r Because it refers to a person who died recently, the term “late” is more applicable for spouses who passed away in the recent past. But in modern usage, the phrase applies to spouses who have passed away at any point in the past. (Source: [*joincake.com*](https://joincake.com))", "Just say your wife or ex-wife since till death do you part and death has indeed parted you.", "Isn't that weird?", "It's weird isn't it?  It's like we don't really want to acknowledge it.", "Why did noone ever think to create a one word descriptor for such a common thing?"], "URLs": [], "html_title": []}, {"title": "Appreciator or Appraiser?", "selftext": "Can I use the word appreciated in the same way of saying appraised? This is in the context of a group finding some kind of treasure and bringing it back home for it's value to be found so that the group can keep 50% of it.  \n\"Upon returning all found gems will be appreciated by the Royal Appraisers and Gemmologists Morbek & Sons...\"  \n\n\nI may very well be making more out of this than I need to 😅", "id": "114iwa4", "url": "https://www.reddit.com/r/dictionary/comments/114iwa4/appreciator_or_appraiser/", "created_utc": 1676635906.0, "score": 3, "permalink": "/r/dictionary/comments/114iwa4/appreciator_or_appraiser/", "comments": ["I don’t think it can be used that way. *Appreciate* means to recognize that something is valuable in a general sense; *Appraise* means to use one’s expert knowledge to identify the exact worth of a particular item.", "To appreciate something means to value it in a personal/general way (eg. \"I really appreciate your work, I don't know where I would be without it\" or \"Laura appreciated the gemstone. It was the best gift he could have given\" or \"Most modern art scholars appreciate Van Gogh's contribution to oil painting\"). Meanwhile the phrase \"to appreciate that [a statement is true]\" is roughly equivalent to \"to understand that [a statement is true]\"\n\n(The other meaning of appreciate relates to financial assets that increase in value. Not seen or heard 'appreciator' before)\n\nTo appraise is the word you're talking about - giving a (usually professional) evaluation of the merit or value of something.", "Thanks all!"], "URLs": [], "html_title": []}, {"title": "HELP NEEDED", "selftext": "Hey everyone! I need your help. Recently when I’ve been sleeping, my brain has been coming up with random words and I need some help deciphering them. A few of them came with meanings somehow but for the majority I need help breaking down the words and giving them meaning. \n\nHeres the list:\n- Multi-unigelarililum \n- Tensiniel (ten- to hold) (sin - to be) (iel - of god)\n- Cedribuelum\n- Bicargonous\n- Vule (a word for athletes that go up stairs when things get hard)\n\nIf you have any ideas please let me know!", "id": "1140dqt", "url": "https://www.reddit.com/r/dictionary/comments/1140dqt/help_needed/", "created_utc": 1676579750.0, "score": 2, "permalink": "/r/dictionary/comments/1140dqt/help_needed/", "comments": [], "URLs": [], "html_title": []}, {"title": "Is \"Peoples\" a valid word?", "selftext": "\"Peoples\" vs \"Persons\" vs \"People\" .... Which is correct and more widely used in formal English?", "id": "113s3wc", "url": "https://www.reddit.com/r/dictionary/comments/113s3wc/is_peoples_a_valid_word/", "created_utc": 1676558346.0, "score": 3, "permalink": "/r/dictionary/comments/113s3wc/is_peoples_a_valid_word/", "comments": ["____\n\n**people**\n\nhttps://www.merriam-webster.com/dictionary/peoples\n\n**noun**\n\n*plural* **people**\n\n1 *plural* : human beings making up a group or assembly or linked by a common interest\n\n2 *plural* : HUMAN BEINGS, PERSONS\n\n...\n\n5 *plural* **peoples** : a body of persons that are united by a common culture, tradition, or sense of kinship, that typically have common language, institutions, and beliefs, and that often constitute a politically organized group\n\n____\n\nhttps://www.merriam-webster.com/words-at-play/people-vs-persons\n\n'People' vs. 'Persons'\n\nHow to choose between two words that seem to mean the same thing\n\n\"People should always be used when a collective noun referring to the entirety of a group or nation (i.e., \"the French People\") is called for. For references to groups of a specific or general number, either people or persons may be used. However, modern style guides tend to prefer people where earlier guides preferred persons, especially for countable groups.\n\n____", "Peoples: refers to multiple cultural or ethnic groups, eg. the different peoples of Africa\n\nPeople: generally referring more than one person. This is the overwhelmingly commonly used form in both colloquial and formal English.\n\nPersons: generally found in a extra formal/legal setting nowadays, it's becoming a little archaic. There is an unusual example that I have come across though: the phrase \"to have on your person\" (in a security context, i.e. to have in your posession right now) becomes \"to have on your persons\" when spoken to a group of people."], "URLs": [], "html_title": []}, {"title": "\"mashine\" found in Linux dict", "selftext": "Tried Linux CLI dict this morning. Immediately came across this spelling of \"machine\". How does one report this? \n\n\" {Flour dresser}, a mashine for sorting and distributing flour according to grades of fineness.\"", "id": "11287wn", "url": "https://www.reddit.com/r/dictionary/comments/11287wn/mashine_found_in_linux_dict/", "created_utc": 1676388789.0, "score": 2, "permalink": "/r/dictionary/comments/11287wn/mashine_found_in_linux_dict/", "comments": [], "URLs": [], "html_title": []}, {"title": "Science Word of the Week: Nomophobia", "selftext": "The Fear of Not Being With Your Mobile Phone? It’s Nomophobia.\n\n[https://www.youtube.com/watch?v=qV9mosoV\\_F4](https://www.youtube.com/watch?v=qV9mosoV_F4)", "id": "110t5qv", "url": "https://www.reddit.com/r/dictionary/comments/110t5qv/science_word_of_the_week_nomophobia/", "created_utc": 1676243532.0, "score": 4, "permalink": "/r/dictionary/comments/110t5qv/science_word_of_the_week_nomophobia/", "comments": [], "URLs": ["https://www.youtube.com/watch?v=qV9mosoV\\_F4](https://www.youtube.com/watch?v=qV9mosoV_F4)"], "html_title": ["- YouTube"]}, {"title": "A word for coy / coquettish complaints (without the sexual component), more childish component", "selftext": "Like a GF complaining to a BF about something that's trivial and she doesn't really mean it, she just wanna be coquettish... but coquettish has a sexual component to it.\n\nSentence I want to use in:Between sisters: \"Why were you away for so long? I haven't seen you in weeks,\" she complained <childishly?>", "id": "110fuaz", "url": "https://www.reddit.com/r/dictionary/comments/110fuaz/a_word_for_coy_coquettish_complaints_without_the/", "created_utc": 1676208828.0, "score": 2, "permalink": "/r/dictionary/comments/110fuaz/a_word_for_coy_coquettish_complaints_without_the/", "comments": ["Impishly, playfully, teasingly, saucily, coyly.", "these are still sexy!", "They can be, but not necessarily. I think Impish, in particular, is more often used to convey a sense of innocent, childlike mischief. You can be playful and teasing in a sexual way, but you can also do it in a non-sexual way, like when siblings or good friends tease or rib one another.", "In my mind \"coyly\" doesn't have any sexual connotations until you use it in that context - so would be fine to use in this case. Definitely don't use saucily lmao", "Maybe it's just me... ;)", "I mean, either way there's a basic attitude of \"playfulness\" which can be sexual or not, so you weren't entirely wrong to pick up on that."], "URLs": [], "html_title": []}, {"title": "Is there an opposite of \"undead\": a living person in the afterlife?", "selftext": "Defining undead as \"a person or creature that has died but persists acting/existing in the mortal world\", is there a word for \"a creature or person that has not died / is alive but \nexists in the afterlife\"? I'm not talking about a mortal that ascends to godhood or something, just a person that exists as they are in life but within a realm meant for the dead.", "id": "110616s", "url": "https://www.reddit.com/r/dictionary/comments/110616s/is_there_an_opposite_of_undead_a_living_person_in/", "created_utc": 1676172806.0, "score": 5, "permalink": "/r/dictionary/comments/110616s/is_there_an_opposite_of_undead_a_living_person_in/", "comments": ["Shittttt. You confused me but your question is really good. I want some answers also.", "The term “eternal life” is often associated with “the afterlife”", "But how did they sneak past Cerberus...?\n\nThe closest I got is \"transgressive trespasser\"!\n\nI'm stumped. If anyone finds out I'll put it as my next Word of the Day!\n\n[https://logophile.email](https://logophile.email)", "You might use 'sojourner'. Assuming of course that they will return.", "Funnily enough one of the people I thought of with this is from Greek Mythology. Ganymede is a human that was apparently so pretty that Zeus abducted him to serve as his personal cup-bearer on Olympus. He never died, nor was he made a god and only explicitly given immortality in some sources, otherwise he was just a normal dude living within the realm of gods. (I know Olympus is not an afterlife but I think the idea still applies).", "I wasn't going for someone that would return, but it might still work for my purposes 🤔👍", "Fantastic! If no word yet exists then imo this should be it: the opposite of \"an undead\" is \"a ganymede\"!!!"], "URLs": [], "html_title": []}, {"title": "is Heirarch an actual word? Not heirarchy. \"Heirarch\"", "selftext": "", "id": "1104fb7", "url": "https://www.reddit.com/r/dictionary/comments/1104fb7/is_heirarch_an_actual_word_not_heirarchy_heirarch/", "created_utc": 1676167678.0, "score": 0, "permalink": "/r/dictionary/comments/1104fb7/is_heirarch_an_actual_word_not_heirarchy_heirarch/", "comments": ["There is if you tell me what it means ;)\n\nThen I can include it in my Word of the Day email at [https://logophile.email](https://logophile.email)", "As far as I know it means like... A leader in a religious organization/hierarchy? Sort of like a monarch"], "URLs": [], "html_title": []}, {"title": "Is there a A-Z browsable printed/online dictionary that leaves out words like \"Web 2.0\" and \"ginormous\"?", "selftext": "I know that language evolves over time, and ginormous is very widely known in the English language, but at the same time I can't help but think there is a distinction between \"ginormous\" and the generally accepted words like \"huge\", \"enormous\", \"giant\", etc.  \n\nI'm not sure how to categorize these new words, so hopefully you understand what I mean.  \n\nI'm looking for a dictionary that, for the most part, keeps only proper English words. I think there are probably some words that started out as slang and are now fully fledged words.  \n\nI am really struggling to say what I mean, and for that I apologize. I tried using the search bar but my Google Fu fails me.  \n\nAnother feature I would like is for the contents to be listed. So instead of searching for your particular word, you can instead browse through the words. My idea here is to start at A, and browse until I find some words I usually enjoy or in the moment find myself curious about, and then look up their listing in Etymonline, which has GOT to be one of my favorite websites of all time, I just discovered it the other day (today is the first time on r/dictionary for me)  \n\n\n\nI appreciate any help you can offer.", "id": "10xo664", "url": "https://www.reddit.com/r/dictionary/comments/10xo664/is_there_a_az_browsable_printedonline_dictionary/", "created_utc": 1675926055.0, "score": 6, "permalink": "/r/dictionary/comments/10xo664/is_there_a_az_browsable_printedonline_dictionary/", "comments": ["Generally speaking, all dictionaries exist somewhere on the \"Descriptive\" to \"Prescriptive\" spectrum. The Descriptive approach believes that it is natural for languages to change and evolve in strange new ways, and that it is the job of dictionaries to follow those changes and describe the language as it appears without judgement. The Prescriptive approach believes that dictionaries are meant to actively guide and shape the language toward some pre-conceived level of propriety, making it clear what they think on how language should be used. Dictionaries that tend more towards Description tend to be more allowing of things like slang terms, loan words, and novel word meanings, while more Prescriptive dictionaries are more tight and conservative with such things.  \nIn light of all this, it seems like you're looking for a dictionary that takes a heavily Prescriptive approach to language, as you seem to have very strong opinions on what constitutes proper English. However, the general trend in dictionaries these days is toward the Descriptive approach, which is seen as being more inclusive and diverse. I can't imagine many are being printed these days that would leave out a word like Ginormous (though, to be fair, that's partially because there aren't many dictionaries being printed these days at all).  \nIt seems that what you want is a long list of traditionally-accepted English words that you can pore over in the hopes of soaking up interesting new etymological information, which is an extremely commendable pastime. For that, I would recommend trying to find an older dictionary in good condition from a thrift shop, second-hand book store, or online sources like Abe Books or Thrift Books. In particular, I suggest the *American Heritage Dictionary*, which was founded in the 1960's when *Webster's 3rd International Dictionary* was criticized for being too permissive in its word allowance. The AHD is extremely well-researched and uses a more Prescriptive approach than its rival. While a quick check at their modern website shows that their current edition does, in fact, have a definition for the word [\"Ginormous\"](https://www.ahdictionary.com/word/search.html?q=ginormous), I have a physical edition from 1972 which does not contain the word. \n\nEven if that isn't exactly what you're looking for, I hope that I've given you enough information to put on the right track towards tracking down your dream dictionary!", "Good lord. I couldn't have asked for a better reply to my question.  \n\nThe occasional ginormous isn't such a bad thing, nor can I get upset the world hasn't shaped itself around me.  \n\nYour suggestion of American Heritage Dictionary will almost certainly fill my request.  \n\nThank you so much.", "You're very welcome. My favorite aspect of the AHD is its Usage Panel, a group of language experts that are consulted and referenced throughout the dictionary to clarify sticky problems of word use. For more information on the latest edition, I recommend [this review](https://www.youtube.com/watch?v=YZjyVL8Q2hs&t=244s) by the linguistic YouTube channel Alliterative.  \nHappy reading!"], "URLs": [], "html_title": []}, {"title": "Meaning of “big daddy”", "selftext": "Hey guys,\n\nI wanted to confirm something with you\n\nWhat does it usually mean to call someone big daddy? Fwiw, it wasn't a sexual context or anything, the context was me calling a friend big daddy s (their name begins with s). Im a guy and my friend is a girl\n\nWe were talking about nepotism, and she said something like \"Do you have your daddy tell your boss to be nice to you\" and I said \"No I just tell them I know big daddy S\". Implying she is a very intimidating person etc\n\nI know calling someone daddy is sexualized, but I was under the assumption that big daddy basically denotes power/authority......Sort of like \"Chief\". Is this correct? or can this be construed as something sexual. I obviously didn't mean it that way but was over text so not great with this\n\nAll the dictionaries online back this up, but urban dictionary has some weird entries\n\nAny help is appreciated!", "id": "10vm63u", "url": "https://www.reddit.com/r/dictionary/comments/10vm63u/meaning_of_big_daddy/", "created_utc": 1675727185.0, "score": 1, "permalink": "/r/dictionary/comments/10vm63u/meaning_of_big_daddy/", "comments": [], "URLs": [], "html_title": []}, {"title": "Reverse dictionary for idioms that will allow you to learn a lot of idioms so that you end up sounding like a native English speaker?", "selftext": "Anything like this, or something even better perhaps?", "id": "10vlvne", "url": "https://www.reddit.com/r/dictionary/comments/10vlvne/reverse_dictionary_for_idioms_that_will_allow_you/", "created_utc": 1675726426.0, "score": 2, "permalink": "/r/dictionary/comments/10vlvne/reverse_dictionary_for_idioms_that_will_allow_you/", "comments": [], "URLs": [], "html_title": []}, {"title": "Looking for a word...", "selftext": "that means something like \"giving something up to someone so that they leave you alone.\"\n\nAppeasement? Anything else?", "id": "10vhghv", "url": "https://www.reddit.com/r/dictionary/comments/10vhghv/looking_for_a_word/", "created_utc": 1675715908.0, "score": 1, "permalink": "/r/dictionary/comments/10vhghv/looking_for_a_word/", "comments": [], "URLs": [], "html_title": []}, {"title": "Science Word of the Week: Eruct", "selftext": "Alex Dainis explains the process of eructation, the noun form of eruct.  \n\n*verb (used with or without object)*  \nto belch forth, as gas from the stomach.  \nto emit or issue violently, as matter from a volcano.\n\n[https://www.youtube.com/watch?v=EUuwkNWj7as](https://www.youtube.com/watch?v=EUuwkNWj7as)", "id": "10sn149", "url": "https://www.reddit.com/r/dictionary/comments/10sn149/science_word_of_the_week_eruct/", "created_utc": 1675438147.0, "score": 4, "permalink": "/r/dictionary/comments/10sn149/science_word_of_the_week_eruct/", "comments": [], "URLs": ["https://www.youtube.com/watch?v=EUuwkNWj7as](https://www.youtube.com/watch?v=EUuwkNWj7as)"], "html_title": ["What happens after you gulp a fizzy drink? You eruct! - YouTube"]}, {"title": "Is there a dictionary where words are categorized like this?", "selftext": "[https://en.wiktionary.org/w/index.php?title=Special:Search&limit=500&offset=0&ns0=1&search=insource%3A%22Category%3Aen%3AClothing%22](https://en.wiktionary.org/w/index.php?title=Special:Search&limit=500&offset=0&ns0=1&search=insource%3A%22Category%3Aen%3AClothing%22)", "id": "10rv9tn", "url": "https://www.reddit.com/r/dictionary/comments/10rv9tn/is_there_a_dictionary_where_words_are_categorized/", "created_utc": 1675358438.0, "score": 4, "permalink": "/r/dictionary/comments/10rv9tn/is_there_a_dictionary_where_words_are_categorized/", "comments": ["Yeah, Wiktionary:\n\nhttps://en.wiktionary.org/wiki/Category:en:Clothing\n\nA common term if you're looking for print/traditional books might be \"reverse dictionary\" and to some degree \"thesaurus\".\n\nIf you're looking for something more technical (e.g. a database of words you can use), you could try [WordNet](https://en.wikipedia.org/wiki/WordNet), which includes hyponym and hypernym links between words. There's also many spinoffs of WordNet for other languages etc.", "The Random House Word Menu has words organized by topic just like this.", "I meant non-online references.", "reverse dictionary or thesaurus"], "URLs": ["https://en.wiktionary.org/w/index.php?title=Special:Search&limit=500&offset=0&ns0=1&search=insource%3A%22Category%3Aen%3AClothing%22](https://en.wiktionary.org/w/index.php?title=Special:Search&limit=500&offset=0&ns0=1&search=insource%3A%22Category%3Aen%3AClothing%22)"], "html_title": ["Search results for \"insource:\"Category:en:Clothing\")\" - Wiktionary"]}, {"title": "What does obstain mean?", "selftext": "Please help me", "id": "10rhhqn", "url": "https://www.reddit.com/r/dictionary/comments/10rhhqn/what_does_obstain_mean/", "created_utc": 1675314523.0, "score": 1, "permalink": "/r/dictionary/comments/10rhhqn/what_does_obstain_mean/", "comments": [], "URLs": [], "html_title": []}, {"title": "I’m looking for a certain word that describes a subject that’s hard to describe, has a lot of layers that you need to understand. Something almost convoluted. It’s often used to describe how events are deep and need to be understood from different angles to understand.", "selftext": "", "id": "10qyx51", "url": "https://www.reddit.com/r/dictionary/comments/10qyx51/im_looking_for_a_certain_word_that_describes_a/", "created_utc": 1675268873.0, "score": 0, "permalink": "/r/dictionary/comments/10qyx51/im_looking_for_a_certain_word_that_describes_a/", "comments": ["Labyrinthine", "Nuanced", "Befuddling, Byzantine, Gordian, perplexing, bewildering, baffling…", "Perplexing, enigmatic, mystifying, intricate,", "Multifaceted?", "Recondite, abstruse,intricate", "Ineffable?", "Obscure", "Not quite. However, I’m happy I learned a new word! It’s a word often used by people to describe world events and how they’re often deeper than one thing. Almost like “nebulous”", "YES Nuanced is it!", "Awesome. I knew what you were talking about and it was driving me crazy all day till I thought of that"], "URLs": [], "html_title": []}, {"title": "Word to describe a solution to a problem that causes the problem?", "selftext": "It's really bugging me and I can swear on my life that a word for this definition exists but I cant find it anywhere, what word goes with the definition- \"A solution to a problem that causes the problem\". \n\nfor example; a content creator makes their content for views and money, they use this money to help others and film it, this gets them more views and money and so on. This isnt the best example but its the best one i can think of", "id": "10qe29y", "url": "https://www.reddit.com/r/dictionary/comments/10qe29y/word_to_describe_a_solution_to_a_problem_that/", "created_utc": 1675207864.0, "score": 1, "permalink": "/r/dictionary/comments/10qe29y/word_to_describe_a_solution_to_a_problem_that/", "comments": ["Vicious cycle? Poison pill?", "A feedback loop", "Recursive?"], "URLs": [], "html_title": []}, {"title": "Dictionary tier list Video 1", "selftext": "", "id": "10pkxkt", "url": "https://www.reddit.com/r/dictionary/comments/10pkxkt/dictionary_tier_list_video_1/", "created_utc": 1675130171.0, "score": 1, "permalink": "/r/dictionary/comments/10pkxkt/dictionary_tier_list_video_1/", "comments": [], "URLs": [], "html_title": []}, {"title": "I'm not sure if the word I'm looking for exists", "selftext": "I'm looking for an adjective describing a person's hatred or disgust of their own feelings of attachment or love for another person.\n\nLike how bittersweet is a blend of happiness and sadness. A solemn fondness, perhaps.\n\nWhat I'm looking for is more like an abhorrable sentimentality.\n\n1. Like in Disney's \"Hercules\", an extreme form of Meg's disgust when she realizes she's fallen in love.\n2. Like the anger one feels about not being able to move on after parting ways with a former lover. The frustration of still being stuck in love with a person who has moved on to better things, and you know that by yearning for this person, you will only suffer silently as you watch them find happiness beyond you, but it's been years and you're STILL not over it. An abhorrable sentimentality.\n\nAny suggestions?\n\nEdit: I've gotten some good recommendations, but I am hoping to see if there is a word specifically for hating loving. Like how bittersweet is a more specific or nuanced version of \"sad\" or \"melancholy\".\n\nSomething with the same bite or intensity as the eyes in Cabanel's \"The Fallen Angel\"", "id": "10oxm54", "url": "https://www.reddit.com/r/dictionary/comments/10oxm54/im_not_sure_if_the_word_im_looking_for_exists/", "created_utc": 1675070338.0, "score": 1, "permalink": "/r/dictionary/comments/10oxm54/im_not_sure_if_the_word_im_looking_for_exists/", "comments": ["The things that come to my mind.. Loathe? Unconditional love?", "Self-loathing", "Self-abnegation, abhorrence, eschewal", "self-mortification or asceticism", ">asceticism\n\nI like this one, but am hoping to find a word that holds a more negative connotation.\n\nThank you, tho!"], "URLs": [], "html_title": []}, {"title": "I need help defining a statement", "selftext": "How would you describe \n\nCelebrating the Difference’s in Diversity?", "id": "10o5n9w", "url": "https://www.reddit.com/r/dictionary/comments/10o5n9w/i_need_help_defining_a_statement/", "created_utc": 1674991839.0, "score": 1, "permalink": "/r/dictionary/comments/10o5n9w/i_need_help_defining_a_statement/", "comments": [], "URLs": [], "html_title": []}, {"title": "Science Word of the Week: Pandiculation", "selftext": "There’s a word for that post-nap stretch! It’s pandiculation.\n\nMaynard Okereke, the Hip Hop Science MD, explains how this behavior displayed in most vertebrates works.  Pandiculation is an instinctive involuntary response after long periods of physical rest. As a fundamental part of our muscular function, our bodies pandiculate to relieve tension in our muscles, readjust our posture, and even increase circulation. Pandiculation is often accompanied by yawning and sends signals to our brain to reset our central nervous system. Preparing our bodies for movement and allowing us to have an active and productive day.\n\n[https://www.youtube.com/watch?v=Jk1GA8612xE](https://www.youtube.com/watch?v=Jk1GA8612xE)", "id": "10ngfp9", "url": "https://www.reddit.com/r/dictionary/comments/10ngfp9/science_word_of_the_week_pandiculation/", "created_utc": 1674916396.0, "score": 5, "permalink": "/r/dictionary/comments/10ngfp9/science_word_of_the_week_pandiculation/", "comments": [], "URLs": ["https://www.youtube.com/watch?v=Jk1GA8612xE](https://www.youtube.com/watch?v=Jk1GA8612xE)"], "html_title": ["Why Do You — And Your Cat or Dog — Stretch When You Wake Up? 💤 - YouTube"]}, {"title": "What is the difference between \"Tried\" and \"Had Tried\"?", "selftext": "When I looked up the meaning of these words and how they would apply to a sentence, I feel that there is a small difference between it.\n\nFor example, using them in a sentence for \"Running a lap around the field\"\n\nFor \"**Tried**\" I searched that it is \"**Attempting to do something**\"\n\n* In the sentence \"**I tried running a lap around the field**\"\n\nFor \"**Had Tried**\" I search with the latter with the former, it is \"**participated in the action of attempting to do something**\"\n\n* In the sentence \"**I had tried running a lap around the field**\"\n\nFrom what I understand, \"Tried\" could mean wanting to run the lap but could or could not take any action, while \"Had Tried\" means actually doing something to do something, such as already running.\n\n**EDIT**: I now know that the former is called \"Simple Past Tense\" and the latter is \"Perfect Past Tense\" which the former is something that happened at the same time and the latter is an order of events of something that happened followed by the other. So would what I said above still be correct?\n\nIs this correct or is there more to it?\n\nThoughts?", "id": "10m0tj2", "url": "https://www.reddit.com/r/dictionary/comments/10m0tj2/what_is_the_difference_between_tried_and_had_tried/", "created_utc": 1674762937.0, "score": 1, "permalink": "/r/dictionary/comments/10m0tj2/what_is_the_difference_between_tried_and_had_tried/", "comments": ["bump"], "URLs": [], "html_title": []}, {"title": "i need help finding a word about sadness and comfort", "selftext": "there’s a song called “j’s lullaby”, it comforts me but also makes me feel so empty and depressed. i love songs like that. mitski songs often make me feel like that, it describes me in a way i could never explain myself.\n\nis there a word that describes feeling comforted by something that upsets you sort of? well, not upset, more makes you feel numb and sad i guess. i hope you all know what i mean.", "id": "10lx1ze", "url": "https://www.reddit.com/r/dictionary/comments/10lx1ze/i_need_help_finding_a_word_about_sadness_and/", "created_utc": 1674753494.0, "score": 2, "permalink": "/r/dictionary/comments/10lx1ze/i_need_help_finding_a_word_about_sadness_and/", "comments": ["Cathartic!"], "URLs": [], "html_title": []}, {"title": "Would you bring a dictionary to a desert island?", "selftext": "\"Though a work of literature can be read in a number of ways, this number is finite and can be arranged in a hierarchical order; some readings are obviously “truer” than others, some doubtful, some obviously false, and some, like reading a novel backwards, absurd. That is why, for a desert island, one would choose a good dictionary rather than the greatest literary masterpiece imaginable, for, in relation to its readers, a dictionary is absolutely passive and may legitimately be read in an infinite number of ways.\" - From *The Dyer's Hand and Other Essays* by W. H. Auden\n\nTo what extent do you personally agree with the above quote? Do you think that, in a cultural vacuum, a dictionary could provide you as much enrichment as a more traditionally-defined work of literature? If so, which dictionary would you prefer?  \nAnd, if the idea of choosing only one book to bring to a desert island is too agonizing a choice, let's say we expand it to five, or even ten, books; would you count a dictionary among them?", "id": "146eeiv", "url": "https://www.reddit.com/r/dictionary/comments/146eeiv/would_you_bring_a_dictionary_to_a_desert_island/", "created_utc": 1686439611.0, "score": 1, "permalink": "/r/dictionary/comments/146eeiv/would_you_bring_a_dictionary_to_a_desert_island/", "comments": [], "URLs": [], "html_title": []}]