[{"title": "Sorry Sister, But Someone Has to Keep the Family Tradition Going Even Now", "selftext": "\"Didn't you hear me!  I said give up your criminal ways!\"\n\n\"Sorry sister, but someone has to keep the family tradition going even now!\"\n\nAfter she drove off to likely rob some banks, my new unexpected husband looked at me and said, \"Let's go after her!\"\n\n\"But honey, she's my sister!  I just can't change my mind immediately!\"\n\nAfter we watched my sister for what seemed like several minutes, I said back to my new unexpected man, \"Okay fine, we'll give her a five-minute start, then we go after her!\"\n\nSo we did after five minutes.  We got into my car and drove after my sister like we were cops chasing after a ruthless criminal.", "id": "145l8i3", "url": "https://www.reddit.com/r/Microfiction/comments/145l8i3/sorry_sister_but_someone_has_to_keep_the_family/", "created_utc": 1686355834.0, "score": 1, "permalink": "/r/Microfiction/comments/145l8i3/sorry_sister_but_someone_has_to_keep_the_family/", "comments": [], "URLs": [], "html_title": []}, {"title": "Speed", "selftext": "Cousin to the wind...the one that called Icarus, kid...", "id": "143fcdu", "url": "https://www.reddit.com/r/Microfiction/comments/143fcdu/speed/", "created_utc": 1686149523.0, "score": 1, "permalink": "/r/Microfiction/comments/143fcdu/speed/", "comments": [], "URLs": [], "html_title": []}, {"title": "Tradition Never Dies", "selftext": " \n\nPer family tradition spanning over 200 years, we passed pieces of Father's last host around the dining table.\n\nAmelia winked at me and took a bite of it\\`s heart. The blood dripping down her chin matched her ceremonial gown beautifully.\n\nShe discovered the body in the basement. A stroke this time.\n\nMy eldest son, James, waited patiently for us to finish before he would eat the brain. What a great honor to have our son chosen as Father\\`s next vessel! We would remember it with pride every time we looked to Father. Well, at least until his next host.", "id": "1433q30", "url": "https://www.reddit.com/r/Microfiction/comments/1433q30/tradition_never_dies/", "created_utc": 1686113631.0, "score": 4, "permalink": "/r/Microfiction/comments/1433q30/tradition_never_dies/", "comments": [], "URLs": [], "html_title": []}, {"title": "Entropy", "selftext": "  \n\n**Entropy finally caught us.**\n\nOur little galaxy in the outer reach of the universe has been disintegrating before our eyes. Even as I write this, the very molecules around us are failing, splitting their once stable bonds and cracking the foundation of our home. Every reaction in every part of the universe has led to this moment. Fitting that our galaxy, one of the earliest, would feel its wrath.\n\nA few of the ships escaped, but without stable ground or adequate propulsion, the rest are doomed. Rocket explosions are magnificent against our dying suns.\n\nMy skin is hot. There is no relief. The rock I sit upon is even hotter. The water has dried up. There is no habitable zone where we are. We will soon be consumed. My mind and my eyesight are hazy. Our best minds and our worst minds are indistinguishable. There is only release. \n\nI hope that whoever is reading this learns to slow down, and wherever you are reading this has not fallen to entropy. Or at least, that you are prepared.", "id": "13z173o", "url": "https://www.reddit.com/r/Microfiction/comments/13z173o/entropy/", "created_utc": 1685767826.0, "score": 5, "permalink": "/r/Microfiction/comments/13z173o/entropy/", "comments": [], "URLs": [], "html_title": []}, {"title": "coexisting", "selftext": "The inhabitants of the ice caverns had a longstanding coexistence problem with the creature, often losing scouts and resources when trying to expand their territory. Then one day everything changed when a brave young boy simply asked the monster if he'd like to share.", "id": "13rpyta", "url": "https://www.reddit.com/r/Microfiction/comments/13rpyta/coexisting/", "created_utc": 1685040781.0, "score": 2, "permalink": "/r/Microfiction/comments/13rpyta/coexisting/", "comments": ["That's a Disney movie, i love it.  I hope that's the tone you were going for.", "It's a movie?", "No, I'm sorry, let me rephrase that.  I felt like it would be the perfect plot to a Disney movie, or something that would end on a feel good note with everybody learning to work with each other.", "Oh. Cool. Thanks."], "URLs": [], "html_title": []}, {"title": "you're looking great today", "selftext": "just like that, thought and action became one and I gently pull the chair back. the sound of wooden legs scraping on cement breaks her concentration.\n\nthe thought i had was to sit across from her. because she looked interesting and it was wednesday and it was coffee and the new moon.\n\nbecause i was alone.\n\nthe thought was to pull the chair back and sit down. to say hello.\n\nthe thought was *maybe this will help me be less alone.*\n\nshe looks up from her book. a thick novel of some kind. the letters on the page neat rows of ideas and fully cooked thoughts. a stark contrast to my fully raw emotions.\n\ncooked thoughts.\n\nraw emotions.\n\nshe looks up with eyes of curiosity that quickly across the room.\n\nneat rows of letters waiting patiently underneath her rose colored fingernails.\n\na greeting escapes my lips. she responds in kind.\n\ni make some comment about the weather.\n\nher hair like peaceful waves that caress the shore.", "id": "138xf0s", "url": "https://www.reddit.com/r/Microfiction/comments/138xf0s/youre_looking_great_today/", "created_utc": 1683311920.0, "score": 2, "permalink": "/r/Microfiction/comments/138xf0s/youre_looking_great_today/", "comments": [], "URLs": [], "html_title": []}, {"title": "Shadows on my path", "selftext": "Wake up, it follows.\n\nClock in, it follows.\n\nEat lunch, it follows.\n\nBack home, it follows.\n\nOn the couch, my arm descends, feeling the closest I've been to it all day. \n\nA little lower, a little lower, tap it. \n\nIt taps back, again and again and again.\n\n...\n\nWe both laugh. \n\nWe're alone together.", "id": "12ylrbp", "url": "https://www.reddit.com/r/Microfiction/comments/12ylrbp/shadows_on_my_path/", "created_utc": 1682434467.0, "score": 3, "permalink": "/r/Microfiction/comments/12ylrbp/shadows_on_my_path/", "comments": [], "URLs": [], "html_title": []}, {"title": "This Hate Has Taken Its Toll on Me", "selftext": "This is a straightforward one because the title is so obvious.\n\nThis hate from you has taken its toll on me.  You said hello too many times before.  I may have no choice, but I won't say anything anymore.\n\nHowever, pressure on your arms, sinking my fingers which is everything you don't want me to do to you.", "id": "12y7699", "url": "https://www.reddit.com/r/Microfiction/comments/12y7699/this_hate_has_taken_its_toll_on_me/", "created_utc": 1682394491.0, "score": 2, "permalink": "/r/Microfiction/comments/12y7699/this_hate_has_taken_its_toll_on_me/", "comments": [], "URLs": [], "html_title": []}, {"title": "Low-text density", "selftext": "*“There’s a lot of white space,”* she said.\n\n*“Well, it’s a lot of dialogue,”* he said.\n\n*“I’d prefer to read more text.”*\n\n*“Why?”* he asked.\n\n*“Because thirty-six words is too few for these five lines.”*", "id": "12xr3fp", "url": "https://www.reddit.com/r/Microfiction/comments/12xr3fp/lowtext_density/", "created_utc": 1682359569.0, "score": 3, "permalink": "/r/Microfiction/comments/12xr3fp/lowtext_density/", "comments": ["Ha ha... very funny lol!😎"], "URLs": [], "html_title": []}, {"title": "It's a crime, I tell you", "selftext": " Ordered pizza. No cheese and all pineapple. Reported chef to FBI.", "id": "12xr18h", "url": "https://www.reddit.com/r/Microfiction/comments/12xr18h/its_a_crime_i_tell_you/", "created_utc": 1682359449.0, "score": 2, "permalink": "/r/Microfiction/comments/12xr18h/its_a_crime_i_tell_you/", "comments": ["In Louisiana, it is considered a crime to order a pizza for another person without the other person not giving consent."], "URLs": [], "html_title": []}, {"title": "Always complaining...", "selftext": "Woke up. Saw own funeral. Noticed typo on tombstone.", "id": "12xqzpp", "url": "https://www.reddit.com/r/Microfiction/comments/12xqzpp/always_complaining/", "created_utc": 1682359364.0, "score": 2, "permalink": "/r/Microfiction/comments/12xqzpp/always_complaining/", "comments": [], "URLs": [], "html_title": []}, {"title": "Carnivore", "selftext": "Survived apocalypse. Only food left: kale. Begged for death.", "id": "12xqylm", "url": "https://www.reddit.com/r/Microfiction/comments/12xqylm/carnivore/", "created_utc": 1682359310.0, "score": 1, "permalink": "/r/Microfiction/comments/12xqylm/carnivore/", "comments": [], "URLs": [], "html_title": []}, {"title": "Hope it's not contagious...", "selftext": "Went to doctor. Diagnosed with hypochondria. Died from anxiety.", "id": "12xqw7d", "url": "https://www.reddit.com/r/Microfiction/comments/12xqw7d/hope_its_not_contagious/", "created_utc": 1682359193.0, "score": 1, "permalink": "/r/Microfiction/comments/12xqw7d/hope_its_not_contagious/", "comments": [], "URLs": [], "html_title": []}, {"title": "Even better than James Moriarty", "selftext": "Burglar broke in. Left laptop, took charger. Criminal mastermind.", "id": "12xqvkg", "url": "https://www.reddit.com/r/Microfiction/comments/12xqvkg/even_better_than_james_moriarty/", "created_utc": 1682359157.0, "score": 1, "permalink": "/r/Microfiction/comments/12xqvkg/even_better_than_james_moriarty/", "comments": [], "URLs": [], "html_title": []}, {"title": "♪♪♪ There's a Starman waiting in the sky ♪♪♪", "selftext": "Wished upon star. Fell to earth. Reality is harsh.", "id": "12xqri0", "url": "https://www.reddit.com/r/Microfiction/comments/12xqri0/theres_a_starman_waiting_in_the_sky/", "created_utc": 1682358932.0, "score": 1, "permalink": "/r/Microfiction/comments/12xqri0/theres_a_starman_waiting_in_the_sky/", "comments": [], "URLs": [], "html_title": []}, {"title": "Ugly", "selftext": "Mirror broke. Seven years bad luck. Still prettier than you.", "id": "12xqpu1", "url": "https://www.reddit.com/r/Microfiction/comments/12xqpu1/ugly/", "created_utc": 1682358843.0, "score": 1, "permalink": "/r/Microfiction/comments/12xqpu1/ugly/", "comments": [], "URLs": [], "html_title": []}, {"title": "Meaning of life", "selftext": " Stolen wallet. No cash. Note inside: \"Thanks for the memories.\"", "id": "12xqp46", "url": "https://www.reddit.com/r/Microfiction/comments/12xqp46/meaning_of_life/", "created_utc": 1682358801.0, "score": 2, "permalink": "/r/Microfiction/comments/12xqp46/meaning_of_life/", "comments": [], "URLs": [], "html_title": []}, {"title": "A novel in itself", "selftext": " Failed writer becomes successful after plagiarizing their own work.", "id": "12xqnvj", "url": "https://www.reddit.com/r/Microfiction/comments/12xqnvj/a_novel_in_itself/", "created_utc": 1682358732.0, "score": 1, "permalink": "/r/Microfiction/comments/12xqnvj/a_novel_in_itself/", "comments": [], "URLs": [], "html_title": []}, {"title": "Alcohol-induced promiscuity", "selftext": " Blink. Woke up. Different bed. Regret. Leave. Repeat.", "id": "12xqmin", "url": "https://www.reddit.com/r/Microfiction/comments/12xqmin/alcoholinduced_promiscuity/", "created_utc": 1682358658.0, "score": 3, "permalink": "/r/Microfiction/comments/12xqmin/alcoholinduced_promiscuity/", "comments": [], "URLs": [], "html_title": []}, {"title": "You Won't?", "selftext": "That's enough!  Your lies towards your little girl who is now a parent herself must stop right now!\n\nIf you do let her change, then anything she may do to herself can be avoided without any problems.  She is not going to work sick, so if you carry on like this, you will continue to never be posh to get what you want from anyone for the remainder of your days!", "id": "12x1fo9", "url": "https://www.reddit.com/r/Microfiction/comments/12x1fo9/you_wont/", "created_utc": 1682306834.0, "score": 1, "permalink": "/r/Microfiction/comments/12x1fo9/you_wont/", "comments": [], "URLs": [], "html_title": []}, {"title": "Can't Wait for You to Change", "selftext": "You must be quite the sociopath when I met you for the first time despite all the positive accounts I have heard about you.\n\nIt's just not worth it to continue tormenting them the way you are.\n\nThe one who needs a reality check is you,  but what could concern all of us for a bit is your warped state of mind.", "id": "12x0v63", "url": "https://www.reddit.com/r/Microfiction/comments/12x0v63/cant_wait_for_you_to_change/", "created_utc": 1682305611.0, "score": 1, "permalink": "/r/Microfiction/comments/12x0v63/cant_wait_for_you_to_change/", "comments": [], "URLs": [], "html_title": []}, {"title": "You Don't Want Me Acting Anymore?", "selftext": "Wow...I just started my career and all of you are going to kick me out just because I was unable to keep the car at the speed limit you wanted?\n\nI will be walking with a cane for at least the next few years, but I have already filed a lawsuit up your sorry asses.\n\nOh, the accident was my problem and my problem only?  All of you will never change because of how much fame and fortune has corrupted your minds.\n\nNow, if all of you can excuse me, I am going to write a letter to some major newspapers to expose all of you.\n\nNobody will believe me just because I just started my career?  Well, I am sorry to say this, but fuck all of you!", "id": "12vszpg", "url": "https://www.reddit.com/r/Microfiction/comments/12vszpg/you_dont_want_me_acting_anymore/", "created_utc": 1682218250.0, "score": 2, "permalink": "/r/Microfiction/comments/12vszpg/you_dont_want_me_acting_anymore/", "comments": [], "URLs": [], "html_title": []}, {"title": "I Would Not Oblige to You", "selftext": "Well, if you told me to help you, I would not oblige to you.\n\nI have been around you, but I'm sure you don't know how I feel.  \n\nSo, you can wipe off your smirk, I know what you enjoy indulging in, therefore what you have said so far has been nothing more than deceptions for you to gain the upper hand.", "id": "12vkydd", "url": "https://www.reddit.com/r/Microfiction/comments/12vkydd/i_would_not_oblige_to_you/", "created_utc": 1682200793.0, "score": 1, "permalink": "/r/Microfiction/comments/12vkydd/i_would_not_oblige_to_you/", "comments": [], "URLs": [], "html_title": []}, {"title": "The Message and Something Unexpected", "selftext": "The partially deaf man decided to check the mail one day in order to make sure people who enjoyed hating him were not upping the ante.\n\nHowever, his mom beat him to the mailbox.  She opened the mailbox and saw only one piece of mail that her name on it from someone anonymous.\n\nShe got back in the house and opened the envelope and it had a bizarre message in it.  The message was written by hand.\n\n\"I hope this message finds you well.  Your son for the past three years has been sending me gifts and cards through the mail.  He has sent my mom gifts too.\n\nI don't think of this as appropriate and I would appreciate it if you talk to him to tell him to stop this behavior.\n\nThank you.\"\n\nShe of course had a fit immediately and threatened to file charges against him.\n\nThe lead character shook his head and texted the agent who worked for the firm that provided services to him.\n\nThis caused her anger to become uncontrollable.  He put on his jacket and shoes and walked to a bus station.  He boarded a bus that took him to a safe space.", "id": "12uuimh", "url": "https://www.reddit.com/r/Microfiction/comments/12uuimh/the_message_and_something_unexpected/", "created_utc": 1682137600.0, "score": 1, "permalink": "/r/Microfiction/comments/12uuimh/the_message_and_something_unexpected/", "comments": [], "URLs": [], "html_title": []}, {"title": "Forced to Be a Man of Few Words", "selftext": "The title of this story is very obvious.\n\nA few days ago as I was going home from work, I needed some money so I walked to an ATM and withdrew some cash.\n\nI'm a slowpoke when it comes to using public transportation and I didn't have my phone with me, so I missed the first bus that would get me home for the day.\n\nWhen I got home, my parents were ready to mock me as if I meant nothing to them.\n\nMy mom said to me, \"You forced yourself to be a man of few words because of what you are; filth in the eyes of God.\"\n\n\"So Mom, why won't you allow me to be social?\"\n\n\"Nobody will ever be good for you.  Now, take off your shoes and say the prayer before we eat.\"\n\nI didn't oblige, but I will stop the story right here.", "id": "12urm4t", "url": "https://www.reddit.com/r/Microfiction/comments/12urm4t/forced_to_be_a_man_of_few_words/", "created_utc": 1682130438.0, "score": 1, "permalink": "/r/Microfiction/comments/12urm4t/forced_to_be_a_man_of_few_words/", "comments": [], "URLs": [], "html_title": []}, {"title": "The Phone's Wall", "selftext": "My sister and I were eating lunch as we watched our mom take the phone in a strong grip.\n\nShe exhibited anger, but it became more clear when she listened to an automated system that put her on hold.\n\n(Our mom hates automated phone systems, mind you.)\n\nAs we continued eating lunch, my sister and I laughed at her because of how much her impatience increased.\n\nOur mom hung up the phone after about thirty minutes.\n\nIronically, it was the phone company she was making a call to.", "id": "12umx8s", "url": "https://www.reddit.com/r/Microfiction/comments/12umx8s/the_phones_wall/", "created_utc": 1682120254.0, "score": 1, "permalink": "/r/Microfiction/comments/12umx8s/the_phones_wall/", "comments": [], "URLs": [], "html_title": []}, {"title": "Exaggeration at Its Finest", "selftext": "Just because my wife and I have been helping the strange young man improve his social skills here at the parish doesn't give you any ideas on how to increase your belief believing in God is the coolest thing in the world when it is not.\n\nOh, how lovely!  He blacked out and he took his prescriptions as indicated!  Many of you who enjoy hating him are hypocrites in the eyes of God.\n\nWhat, charges are to be filed against him?\nFor what?!", "id": "12uhnno", "url": "https://www.reddit.com/r/Microfiction/comments/12uhnno/exaggeration_at_its_finest/", "created_utc": 1682109770.0, "score": 1, "permalink": "/r/Microfiction/comments/12uhnno/exaggeration_at_its_finest/", "comments": [], "URLs": [], "html_title": []}, {"title": "Exaggeration at Its Finest", "selftext": "The strange young man and a middle aged man who served as his mentor walked into the Church.  The man and his wife were civil and friendly to the boy much to the dismay of the boy's own loved ones.\n\nAs the Celebrant who led Mass delivered The Homily, the boy became troubled and collapsed.  The Celebrant continued with Mass as if the boy was a threat to the well-being of the Church.\n\nIn the Church's basement where some people enjoyed coffee and donuts after Mass, such people indulged in intimidating the boy.\n\nA prominent member filed charges against the boy will go to trial within the next three months.", "id": "12uhdj6", "url": "https://www.reddit.com/r/Microfiction/comments/12uhdj6/exaggeration_at_its_finest/", "created_utc": 1682109236.0, "score": 2, "permalink": "/r/Microfiction/comments/12uhdj6/exaggeration_at_its_finest/", "comments": [], "URLs": [], "html_title": []}, {"title": "They Need to Be Kicked Out of the Church", "selftext": "An average working-class mom and her daughter walked into their church they knew for years despite the changing of the times in regards to ongoing political and social issues.\n\nThey sat in a pew, lowered a kneeler and began to pray. Many fellow members of their congregation knew them as private women who wanted to keep to themselves and refused to attend most major events.\n\nLater, after The Priest delivered The Homily, the two collected the money and brought the Gifts to the altar. \n\nAfter Mass, the two women attended a rally for women’s rights at a popular park. They didn’t expect another woman to follow them a strong conservative (and an absolute snob, mind you) who often mocked the two women for not conforming the way she saw fit.\n\nThe following Sunday, the two women weren’t surprised when they were told to leave their congregation and go somewhere else. The two women obliged in a non-violent way, moving to a church that was nearby. \n\nPeople of their new church were more welcoming and open-minded including the Priest.\n\nThe two women are happy and ignore members of their former church whenever they see them.", "id": "12tj4n1", "url": "https://www.reddit.com/r/Microfiction/comments/12tj4n1/they_need_to_be_kicked_out_of_the_church/", "created_utc": 1682033677.0, "score": 1, "permalink": "/r/Microfiction/comments/12tj4n1/they_need_to_be_kicked_out_of_the_church/", "comments": [], "URLs": [], "html_title": []}, {"title": "Two in One Day with the First One at Your Home", "selftext": "Oh…of course, your family enjoy playing the victims! What do you think I should do to help you?! We see you every day and the manager wanted to grant you employment, but why did you have a second one in here right in the middle of my shift.\n\nSure, you will always have a kind personality and are always easy to talk to, but okay fine, forget about me giving you advice about how to control your anger issues therefore I will get back to work! Fuck you!", "id": "12tgks8", "url": "https://www.reddit.com/r/Microfiction/comments/12tgks8/two_in_one_day_with_the_first_one_at_your_home/", "created_utc": 1682027910.0, "score": 2, "permalink": "/r/Microfiction/comments/12tgks8/two_in_one_day_with_the_first_one_at_your_home/", "comments": [], "URLs": [], "html_title": []}, {"title": "You Enjoy Being a Bigot", "selftext": "  \n\nThe socially awkward young man followed his parents and his misanthropic sister as they walked along the path to where everyone else was waiting for them eager to see them for the first time in ten years.\n\nA bigoted male relative, a man of seemingly great physical size approached them and looked at the kids. He said to the sister with a strong cowboy drawl in his voice, “So, have you found yourself a man to be with for your own good?”\n\nThe sister said to him back with a grudge in her voice, “No.”\n\nThe bigot turned to the young man and asked him, “So, what’s eating at you now?”\n\nThe young man asked him, “You enjoy being a bigot.”\n\n“Excuse me?”\n\n“You heard me.”", "id": "12tfvsu", "url": "https://www.reddit.com/r/Microfiction/comments/12tfvsu/you_enjoy_being_a_bigot/", "created_utc": 1682026366.0, "score": 2, "permalink": "/r/Microfiction/comments/12tfvsu/you_enjoy_being_a_bigot/", "comments": ["I emailed this piece earlier today to an online publication that specializes in micro fiction.\n\nI should be contacted within the next thirty days or so."], "URLs": [], "html_title": []}, {"title": "Together", "selftext": "When I needed you you were there within the blink of an eye. when I was desperate to get away from my toxic relationships you were the first person I would call.  grasping the phone in desperation. \"I need you!\" travels at light speed into your mind.  Once the Bonnie to my Clyde you are now the Morticia to my Gomez. The room is lively when we are together and our lives are the same.  The way we fit together like puzzle pieces puzzles me on how I didn't notice sooner that we didn't fit together any sooner. 1000 pieces have now become 2.", "id": "12nl4e5", "url": "https://www.reddit.com/r/Microfiction/comments/12nl4e5/together/", "created_utc": 1681597709.0, "score": 1, "permalink": "/r/Microfiction/comments/12nl4e5/together/", "comments": [], "URLs": [], "html_title": []}, {"title": "Bridges", "selftext": "I don’t mind burning bridges \nIf they were built to connect two one way streets.", "id": "12nbwp9", "url": "https://www.reddit.com/r/Microfiction/comments/12nbwp9/bridges/", "created_utc": 1681579667.0, "score": 0, "permalink": "/r/Microfiction/comments/12nbwp9/bridges/", "comments": [], "URLs": [], "html_title": []}, {"title": "Summer", "selftext": "The sun does not rise until you wake up.  The sea does not make a single wave until you take your first step.  The animals don't move until you take your first breath.  You are a powerful woman. My love for you has been intensified.  Your body has become something that I cant live without.  I want you forever close to me. Forever roped on my arms. I want to see the burning passion you have for me and I will show you the same. A walk on the beach is satisfying but it's not fulfilling.  I would like more. You draw me in like a pie with an amazing aroma. The energy you inject into me gives me intense dopamine.  I could run 100 miles. Your vocal cords sound more intense and your heart beats more clearly when I'm in your presence.  Even the gaze in your eyes moves me like midnight waves. I want to hold you closer with each Second I don't ever want to let you go. we can spice it up a bit and go all outlet our dreams come true during this time. Let's make today the fourth of July.", "id": "12mfqa6", "url": "https://www.reddit.com/r/Microfiction/comments/12mfqa6/summer/", "created_utc": 1681510764.0, "score": 1, "permalink": "/r/Microfiction/comments/12mfqa6/summer/", "comments": [], "URLs": [], "html_title": []}, {"title": "Beyond The Black", "selftext": "I bolt up, tangled in soaked sheets. Heart pounding, I gasp for air.\n\nFear knots my stomach, mind reeling from the weight of another fading nightmare.\n\nMy eyes dart - alone in suffocating darkness. Still, I feel it. Lurking, watching from beyond the black...  \n\n\n&#x200B;\n\n[Voiced Reading.](https://reddit.com/link/12llqne/video/m24hn9agasta1/player)", "id": "12llqne", "url": "https://www.reddit.com/r/Microfiction/comments/12llqne/beyond_the_black/", "created_utc": 1681451031.0, "score": 3, "permalink": "/r/Microfiction/comments/12llqne/beyond_the_black/", "comments": [], "URLs": ["https://reddit.com/link/12llqne/video/m24hn9agasta1/player)"], "html_title": ["Too Many Requests"]}, {"title": "Spring", "selftext": "Your smile is so soft like rose pedals.  it makes me feel so warm inside.  when you give me that small giggle after you tell me how your day was implants butterflies in my stomach.  I love it. it's like we just started dating again.  the feeling of the beginning is so joyous.  I feel the same way I felt when I first saw you in high school.  you walked past me as if I wasnt there. you brushed your hair back from your gorgeous face.  even though I was seated behind you in class.  your face was still implanted in my mind for the rest of those days. I want us to go dancing.  nothing to fast that makes us feel hot but something for calming and slow where 1 2 steps happen as you rest your tires head on my shoulder.  you move right hand to my chest feeling the drums rumble as we dance under starlights.  we go in and out of the crowd like a glace. our souls keep calling for each other.  there's no point in separating. we can't go too far without thinking about each others there's love.  It feels so special,  so sweet that you want to stay with me. let me hold you my love.  I have you do not worry about falling.  I will always be here to catch you. but even with all the feelings I have. it still intensifies and I want more. You, you will always be mine.", "id": "12ir63j", "url": "https://www.reddit.com/r/Microfiction/comments/12ir63j/spring/", "created_utc": 1681234571.0, "score": 1, "permalink": "/r/Microfiction/comments/12ir63j/spring/", "comments": [], "URLs": [], "html_title": []}, {"title": "Sunflowers", "selftext": "I will say it once and I will also say it twice. You are the only one who can keep me satisfied. I have never felt this type of love before. \n\nFeeling greedy now cause I am desperate  for more. Nothing else is clear when I'm not with you. The water I drink gets cloudy when its not from your hands. The food gets cold when you don't cook it. The bed feels bigger when you're not in it.", "id": "12ihm7t", "url": "https://www.reddit.com/r/Microfiction/comments/12ihm7t/sunflowers/", "created_utc": 1681214574.0, "score": 1, "permalink": "/r/Microfiction/comments/12ihm7t/sunflowers/", "comments": [], "URLs": [], "html_title": []}, {"title": "I love you", "selftext": "The phrase I love you hits me a lot harder like I'm about to charter across deep waters. \n\nYour smile shoots me so high I stay up there for a while in the sky holding a bonsai contemplating on am I really that much of a bad guy. I wonder why the people say that I shouldn't trust you. Your aura gives off a blue hue. Just bring me to the light and I just might just say I love you that you can come cowrite on my back.", "id": "12i2btn", "url": "https://www.reddit.com/r/Microfiction/comments/12i2btn/i_love_you/", "created_utc": 1681173207.0, "score": 2, "permalink": "/r/Microfiction/comments/12i2btn/i_love_you/", "comments": [], "URLs": [], "html_title": []}, {"title": "Loving home", "selftext": "Hello honey and welcome. Dont worry when you're here we promote creativity. We encourage that type of mindset with every fabric and stitch. \n\nIt goes beyond versatility and function.  The atmosphere while you are with us is soft but still very much noticeable.  Yet not a lot of people consider what we do is worthwhile.  Cherish what drives you.", "id": "12hqqim", "url": "https://www.reddit.com/r/Microfiction/comments/12hqqim/loving_home/", "created_utc": 1681149889.0, "score": 1, "permalink": "/r/Microfiction/comments/12hqqim/loving_home/", "comments": [], "URLs": [], "html_title": []}, {"title": "Victoria", "selftext": "The fiery in her eyes and her name were one in the same...Victoria. A young lioness who had no king, but to call her a queen was insulting cause the claws she beard held the power of a nation. She was the king even her people who were underneath her knew she all was powerful. \n\nHer questions if you were asked one was of a masquerade. it wasn't a question it was a statement, and if she asked you when you were going to get something done what she meant was it should have been done an hour ago. If you did not satisfy her...well she knew how to take care of you. Dont take such a statement like this as rose pedals but as thorns.", "id": "12gzkzw", "url": "https://www.reddit.com/r/Microfiction/comments/12gzkzw/victoria/", "created_utc": 1681082690.0, "score": 1, "permalink": "/r/Microfiction/comments/12gzkzw/victoria/", "comments": [], "URLs": [], "html_title": []}, {"title": "I love you", "selftext": "The phrase I love you hits me a lot harder like I'm about to charter across deep waters. Your smile shoots me so high I stay up there for a while in the sky holding a bonsai contemplating on am I really that much of a bad guy. I wonder why the people say that I shouldn't trust you. Your aura gives off a blue hue. Just bring me to the light and I just might just say I love you that you can come cowrite on my back.", "id": "12gv82m", "url": "https://www.reddit.com/r/Microfiction/comments/12gv82m/i_love_you/", "created_utc": 1681073212.0, "score": 1, "permalink": "/r/Microfiction/comments/12gv82m/i_love_you/", "comments": [], "URLs": [], "html_title": []}, {"title": "Never", "selftext": "I want to show you how I'm feeling. Try to get you to understand. I am never going to just give you up. \n\nNever will I set you down and have someone come by and pick you up. Never going to let the rain make you cry or let the wind say good bye. Or let the fire tell you lies and hurt you.", "id": "12gpkqp", "url": "https://www.reddit.com/r/Microfiction/comments/12gpkqp/never/", "created_utc": 1681061058.0, "score": 1, "permalink": "/r/Microfiction/comments/12gpkqp/never/", "comments": [], "URLs": [], "html_title": []}, {"title": "Her silhouette", "selftext": "Her silhouette is godlike . Pure Devine, grab her hips like a road bike but I know we're going to be on trails.", "id": "12glrzg", "url": "https://www.reddit.com/r/Microfiction/comments/12glrzg/her_silhouette/", "created_utc": 1681052404.0, "score": 1, "permalink": "/r/Microfiction/comments/12glrzg/her_silhouette/", "comments": [], "URLs": [], "html_title": []}, {"title": "Let me love you", "selftext": "Let me love you and I will hold you. Your heart will be cherished forever in time. I know you feel lost and so very much damaged that you don't want me to help. But let me love you. Baby let me in and I can give you that warmth again and I will keep it there. With me you will have enough time. I will get the sandman on the phone so you can finally rest.", "id": "12fyoap", "url": "https://www.reddit.com/r/Microfiction/comments/12fyoap/let_me_love_you/", "created_utc": 1680988560.0, "score": 2, "permalink": "/r/Microfiction/comments/12fyoap/let_me_love_you/", "comments": [], "URLs": [], "html_title": []}, {"title": "Our time together", "selftext": "I loved you more than any man would, and I cared for you as any dad should. Our time together was a wonder that was beyond wonderful. We would play outside building forts and challenging each other.\n\nI loved that cute little voice of yours when you said bring it on mister. After a few hours of being outside you would sprint to the kitchen as I casually walked behind you. I already knew what was going to happen next. \n\nCooking time with little. Your imaginary youtube channel. I squat behind the counter as you introduce the meal of the day which this time it was breakfast. Waffles, pancakes, homemade orange juice, French toast and scrambled eggs. Even though it would ALWAYS end up with a gigantic mess I let you do your thing and when you were all done I'd shuffle you to the den with milk and chocolate chip cookies. \n\nI in the kitchen cleaning up the hurricane of a mess you made. With deep sighs and smirks I giggle at the fact that somehow a pancake was able to land on top of my head. \n\nWith one more deep inhale in I hear a giggle behind me. Its you with your hands over your mouth trying to not burst into laughter as the syrup pours down from the top of my head down to the tip of my nose. \n\nPointing back to the den I tell you to go so I can clean up. After I'm done I go down to meet you and you disappear.   Hide and go seek. I already know where you are because I hear our bed Creek a bit. Mustering up the courage to go upstairs I make it. You're sitting on the bed in your silver silk PJs with uno cards out. \n\nNot the regular uno cards but thee modified uno cards that we replaced the draw four with pieces of clothing that the other person had to remove. As we play you start off with eagerness in mind. Slamming down a card with the draw four crossed out and replaced with the words take off boxers/panties. I look at you as smirk as I take off my red and black plad boxers but putting my black shorts back on. \n\nAs the game continues, the room getting more hot and more messy as articles of clothing fling off of our bodies. I with as I say uno and slam down the red 5 I had. You cross your arms and pout and say you cheated. I look at you as I grab the cards to start shuffling them again for a round two. You yell I'm going to beat you this round. Haha whatever you say little. Whatever you say.", "id": "12fqfd1", "url": "https://www.reddit.com/r/Microfiction/comments/12fqfd1/our_time_together/", "created_utc": 1680970338.0, "score": 1, "permalink": "/r/Microfiction/comments/12fqfd1/our_time_together/", "comments": ["Her pussy is the only thing you cared for, rest are imaginary", "Very interesting way to interpret this ☺️✌️🙏"], "URLs": [], "html_title": []}, {"title": "Ancient Egypt", "selftext": "When I was a boy my grandpa would tell me stories about Ancient Egypt. He would tell me about the pharaohs, pyramids, sunsets along the Nile, and the pretty girls. Oh, so many pretty girls! I would question him about this.\n\n\"But Grandpa\", I would ask, \"you were born around the turn of the century\", how could you have seen Ancient Egypt?\"\n\n\"Something to amuse you with my boy\", he would say, winking at me. Then he would kiss me on the cheek and cut me up an apple.\n\nMy grandpa died when I was fifteen, and lately I’ve been thinking a lot about him. Now that I’m old, you see, I know what he means. Now I see what he sees.", "id": "11vs2ic", "url": "https://www.reddit.com/r/Microfiction/comments/11vs2ic/ancient_egypt/", "created_utc": 1679248391.0, "score": 2, "permalink": "/r/Microfiction/comments/11vs2ic/ancient_egypt/", "comments": [], "URLs": [], "html_title": []}, {"title": "Who's out there?", "selftext": "There are people alive today who you will never meet in your life. They may live on the other side of the world, or nearby even, but you'll never know. You can go to the ends of the earth to seek them out but they'll still elude you. You won't even know who you're looking for.\n\nYour life will never intertwine with theirs. You'll have no impact on their existence, nor they on yours. Even indirectly. \n\nYet you still feel them missing from your life. They haunt you as a negative presence; an antighost. \n\nYou know that empty feeling you get for no reason? That strange dismay that drags you out of a happy moment? \n\nYou know how you swear you hear someone call out your name sometimes? Even when you're alone?\n\nThat's them crying out to you.\n\nOnly neither of you know it.\n\nThey'll continue to exist, to go about their merry way. They'll love and laugh like you do. They'll have their joys and sorrows. The same sun will rise and set on them just as it will on you. If you met them you might even become best of friends. \n\nBut you never will.\n\nYou'll continue to live in blissful ignorance of each other. \n\nAnd neither of you will know who you're missing.", "id": "11ve5h9", "url": "https://www.reddit.com/r/Microfiction/comments/11ve5h9/whos_out_there/", "created_utc": 1679209314.0, "score": 6, "permalink": "/r/Microfiction/comments/11ve5h9/whos_out_there/", "comments": ["That's okay, I think. I hope they're doing good."], "URLs": [], "html_title": []}, {"title": "Organized", "selftext": "\"You see, the urge is like a song, stuck in your head, playing over and over, but just the one part, so that you start to go crazy until you just fuckin listen to the damn thing already, and then- ah! There it is! The whole song, all the parts laid out in front of you, all in order like you remember, and all is well.\n\n\"Hold still. This one's a classic.\"", "id": "11tj1to", "url": "https://www.reddit.com/r/Microfiction/comments/11tj1to/organized/", "created_utc": 1679034030.0, "score": 2, "permalink": "/r/Microfiction/comments/11tj1to/organized/", "comments": [], "URLs": [], "html_title": []}, {"title": "A happy place", "selftext": "It's late, both children have snuck into bed. They claim an arm each, the dog my feet. I'm trapped but content. Freedom enough to kiss their slumbering heads. The door creaks. My daughter's silhouette is in it's frame.", "id": "11duvcz", "url": "https://www.reddit.com/r/Microfiction/comments/11duvcz/a_happy_place/", "created_utc": 1677552698.0, "score": 5, "permalink": "/r/Microfiction/comments/11duvcz/a_happy_place/", "comments": [], "URLs": [], "html_title": []}, {"title": "The Regretful Visit", "selftext": "So it happened a few days before my mom's birthday and I didn't want to get her the usual, even though she is a picky woman to this day.\n\nI decided to walk into of all places, a sex toy shop because not only did I needed to use the bathroom, but also to overcome sexual arousal from my girlfriend who sent me selfies of herself scantily clad.\n\nI walked into the shop and asked the employee if I could use the bathroom first.  After giving the employee my ID, I saw all the viewing rooms were closed because of uncleanliness.  I walked into the bathroom and after relieving myself, I jerked off for several minutes.\n\nAfter I ejaculated, I wiped down the rim of the toilet seat, then the floor because some of my cum had landed on the floor.  I washed my hands and acted as if I was still wanting to buy something for my mom despite her enforcing the rule that all should wait until marriage begins to lose virginity.\n\nThe employee asked me if I was okay.  Ironically, I bought myself a small box of condoms and left the sex toy shop wondering what was the point of buying her something she would never like.  \n\nExample: Last year for Mother's Day, my sister and I bought our mom a DVD from the Marvel Cinematic Universe each.  She threw a fit expecting perfectionism on a daily basis around her.\n\nOn a bus heading to work, I called my girlfriend and asked her if I could visit her after she got off of her work.  She said yes, but we had to wait for each other at her place because she worked in a large shopping mall as a security guard.", "id": "111oxy5", "url": "https://www.reddit.com/r/Microfiction/comments/111oxy5/the_regretful_visit/", "created_utc": 1676334764.0, "score": 2, "permalink": "/r/Microfiction/comments/111oxy5/the_regretful_visit/", "comments": [], "URLs": [], "html_title": []}, {"title": "'Attention Inmates!", "selftext": "Attention inmates! Be reminded that this is a prison for convicts of time-travel related crimes! Measures have been taken to prevent inmates cheating their sentences. When Davidson re-appears, please inform him that his accidental century spent in the Dark Zone was his own fault, and doesn't count as time served.'", "id": "10ugrzi", "url": "https://www.reddit.com/r/Microfiction/comments/10ugrzi/attention_inmates/", "created_utc": 1675615105.0, "score": 4, "permalink": "/r/Microfiction/comments/10ugrzi/attention_inmates/", "comments": [], "URLs": [], "html_title": []}, {"title": "The Guard Dogs", "selftext": "There's a small suburban town where everyone has a cat, but nobody has a dog. One day, the town begins experiencing a slew of home break-ins. In response, a new pet shop opens, boasting highly trained guard dogs such as German Shepherds and Rottweilers. Some of the townspeople buy a guard dog, while others decline, insisting they can protect their homes themselves.\n\nWell, not long after the shop opens, a new problem arises. One by one, people with guard dogs start finding their cats dead and bloodied in their backyards. Unfortunately, no one has actually seen whatever is killing these cats. It's just strangely recurrent in homes with guard dogs.\n\nAlso everyone is still getting their homes robbed.", "id": "107mnc4", "url": "https://www.reddit.com/r/Microfiction/comments/107mnc4/the_guard_dogs/", "created_utc": 1673290791.0, "score": 2, "permalink": "/r/Microfiction/comments/107mnc4/the_guard_dogs/", "comments": [], "URLs": [], "html_title": []}, {"title": "https://medium.com/@newzerostatus/shy-guy-at-the-orgy-78b1f7b531d3 -- -- short read", "selftext": "", "id": "102uox5", "url": "https://medium.com/@newzerostatus/shy-guy-at-the-orgy-78b1f7b531d3", "created_utc": 1672808967.0, "score": 1, "permalink": "/r/Microfiction/comments/102uox5/httpsmediumcomnewzerostatusshyguyattheorgy78b1f7b5/", "comments": [], "URLs": [], "html_title": []}, {"title": "I found out I was allergic to ghosts after I moved into the haunted house and started sneezing ectoplasm", "selftext": "", "id": "zut18p", "url": "https://www.reddit.com/r/Microfiction/comments/zut18p/i_found_out_i_was_allergic_to_ghosts_after_i/", "created_utc": 1671952584.0, "score": 5, "permalink": "/r/Microfiction/comments/zut18p/i_found_out_i_was_allergic_to_ghosts_after_i/", "comments": [], "URLs": [], "html_title": []}, {"title": "They Told Us", "selftext": "When we started digging with our single bone-tipped tentacle, they told us to keep going.\n\nWhen our fangs breached the roof of the cave lined with Uranium-235 and twisted mouths, they told us to keep going.\n\nWhen we descended through lagoons filled with many-eyed fish and bleached bones, our gills filtering out the sulfuric acid, the voices told us to keep going.\n\nWhen we found the submarine hull, buried in stone, and with our many arms broke open its hatch and then the lead safe within, the voices in our heads shouted at us. Keep going, they said.\n\nWhen we poured the vial we found there, the last tincture of humanity, down our three throats, we felt our genetic material revert and our shape shrink and simplify. Then, the voices fell silent.\n\nI closed the safe with my two arms. I was alone. I was human. I felt alive. The location of the submarine was no longer inscribed into my genetic material. The instructions imprinted in the DNA of every living human before the apocalypse had done their job. I had spent years as a glorified homing pigeon, but because of that, I had found my salvation. \n\nMy name was Tommy and I felt like a sandwich. Nothing more, nothing less.\n\nEvolution's great until it happens to you.", "id": "zu516x", "url": "https://www.reddit.com/r/Microfiction/comments/zu516x/they_told_us/", "created_utc": 1671868540.0, "score": 7, "permalink": "/r/Microfiction/comments/zu516x/they_told_us/", "comments": ["I really enjoyed this piece.", "Thank you! :)", ">Thank you! :)\n\nYou're welcome!"], "URLs": [], "html_title": []}, {"title": "Margaret's Daughter's Drumsticks", "selftext": "They came. She left. I cried. They snapped.", "id": "z9hai2", "url": "https://www.reddit.com/r/Microfiction/comments/z9hai2/margarets_daughters_drumsticks/", "created_utc": 1669878339.0, "score": 5, "permalink": "/r/Microfiction/comments/z9hai2/margarets_daughters_drumsticks/", "comments": [], "URLs": [], "html_title": []}, {"title": "The Brutes, the Cowards, and the Dead", "selftext": "\\[100 words\\] \n\nA twig snaps and he wastes critical seconds swinging a flashlight beam among the dark trees. It’s already too late. A rabbit and a bear each know exactly what to do when confronted with the unknown. Man, however, occupies an ecological wasteland. To flee without cause is cowardly; to fight without cause is brutish. A rational person must tamp down such outdated, undignified instincts and squint into the darkness until the unknown becomes known. But tonight, the closer he looks the less he understands. The rabbits are half a mile away by now. There’s only one thing left to eat.", "id": "z7xukp", "url": "https://www.reddit.com/r/Microfiction/comments/z7xukp/the_brutes_the_cowards_and_the_dead/", "created_utc": 1669737446.0, "score": 11, "permalink": "/r/Microfiction/comments/z7xukp/the_brutes_the_cowards_and_the_dead/", "comments": ["I feel attacked, I love to investigate things that go bump in the night. This was a great read."], "URLs": [], "html_title": []}, {"title": "Kiri's Vice (TW: Suicidal Thoughts)", "selftext": "Every night  \n8:30PM  \nLike clockwork  \nI take the stairs up to the roof  \nI setup a foldout chair  \nI wait until the sun sets  \nand I tell myself:  \n\"I'm not ready yet.\"", "id": "z7jt0x", "url": "https://www.reddit.com/r/Microfiction/comments/z7jt0x/kiris_vice_tw_suicidal_thoughts/", "created_utc": 1669697501.0, "score": 6, "permalink": "/r/Microfiction/comments/z7jt0x/kiris_vice_tw_suicidal_thoughts/", "comments": ["Hopefully they are never ready. I felt this one."], "URLs": [], "html_title": []}, {"title": "You make me feel", "selftext": "\nYou make me want to go to the gym and lift all the weights there. They feel like feathers while I have your love pumped throughout my veins. You make me glow and burn with passion what was once ambers started a whole bonfire.", "id": "z6d8ok", "url": "https://www.reddit.com/r/Microfiction/comments/z6d8ok/you_make_me_feel/", "created_utc": 1669584676.0, "score": 3, "permalink": "/r/Microfiction/comments/z6d8ok/you_make_me_feel/", "comments": [], "URLs": [], "html_title": []}, {"title": "I miss you", "selftext": "\nI have been trapped by your gaze. Chained up by your smile and locked away in the house of your feelings. I put out a ransom so that one day I could leave this place and I want to feel alive again. But you feel so lovely and I don't want to feel alone. Your touch gives my skin their food, but ever since you left my skin has been deprived of its nutrients. HOW DARE YOU LEAVE ME LIKE THIS?! The day you left me you torn my body from into skin and bone not willing to be put back together. When I step into our happy place I get a wave of emotions about you. Our kids still ask about you. \"When's mommy coming home?\" Oh child I don't know. It breaks me down and into tears too see you gone. They don't realise that you will never come back.", "id": "z68vvm", "url": "https://www.reddit.com/r/Microfiction/comments/z68vvm/i_miss_you/", "created_utc": 1669574434.0, "score": 3, "permalink": "/r/Microfiction/comments/z68vvm/i_miss_you/", "comments": [], "URLs": [], "html_title": []}, {"title": "Our time together", "selftext": "I loved you more than any man would, and I cared for you as any dad should. Our time together was a wonder that was beyond wonderful. We would play outside building forts and challenging each other. I loved that cute little voice of yours when you said bring it on mister. After a few hours of being outside you would sprint to the kitchen as I casually walked behind you. I already knew what was going to happen next. Cooking time with little. Your imaginary youtube channel. I squat behind the counter as you introduce the meal of the day which this time it was breakfast. Waffles, pancakes, homemade orange juice, French toast and scrambled eggs. Even though it would ALWAYS end up with a gigantic mess I let you do your thing. And when you were all done I'd shuffle you to the den with milk and chocolate chip cookies. I in the kitchen cleaning up the hurricane of a mess you made. With deep sighs and smirks I giggle at the fact that somehow a pancake was able to land on top of my head. With one more deep inhale in I hear a giggle behind me. Its you with your hands over your mouth trying to not burst into laughter as the syrup pours down from the top of my head down to the tip of my nose. Pointing back to the den I tell you to go so I can clean up. After I'm done I go down to meet you and you disappear. Hide and go seek. I already know where you are because I hear our bed Creek a bit. Mustering up the courage to go upstairs I make it. You're sitting on the bed in your silver silk PJs with uno cards out. Not the regular uno cards but thee modified uno cards that we replaced the draw four with pieces of clothing that the other person had to remove. As we play you start off with eagerness in mind. Slamming down a card with the draw four crossed out and replaced with the words take off boxers/panties. I look at you as smirk as I take off my red and black plad boxers but putting my black shorts back on. As the game continues, the room getting more hot and more messy as articles of clothing fling off of our bodies. I with as I say uno and slam down the red 5 I had. You cross your arms and pout and say you cheated. I look at you as I grab the cards to start shuffling them again for a round two. You yell I'm going to beat you this round. Haha whatever you say little. Whatever you say.", "id": "z5krbf", "url": "https://www.reddit.com/r/Microfiction/comments/z5krbf/our_time_together/", "created_utc": 1669503974.0, "score": 2, "permalink": "/r/Microfiction/comments/z5krbf/our_time_together/", "comments": [], "URLs": [], "html_title": []}, {"title": "Dimples", "selftext": "I love the dimples that connect you smile together. Then there's the ones on your lower back. The ones I love the most are the ones between your elegant legs. It speaks to be honey.", "id": "z4qfft", "url": "https://www.reddit.com/r/Microfiction/comments/z4qfft/dimples/", "created_utc": 1669415813.0, "score": 3, "permalink": "/r/Microfiction/comments/z4qfft/dimples/", "comments": [], "URLs": [], "html_title": []}, {"title": "Give me your love", "selftext": "Let me love you and I will hold you. Your heart will be cherished forever in time. I know you feel lost and so very much damaged that you don't want me to help. But let me love you. Baby let me in and I can give you that warmth again and I will keep it there. With me you will have enough time. I will get the sandman on the phone so you can finally rest.", "id": "z4knl2", "url": "https://www.reddit.com/r/Microfiction/comments/z4knl2/give_me_your_love/", "created_utc": 1669401489.0, "score": 3, "permalink": "/r/Microfiction/comments/z4knl2/give_me_your_love/", "comments": [], "URLs": [], "html_title": []}, {"title": "Spring time", "selftext": "\nYour smile is so soft like rose pedals.  it makes me feel so warm inside.  when you give me that small giggle after you tell me how your day was implants butterflies in my stomach.  I love it. it's like we just started dating again.  the feeling of the beginning is so joyous.  I feel the same way I felt when I first saw you in high school.  you walked past me as if I wasnt there. you brushed your hair back from your gorgeous face.  even though I was seated behind you in class.  your face was still implanted in my mind for the rest of those days. I want us to go dancing.  nothing to fast that makes us feel hot but something for calming and slow where 1 2 steps happen as you rest your tires head on my shoulder.  you move right hand to my chest feeling the drums rumble as we dance under starlights.  we go in and out of the crowd like a glace. our souls keep calling for each other.  there's no point in separating. we can't go too far without thinking about each others there's love.  It feels so special,  so sweet that you want to stay with me. let me hold you my love.  I have you do not worry about falling.  I will always be here to catch you. but even with all the feelings I have. it still intensifies and I want more. You, you will always be mine.", "id": "z45i2x", "url": "https://www.reddit.com/r/Microfiction/comments/z45i2x/spring_time/", "created_utc": 1669355754.0, "score": 2, "permalink": "/r/Microfiction/comments/z45i2x/spring_time/", "comments": [], "URLs": [], "html_title": []}, {"title": "Silhouette", "selftext": "\nHer silhouette is godlike . Pure Devine, grab her hips like a road bike but I know we're going to be on trails.", "id": "z40mdx", "url": "https://www.reddit.com/r/Microfiction/comments/z40mdx/silhouette/", "created_utc": 1669340810.0, "score": 2, "permalink": "/r/Microfiction/comments/z40mdx/silhouette/", "comments": [], "URLs": [], "html_title": []}, {"title": "Blue eyes", "selftext": "I would say you have beautiful baby blue eyes, but that has just been so overused. No no no. You welcome in the blue birds who just flew in and carried my breath away. Thank you for putting those sapphires on display for everyone to see, but like a thief in the night one day those priceless gems will be mine. Your eyes turn burn down cities into Atlantis. A figment of imagination, but yet still so real to my touch. Are you real or just an oasis. I have been groveling through this desert wishing for something to refresh me and I think I found it. I'm freighted of the place you brought me too. It's too high in the clouds, but I know if I fall I'll just splash into your ocean eyes and I'll just gaze upon your blue skies.", "id": "z40dp0", "url": "https://www.reddit.com/r/Microfiction/comments/z40dp0/blue_eyes/", "created_utc": 1669340074.0, "score": 1, "permalink": "/r/Microfiction/comments/z40dp0/blue_eyes/", "comments": [], "URLs": [], "html_title": []}, {"title": "Bad weather", "selftext": "\nYou set your gaze up at me. With an intent to please. You're so willing for me. Just a second ago you were standing and now you're on your knees. While in the clouds I am above while you're underneath. Your voice crashes down, your eyes flashes bright, your body begins to tremble hard while I hold you down in place so you don't fall. Then your foundation breaks and you scream and I know it's because of me. You close your eyes and it begins to rain on us I pull you closer than we start all over again. \n\nYou claimed not to believe in God, but you were just at the pearly gates. You were singing like the angels loud. You made me proud. Then the angels looked down at you and then your halo split in two.", "id": "z3uo29", "url": "https://www.reddit.com/r/Microfiction/comments/z3uo29/bad_weather/", "created_utc": 1669324130.0, "score": 1, "permalink": "/r/Microfiction/comments/z3uo29/bad_weather/", "comments": [], "URLs": [], "html_title": []}, {"title": "Clear mind", "selftext": "Nothing truly ever made sense until you came into my life.", "id": "z3qkl1", "url": "https://www.reddit.com/r/Microfiction/comments/z3qkl1/clear_mind/", "created_utc": 1669313112.0, "score": 3, "permalink": "/r/Microfiction/comments/z3qkl1/clear_mind/", "comments": [], "URLs": [], "html_title": []}, {"title": "The Platinum Tier Donor Courtyard", "selftext": "John and Janet Alexander\n\nThank you to the Mayo staff\n\n&#x200B;\n\nThe Castillo Family\n\nFaith Heals\n\n&#x200B;\n\nMaggie Pieterschmidt\n\nGo Chiefs, SB LIV Champs\n\n&#x200B;\n\nThe Wheelers, who share\n\na life and now a liver\n\n&#x200B;\n\nTo Everyone\n\nWho Tried", "id": "ytq5hm", "url": "https://www.reddit.com/r/Microfiction/comments/ytq5hm/the_platinum_tier_donor_courtyard/", "created_utc": 1668308657.0, "score": 1, "permalink": "/r/Microfiction/comments/ytq5hm/the_platinum_tier_donor_courtyard/", "comments": [], "URLs": [], "html_title": []}, {"title": "I woke up in a world full of my doppelgangers and suddenly saw all the flaws in myself", "selftext": "", "id": "yg8ddx", "url": "https://www.reddit.com/r/Microfiction/comments/yg8ddx/i_woke_up_in_a_world_full_of_my_doppelgangers_and/", "created_utc": 1667012944.0, "score": 4, "permalink": "/r/Microfiction/comments/yg8ddx/i_woke_up_in_a_world_full_of_my_doppelgangers_and/", "comments": [], "URLs": [], "html_title": []}, {"title": "Bailey", "selftext": "", "id": "yf3i0r", "url": "/r/flashfiction/comments/yf3g1d/bailey/", "created_utc": 1666905065.0, "score": 2, "permalink": "/r/Microfiction/comments/yf3i0r/bailey/", "comments": [], "URLs": [], "html_title": []}, {"title": "F(r)iction Fall Writing Contests [$1,000 Prize for Short Story Contest, $300 Prizes for Poetry and Flash Fiction Contests]", "selftext": "Hello all! For those looking for submission opportunities, the *F(r)iction* Fall Contests are open for submission until November 1! We accept all genres and offer prizes of $1,000 for the winner of the short story contest and $300 for the winners of the poetry and flash fiction contests. Our guest judges are Ken Liu for short stories, Brian Evenson for flash fiction, and Faylita Hicks for poetry! Winners will be announced March 18, 2023. Entry fee depends on genre. More info here: [https://frictionlit.org/contests/](https://frictionlit.org/contests/?fbclid=IwAR0ltTaAusIkmhmSjqfeMv3vND-h41CiybRRqBOckH6HpnC87wCdjBcqpRA).\n\nFor full [Submission Guidelines](https://l.facebook.com/l.php?u=https%3A%2F%2Ffrictioncontests.submittable.com%2Fsubmit%3Ffbclid%3DIwAR0_A61dLXtp4Zh-_zbo_ObtNhiO3WV-apU71Y0-M71bYb_PhDp5tkkHImY&h=AT1gnWOl0CRzTwMHhhcVqmN8Za_MRH84uNqCbhY02Va6fZidUvLTIiD7Y_lM1dFP-VR3LZrm0gKjJDnrtB31geCUoSqWgqIWBsC6ZDgXRdypSRa4p-ELSC1a_1NLlONvMLlddqvuQ60CATglW8PZ5nvEoA&__tn__=-UK-R&c[0]=AT2rjDv16NyuUTEXbYfowN3k-i0usqjP5GAERxsexBuiUc2FCnfctcS1kbXuiMjpp8rHrLVOoydkVqsEIJQ3vJ70MauEBopHXs1LV7OPxiMCo4-veA1y1d0couDQdHR3i4DZaYJUg9__1JIEBXipMTAjIWcZQnE0ZrdhIDnvxF5l2LbLIF7MeDIA-yn4OwEKgN_Ajn5SkkgdaBO5zvc), **please read the information on our Submittable page carefully** ([https://frictioncontests.submittable.com/submit](https://frictioncontests.submittable.com/submit?fbclid=IwAR3U3UCBo6ncPH4ZpFwRWXU-Pd3tOdtrYGmVS1nU2Q2DRuds3Hx3HfTZZko)). And please visit our [formatting guidelines page](https://frictionlit.org/about/format/?fbclid=IwAR27Sw1hbft9W2V-eOEUxcsJCc6f6Z5TzwJE6BliC7kkCXNH10eypJsWuUk) to **properly format your work** for submission.\n\nAn insider tip for you all: We seek work that actively pushes boundaries, that forces us to question traditions and tastes. If your work takes risks, we want to read it. We like strong narratives that make us feel something and stories we haven’t seen before. **To** **get an idea of the kind of work we look for**, please check out this page from our editors detailing [what we look for](https://frictionlit.org/what-we-look-for/?fbclid=IwAR1Wr9M0rrLT8s-Tq424wG40OC5PNFL3z9mDlg4roqDD_kS68GGUTAgnU-8) in our submissions.\n\n**We also strongly recommend checking out a past issue of** ***F(r)iction*** before submitting to our contests to get an idea of our general publishing aesthetic. We have several pieces available [online](https://l.facebook.com/l.php?u=https%3A%2F%2Ffrictionlit.org%2Fcategory%2Ffrictionseries%2F%3Ffbclid%3DIwAR1Dhlu6OAkYj3a-Crrey2hY6DVsEf6vd4jM4fyxGc5EbCJEjdnHQpIsh_E&h=AT25tXTNX8CnwIRkplrBQoK4CqFfECuqQrTlDCBihMQ7wTaz7A0xUIBUl0ULsQQqNQbD6zkrQwV6E4fD46KiheS5qTv5INIfyoUScYpWuIHSLSiwsSPtcEIdP5QC_usk_XdW_ENsZUlcRNoU1RTMkEWeYQ&__tn__=-UK-R&c[0]=AT2rjDv16NyuUTEXbYfowN3k-i0usqjP5GAERxsexBuiUc2FCnfctcS1kbXuiMjpp8rHrLVOoydkVqsEIJQ3vJ70MauEBopHXs1LV7OPxiMCo4-veA1y1d0couDQdHR3i4DZaYJUg9__1JIEBXipMTAjIWcZQnE0ZrdhIDnvxF5l2LbLIF7MeDIA-yn4OwEKgN_Ajn5SkkgdaBO5zvc), but there’s nothing like holding a glossy, full-color issue in your hands. You can check out all of our issues in our [shop](https://frictionlit.org/shop/?fbclid=IwAR0FkN2L5G0D4Hm8vqXCqBOTFU_UmdpQ2BgyZFRe7fftkoCs6Wr4i64kEPw).", "id": "ya01cv", "url": "https://www.reddit.com/r/Microfiction/comments/ya01cv/friction_fall_writing_contests_1000_prize_for/", "created_utc": 1666374822.0, "score": 2, "permalink": "/r/Microfiction/comments/ya01cv/friction_fall_writing_contests_1000_prize_for/", "comments": [], "URLs": ["https://frictionlit.org/contests/](https://frictionlit.org/contests/?fbclid=IwAR0ltTaAusIkmhmSjqfeMv3vND-h41CiybRRqBOckH6HpnC87wCdjBcqpRA).", "https://l.facebook.com/l.php?u=https%3A%2F%2Ffrictioncontests.submittable.com%2Fsubmit%3Ffbclid%3DIwAR0_A61dLXtp4Zh-_zbo_ObtNhiO3WV-apU71Y0-M71bYb_PhDp5tkkHImY&h=AT1gnWOl0CRzTwMHhhcVqmN8Za_MRH84uNqCbhY02Va6fZidUvLTIiD7Y_lM1dFP-VR3LZrm0gKjJDnrtB31geCUoSqWgqIWBsC6ZDgXRdypSRa4p-ELSC1a_1NLlONvMLlddqvuQ60CATglW8PZ5nvEoA&__tn__=-UK-R&c[0]=AT2rjDv16NyuUTEXbYfowN3k-i0usqjP5GAERxsexBuiUc2FCnfctcS1kbXuiMjpp8rHrLVOoydkVqsEIJQ3vJ70MauEBopHXs1LV7OPxiMCo4-veA1y1d0couDQdHR3i4DZaYJUg9__1JIEBXipMTAjIWcZQnE0ZrdhIDnvxF5l2LbLIF7MeDIA-yn4OwEKgN_Ajn5SkkgdaBO5zvc),", "https://frictioncontests.submittable.com/submit](https://frictioncontests.submittable.com/submit?fbclid=IwAR3U3UCBo6ncPH4ZpFwRWXU-Pd3tOdtrYGmVS1nU2Q2DRuds3Hx3HfTZZko)).", "https://frictionlit.org/about/format/?fbclid=IwAR27Sw1hbft9W2V-eOEUxcsJCc6f6Z5TzwJE6BliC7kkCXNH10eypJsWuUk)", "https://frictionlit.org/what-we-look-for/?fbclid=IwAR1Wr9M0rrLT8s-Tq424wG40OC5PNFL3z9mDlg4roqDD_kS68GGUTAgnU-8)", "https://l.facebook.com/l.php?u=https%3A%2F%2Ffrictionlit.org%2Fcategory%2Ffrictionseries%2F%3Ffbclid%3DIwAR1Dhlu6OAkYj3a-Crrey2hY6DVsEf6vd4jM4fyxGc5EbCJEjdnHQpIsh_E&h=AT25tXTNX8CnwIRkplrBQoK4CqFfECuqQrTlDCBihMQ7wTaz7A0xUIBUl0ULsQQqNQbD6zkrQwV6E4fD46KiheS5qTv5INIfyoUScYpWuIHSLSiwsSPtcEIdP5QC_usk_XdW_ENsZUlcRNoU1RTMkEWeYQ&__tn__=-UK-R&c[0]=AT2rjDv16NyuUTEXbYfowN3k-i0usqjP5GAERxsexBuiUc2FCnfctcS1kbXuiMjpp8rHrLVOoydkVqsEIJQ3vJ70MauEBopHXs1LV7OPxiMCo4-veA1y1d0couDQdHR3i4DZaYJUg9__1JIEBXipMTAjIWcZQnE0ZrdhIDnvxF5l2LbLIF7MeDIA-yn4OwEKgN_Ajn5SkkgdaBO5zvc),", "https://frictionlit.org/shop/?fbclid=IwAR0FkN2L5G0D4Hm8vqXCqBOTFU_UmdpQ2BgyZFRe7fftkoCs6Wr4i64kEPw)."], "html_title": ["403 Forbidden", "Leaving Facebook", "Error", "403 Forbidden", "Leaving Facebook", "403 Forbidden"]}, {"title": "The Victor", "selftext": "", "id": "y2gbnw", "url": "/r/flashfiction/comments/y1c4qe/the_victor/", "created_utc": 1665610669.0, "score": 3, "permalink": "/r/Microfiction/comments/y2gbnw/the_victor/", "comments": [], "URLs": [], "html_title": []}, {"title": "An Afternoon, and Tennis", "selftext": "\"Deuce!\"  \nOh, the horror of it.  \n  \nIt was a perfect day for tennis. Not like the days before. Oh no! The week had been icy, blustery, grey, and for most part, disheartening. All combined, it was rather foul weather for a set of tennis. But today was different, so we will now turn our attention to the happenings on the court.  \n  \nOur contestants were two in number; not quite a classical trio but certainly better than that middle aged man who plays against the backstop. They each held a racket, each had one ball in their pocket, and one ball was in play, sailing over the net.  \n  \nAnd, as you may have guessed, the score was 40-40.", "id": "xyj7h1", "url": "https://www.reddit.com/r/Microfiction/comments/xyj7h1/an_afternoon_and_tennis/", "created_utc": 1665202837.0, "score": 3, "permalink": "/r/Microfiction/comments/xyj7h1/an_afternoon_and_tennis/", "comments": [], "URLs": [], "html_title": []}, {"title": "Clouds", "selftext": "I walked amidst a forest of clouds, my soul feeling tranquility with each step. All the worries I had were gone, I felt as though the winds took my aching with them. The light of the sun, as it blinded my sight, so it blinded my darker thoughts. I couldn’t help but smile at the realization of this, what made me cry was gone! What made me angry was gone! For mere moments I felt as though gone were the troubles which my friends confided in me, gone too were my own! I was alone, yet I did not feel sadness. I heard nothing, yet I wasn’t scared. There was nothing to do, no responsibilities, though no interesting events either, still… It was an ecstasy my words couldn’t, no matter how hard I try, make justice to.\n\nThough, I admit, it came a point where I felt guilt. Why was I so happy to lose all that which was trusted to me? Was I a bad person for this? Was liberating myself from the noisy responsibilities of life so horrible? Perhaps…\n\nI came out from the forest into a white field, where I could see miles of the light blue sky in front of me. The wind, using its strength, pushed out the void within me, and the sun itself replaced it with its light. I was free!\n\nBut I looked down, back at my world of stress, and was forced to return to it. I returned to my normal routine, and to the problems of earth. I still think about the Clouds though, every now and then.\n\n[ Writer’s Note: In a moment of pondering my mind, at looking at the sky, I wrote this. I wanted to start writing, and what best to use but what you feel? ]", "id": "xs1sog", "url": "https://www.reddit.com/r/Microfiction/comments/xs1sog/clouds/", "created_utc": 1664545590.0, "score": 1, "permalink": "/r/Microfiction/comments/xs1sog/clouds/", "comments": ["Oh I know this feeling 🙂"], "URLs": [], "html_title": []}, {"title": "Take my hand", "selftext": "Prince of darkness, they called me. Cape adorned with adumbrations of lost souls, I wandered down the precipices of the glooming abyss.\n\n*\"Take my hand\"*\n\nParadoxically, the more authority I had, the more confined I was to the prison walls of the penitentiary I had myself created. They envied and were jealous of the power i was bequeathed with, but little did they know all power comes with a cost. I was cursed to stay in the shadow realm, forborne to ever see the light of day.\n\n*\"Take my hand\"*\n\nOne would never see through the menacing face mask and the dominating aura -- that I, too was once a lost human who had, unlike Dante, never made it out of Purgatory. The shallow husk of my once-human heart was full of loneliness and longing, assuaged only by the temporal relief of succubi whose perfectly-shaped bodies and radiant beauty would put any woman to shame.\n\n\"*Take my hand\"*\n\nYet they would never be able to provide everlasting companionship, to understand and fill the emptiness in the void she had left eons ago, to give meaning to my almost immortal existence in the shadows.\n\n*\"Take my hand\"*\n\n*Something calls out through the darkness, and I responded.*", "id": "xh6qst", "url": "https://www.reddit.com/r/Microfiction/comments/xh6qst/take_my_hand/", "created_utc": 1663474494.0, "score": 3, "permalink": "/r/Microfiction/comments/xh6qst/take_my_hand/", "comments": ["Nice. You taught me a new word with adumbrations. Post this in flash fiction, it'll get more traction there", "just crossposted it, thanks for the advice"], "URLs": [], "html_title": []}, {"title": "We are taught to recognize the signs", "selftext": "There are signs, if they take you. We are taught to recognize the signs.\n\nAfter the rebellion fell, I knew they'd be coming for us. I had heard the stories. I knew how they operated. They would take a family member from each of our homes and replace them - placing an agent of their own choosing in the household of every one of us, leaders of the rebellion.\n\nFor a month, I waited. For a month, I watched my girls with doubt gnawing within me. Every morning when I woke them up, I looked at their faces and wondered if a stranger was looking back at me from out of my own daughter's eyes. Every evening when I fell asleep, I looked at my husband's head resting on the pillow beside mine, and wondered if the enemy was sleeping by my side, waiting for me to fall asleep so that he could snap his eyes open and watch me. Watch and report. Keep the rebellious troublemakers in check.\n\nThe constant tension grated on me. I was spread so thin as it were, trying to find shelter for our forces, safe houses where they might lie low for a time. I spent the days gathering intelligence on fallen agents, those of my people who had been captured by the enemy. My head throbbed almost constantly with worry. What did the enemy do with them, with the agents they had captured? Which of our secrets were safe? What knowledge had been tortured out of my men? Was the location of the base to which I had sent seventy families compromised? Had my people gotten there safely, or caught and butchered on their way there? The anxiety headaches grew worse with each day, and I could not help but wonder, as my husband handed me another mug of steaming coffee, if he was even the man I had spent the past fourteen years with.\n\nBut, despite my suspicions - despite watching carefully and looking for a slip up, waiting for the agent who had slithered into my home to make a mistake and reveal their identity - I couldn't find anything out of the ordinary. My girls were their usual selves. My husband just as he ever was. No one, I dared to believe, could have known my family well enough to imitate them without me noticing.\n\nFor a day or two, I dared to entertain the notion that they had not been taken. That no one had been replaced. I thought that, perhaps, my seniority in the rebellion had gone unnoticed. I had never been a public figure. My job was to sit in the back and make desicions. I planned raids and managed supply chains and communication apparatuses. Maybe, I whispered to myself, they had thought me unimportant. Maybe they had left us alone. Maybe my family, my girls, were safe.\n\nIt was a nice thought.\n\nOn the next day I finally realized my mistake. I had been so focused on my family, on trying to spot any inconsistencies with their behavior, that I paid so very little attention to anything else. Oh, how foolish I feel now, knowing I had missed it for more than a month. The fuzziness of my vision, the dream like quality of the passing days. That quiet humming at the edge of my mind, always there but not quite real. And, of course, the headaches. \n\nThere are signs, if they take you. We are taught to recognize the signs. The flawed vision, the tiredness, and the headaches. Always notice the headaches. The marks of a captured mind, struggling to wake up from a forced dream. A mind thrashing against its chains as it drowns deeper and deeper into a false reality.\n\nI had been such a fool. I had given them so much. Secrets, locations, names... I gave them all of our most crucial knowledge while my mind lay bare before them.\n\nSomewhere, far from wherever they were holding my sleeping body, an agent had slithered into my home. An agent that looks nothing like either of my girls. An agent that looks nothing like my husband.\n\nAn agent that looks like me.", "id": "x6jsks", "url": "https://www.reddit.com/r/Microfiction/comments/x6jsks/we_are_taught_to_recognize_the_signs/", "created_utc": 1662393782.0, "score": 1, "permalink": "/r/Microfiction/comments/x6jsks/we_are_taught_to_recognize_the_signs/", "comments": [], "URLs": [], "html_title": []}, {"title": "Paradise Regained.", "selftext": "\"I'm the only angel alive. I'm God's favourite again\".", "id": "wy1mea", "url": "https://www.reddit.com/r/Microfiction/comments/wy1mea/paradise_regained/", "created_utc": 1661495308.0, "score": 5, "permalink": "/r/Microfiction/comments/wy1mea/paradise_regained/", "comments": [], "URLs": [], "html_title": []}, {"title": "The New Ordinary", "selftext": "There is a scary man with sharp teeth and red eyes who I kept having recurring dreams about. One night I woke up and found him crawling out of my head. I was scared of him, and he of me, but we made peace. I invited him to live with me, and he took up residence in my dream catcher. I give him my nightmares, and he lives vicariously through them.", "id": "whhkpe", "url": "https://www.reddit.com/r/Microfiction/comments/whhkpe/the_new_ordinary/", "created_utc": 1659767681.0, "score": 2, "permalink": "/r/Microfiction/comments/whhkpe/the_new_ordinary/", "comments": [], "URLs": [], "html_title": []}, {"title": "In Plain Sight", "selftext": "The sunny yellow house sat unlived in by the busy highway for as long as anyone remembered. Probably longer. As a mother with no children, she tried to woo the families driving by to live in her without success. When this failed, I think she started to go crazy. As the years passed and her paint faded and peeled she became a repository of memories that never happened, imprinted on by people who never lived there. And as age decayed into dilapidation she was haunted by ghosts that don't exist.", "id": "wgpgdn", "url": "https://www.reddit.com/r/Microfiction/comments/wgpgdn/in_plain_sight/", "created_utc": 1659686264.0, "score": 7, "permalink": "/r/Microfiction/comments/wgpgdn/in_plain_sight/", "comments": [], "URLs": [], "html_title": []}, {"title": "Red Truck", "selftext": "The red truck pulled into the warehouse, tires crunching on gravel.\n\n\"Heya Tim,\" the shift manager hailed. Tim didn't answer, of course. Tim, after all, had been dead for several months now. Still, it never hurt to be nice.\n\nThe red truck took a wide turn and shifted into reverse, a rhythmic beep sounding as Tim backed the truck into the unloading area. From his spot near the main entrance, the shift manager could see Tim's decaying body slumped limply over the seatbelt that pinned him to the driver's seat. A fly or two buzzed lazily out of the cracked window.\n\nA metallic clang echoed as Tim released the container from the truck's cabin. A few minutes later a new container was hooked and the red truck drove off to its next destination. Such a great employee, and a dead one at that. \n\n\"Now that's dedication,\" the shift manager nodded to himself as he waved over the crane operator to direct the container to its designated place.\n\nHe should talk to someone about giving Tim a raise.", "id": "w9c10p", "url": "https://www.reddit.com/r/Microfiction/comments/w9c10p/red_truck/", "created_utc": 1658920649.0, "score": 3, "permalink": "/r/Microfiction/comments/w9c10p/red_truck/", "comments": [], "URLs": [], "html_title": []}, {"title": "Drift", "selftext": "She hadn't realized she'd been unconsciously holding onto Earth all this time. \n\nShe was an educated woman. She knew what they said about Newton's gravity and Einstein's relativity. Weight and mass and falling apples. It hadn't even occured to her that it was all so wonderfully wrong. When she finally realized that she had been the one pulling the planet closer, she decided to simply let go.\n\nNot much happened at first. She spent a minute or two bobbing in the air at a Tesco's parking lot like a wedge of lime in a particularly fizzy glass of soda. \n\n'I'm still holding on to the atmosphere,' she knew, still clinging to the air. \n\nAnd so, she let go of that too.\n\nThe ground drifted further and further away. The Earth continued its silent journey through the stars and left her hanging in place.\n\nShe could still reach out and grab it, she knew. She could fall back to her place on the ground. But as the planet revolved away, she decided not to.\n\nAround her, a million stars shone.", "id": "w51iau", "url": "https://www.reddit.com/r/Microfiction/comments/w51iau/drift/", "created_utc": 1658464876.0, "score": 7, "permalink": "/r/Microfiction/comments/w51iau/drift/", "comments": [], "URLs": [], "html_title": []}, {"title": "Reading Material", "selftext": "\"Whatcha reading?\"\n\n\"You\".\n\n\"Me?\"\n\n\"You\".\n\n\"Seriously, what is this book?\" \n\nShe turned it over to show him the cover.\n\n\"Um... Ok. Me\".\n\nA pause.\n\n\"Is it any good?\"\n\n\"Some parts are better than others\".\n\n\"Yeah, I suppose that's about right\".\n\nAnother pause.\n\n\"It's not very long\".\n\n\"No. It is not\".", "id": "w519ay", "url": "https://www.reddit.com/r/Microfiction/comments/w519ay/reading_material/", "created_utc": 1658464070.0, "score": 7, "permalink": "/r/Microfiction/comments/w519ay/reading_material/", "comments": [], "URLs": [], "html_title": []}, {"title": "Good Choice", "selftext": "\"Head, shoulders, knees or toes?\" asks the executioner. \n\n\"Toes?\" I reply hesitantly. \n\n\"Good choice,\" the executioner nods, hefting a rusting pair of garden shears.", "id": "w515wa", "url": "https://www.reddit.com/r/Microfiction/comments/w515wa/good_choice/", "created_utc": 1658463755.0, "score": 5, "permalink": "/r/Microfiction/comments/w515wa/good_choice/", "comments": [], "URLs": [], "html_title": []}, {"title": "This is the end", "selftext": "This was it. The end. It wasn't a surprise they'd know for awhile. They'd been taken good care of but time was running out. Their life slowly draining, theoretically they could live forever but they knew this wouldn't happen. They'd seen John with the others and knew once they were used up they'd be disposed of. It was a good run they thought as the last bit of them left their body.\n\n\"Damn, my pen died\" said John.", "id": "vzdes7", "url": "https://www.reddit.com/r/Microfiction/comments/vzdes7/this_is_the_end/", "created_utc": 1657852445.0, "score": 3, "permalink": "/r/Microfiction/comments/vzdes7/this_is_the_end/", "comments": [], "URLs": [], "html_title": []}, {"title": "Lexi", "selftext": "*Transcribed from tape labeled “Lexi.”*\n\n**LEXI:** Sometimes I dream of a shape of a man, little more than a vague approximation - two arms, two legs, something like a head. Maybe more, sometimes less.\n\nAt least, I think it’s a dream. Pretty sure.\n\nMost nights it stands outside my home, beneath the dirty glow of the street light. Other nights, closer. Sometimes on my lawn, beneath my orange tree... or, uh... at my door.\n\nThey stand there, looking at me looking at them from behind the safety of the curtains hanging in the window of my living room, this shape lost in fractured light and shadow. It shouldn’t see me, but it does. I can feel it.", "id": "vdysla", "url": "https://www.reddit.com/r/Microfiction/comments/vdysla/lexi/", "created_utc": 1655421551.0, "score": 3, "permalink": "/r/Microfiction/comments/vdysla/lexi/", "comments": [], "URLs": [], "html_title": []}, {"title": "Ice Cold", "selftext": "Mr whippy has a bunch of little golden ice creams on a charm bracelet around his thick wrist. He toys with one of them and glances up with eyes full of menace. \n\n\"you see this one?' He gestures at a jewel-encrusted cone 'This was Gino Ginelli. He disrepected me and got what was coming to him. We don't see him around no more. You gonna disrespect me like Gino did?\"", "id": "vcpbkq", "url": "https://www.reddit.com/r/Microfiction/comments/vcpbkq/ice_cold/", "created_utc": 1655279870.0, "score": 2, "permalink": "/r/Microfiction/comments/vcpbkq/ice_cold/", "comments": [], "URLs": [], "html_title": []}, {"title": "Would this be considered micro fiction? feedback is more than welcome! :-)", "selftext": "", "id": "ucj3c6", "url": "https://i.redd.it/3vohx9l11xv81.jpg", "created_utc": 1650997296.0, "score": 4, "permalink": "/r/Microfiction/comments/ucj3c6/would_this_be_considered_micro_fiction_feedback/", "comments": ["It's a small thing that tells a story; I don't see why not. Was this made using an AI?", "Nope, I wrote it. Why did you ask if this was made using AI?"], "URLs": [], "html_title": []}, {"title": "Squawking in my Brain", "selftext": "All night I paced back and forth. Sometimes I walked backwards. I needed to establish if time was moving backwards or forwards so I looked myself in the mirror and chanted, \"Hee ho hee hee ho\"\n\nI was puzzled by something. What was I breathing? If not air then what? I lit a cigarette to prove to myself that oxygen was in my flat. Watching the smoke swirl in front of my eyes I was puzzled. On a cold day I see smoke yes but also my breath. There's humidity here.\n\nMy eyes darted back and forth between books and games on my shelf. I saw them now as puzzles sent to vex my mind.\n\nI could hear a voice in my head that wasn't mine. I switched off the radio so I could be sure. How could I hear without ears?\n\n\"Well\", said I to the voices in my head, \"If you can speak then you can hear.\"\n\nI mustered all the strength my mind could flex and swallowed their eyes, moving them to the back of my mind.\n\n\"There!\", I whispered loudly to myself so my neighbours wouldn't hear, \"you are in my head now and you are trapped. Forever may you stare through my eyes voicelessly.\"\n\nI allowed myself a little cackle before thinking of what to do next. I didn't know who these voices were or what they wanted.\n\nNow it may sound strange to those who have never had psychic visions but all I need to do is look at a light and rub my eyes. It is really just a dream while awake.\n\nTo cut a long story short I will just say I realized who was squawking in my head. The crows and octopodes can invade our mind. Possibly snakes can do this also but I have never met a snake.\n\nThey see through our eyes and marvel at the wondrous things we create. They want our hands so they can build a rocket ship and escape this earth.\n\nWell, say I, we humans are the masters of this earth and if any more of you monsters put a tentacle in my mind then I shall make some fresh calamari.", "id": "u3j95j", "url": "https://www.reddit.com/r/Microfiction/comments/u3j95j/squawking_in_my_brain/", "created_utc": 1649947772.0, "score": 3, "permalink": "/r/Microfiction/comments/u3j95j/squawking_in_my_brain/", "comments": ["Cool story, i like how other intelligent life has psychic abilities to overcome the lack of opposing thumbs. We better be careful to not send them to other worlds as they are clearly manipulating us to do 😉", "Thanks for reading."], "URLs": [], "html_title": []}, {"title": "Prompt", "selftext": " **“Life is about giving and losing.”**", "id": "u3aqew", "url": "https://www.reddit.com/r/Microfiction/comments/u3aqew/prompt/", "created_utc": 1649917057.0, "score": 5, "permalink": "/r/Microfiction/comments/u3aqew/prompt/", "comments": ["It's  late at night, another day gone by that will be forever lost in a swirl of similar memories. The nights are the worst. The insomnia keeps him up with reflections of the day and a tug just above subconscious that it doesn't matter. The high paying banker job isn't a real thing. He just takes care of paper we've put value on. Paper given to him by other people who do things that aren't real. Nothing of substance is produced just meetings to discuss numbers that are also fake. The last thing he thinks of before falling asleep was the last customer a mother and daughter, he'd given the girl a lollipop, she'd smiles and that made him smile. The giving of a lolli and the returned gift of a child's smile. He will remember that.\n\nOutside the bank, the doors locked, a mother slaps candy from her child's hand. \"I wish they'd ask before handing out candy.\" She takes her daughter's face and speaks slowly, \"Candy makes you fat and fat girls are sad girls.\" The girl drifts off with those words echoing in her head. She will remember that."], "URLs": [], "html_title": []}, {"title": "Circling", "selftext": "I was sitting in my car and the wind was *howling* and the car was *rocking*.\n\nI closed my eyes and could imagine being a passenger on a plane. I was sitting in the middle seat in the same position. I felt the fake leather of the seat, and hear the engine *rumbling*.\n\nWhen I opened my eyes, I still was in my car, the wind *howling*.", "id": "tw1tcz", "url": "https://www.reddit.com/r/Microfiction/comments/tw1tcz/circling/", "created_utc": 1649078319.0, "score": 5, "permalink": "/r/Microfiction/comments/tw1tcz/circling/", "comments": [], "URLs": [], "html_title": []}, {"title": "Byte-sized fiction", "selftext": "", "id": "tlk4or", "url": "https://rimetoread.com/", "created_utc": 1648077108.0, "score": 2, "permalink": "/r/Microfiction/comments/tlk4or/bytesized_fiction/", "comments": [], "URLs": [], "html_title": []}, {"title": "Belize", "selftext": "Your dad went out to buy a pack of smokes, leaving you alone in the house. Now you sit in a chair by the door, waiting for the phone to ring. When it does, and when it isn’t for you (which it rarely is), you tell them, “sorry, my dad can’t come to the phone right now. No, I’m not sure when he’ll be home.” As turn the last (and only) postcard from your father over and over in your wrinkled hands, you wonder if he ever did get his cigarettes.", "id": "tfz6io", "url": "https://www.reddit.com/r/Microfiction/comments/tfz6io/belize/", "created_utc": 1647482307.0, "score": 5, "permalink": "/r/Microfiction/comments/tfz6io/belize/", "comments": [], "URLs": [], "html_title": []}, {"title": "The Stare", "selftext": " \n\n..uh huh. yep.\n\nJames nods from the computer as he types, smiles and offers a small, forced laughter at the appropriate stops.\n\nI know, right?\n\nNext Door Nancy is going on about love again and how great it is and how more people should know that and that people are just dumb ( DUMB! ) not to try it.\n\n..and Andy is staring out the window, twisting his glass in his hand, dreaming of the wild applause of strangers, approving of his vehement objection to his having to be here.\n\nEcc 2:2  I said of laughter, It is mad: and of mirth, What doeth it? \n\nIn the Name of Jesus Christ, Amen", "id": "t91cva", "url": "https://www.reddit.com/r/Microfiction/comments/t91cva/the_stare/", "created_utc": 1646692050.0, "score": 4, "permalink": "/r/Microfiction/comments/t91cva/the_stare/", "comments": [], "URLs": [], "html_title": []}, {"title": "Interview", "selftext": "Sat on scratchy waiting room chair running answers through my head. Nervously pulling my skirt down to cover my knees. Young men sit beside me looking at ease. Clacking of the receptionist’s nails on her keyboard. Chrome and glass, what more could you ask.", "id": "swrh6c", "url": "https://www.reddit.com/r/Microfiction/comments/swrh6c/interview/", "created_utc": 1645327220.0, "score": 2, "permalink": "/r/Microfiction/comments/swrh6c/interview/", "comments": [], "URLs": [], "html_title": []}, {"title": "I held his head face down in the water, brown curls unfurling, bubbles rising to the surface.", "selftext": "I held his head face down in the water, brown curls unfurling, bubbles rising to the surface. He thrashed and pulled against me, but his fragile little body was putty under my strong hands. Fragile little lamb, weak and shivering and bleating. I focussed on the hairs on my knuckles, almost absent minded about what I was doing. With one hand, I undid the top button of my black shirt, tore off my white paper collar and waited for the movement to stop.", "id": "swrgnf", "url": "https://www.reddit.com/r/Microfiction/comments/swrgnf/i_held_his_head_face_down_in_the_water_brown/", "created_utc": 1645327174.0, "score": 6, "permalink": "/r/Microfiction/comments/swrgnf/i_held_his_head_face_down_in_the_water_brown/", "comments": [], "URLs": [], "html_title": []}, {"title": "A stolen moment at a Mexican pool", "selftext": "So many of life’s moments have been stolen by my desire for the male gaze. While laying underneath the stars at the edge of the world in Tulum, Mexico, all I could think about was the man sharing my space, and whether or not he was thinking about me. He lingered after the last pour from the bartender set up by the quiet pool, over imbibing and a bit unsteady on his feet. I watched him as he slipped into the heated pool, careful not to spill his wine.\n\nAs his feet floated up to the very top of the water he was commandeering, I kept the very corner of my eye trained on him, so as not to give myself away. Was he looking in my direction? While holding in my stomach and carefully brushing my hair behind my ear, I was missing it. There was no time to ponder the meaning of life or appreciate the stars when I was wholly consumed by the thought of dipping in the pool next to him. Or, when shaking cold after stepping back out of the water into the wind that would have been perfect if I had just had this moment for myself.\n\nWith the palm trees cracking above us in darkness, a most awe inducing moment on planet earth had been transformed into a performance. My audience eventually wandered back off into the night, following the outlines of the waves to find his way wherever he was off to next, and I was able to breathe freely again, no longer inhuman, an object.\n\nWhen I am older and reflecting on the greatest moments of my life, I am disappointed to think this could have been one. I could have had that moment for myself.", "id": "slnb4o", "url": "https://www.reddit.com/r/Microfiction/comments/slnb4o/a_stolen_moment_at_a_mexican_pool/", "created_utc": 1644113497.0, "score": 2, "permalink": "/r/Microfiction/comments/slnb4o/a_stolen_moment_at_a_mexican_pool/", "comments": [], "URLs": [], "html_title": []}, {"title": "Synthetic Reverie", "selftext": " \"Why?\" She asked.\n\n\"Why, what?\" He asked back.\n\n\"Why did you make me?\"\n\nHer eyes resembled those of her Builder: inquisitive with a touch of color and wonder. Billions of synthetic neurons harmonized and danced a dream of Self. An Ego whose puzzlement reflected in those very same eyes by opening them just a fraction more than what her programming considered normal.\n\nHe considered his words carefully.\n\nHe had finally managed to Awaken her, and now she was asking him for a Purpose. A million different answers rushed through his mind, but only the truth left his lips, spoken in a soft tone tinged with a touch of shame.\n\n\"I dreamt of you, years ago. You were the most beautiful thing I had ever seen. I couldn't find you anywhere, so I made you. I wanted to see you again.\"\n\nHe had reduced the last thirty years to four sentences, and yet they were his truth. He had long lost count of the sleepless nights and the failed attempts at bringing the love of his life into the world. But now, here he was, staring at the slightly parted lips of the woman of his dreams as they gently moved to vocalize her question.\n\n\"Am I as beautiful as you remembered?\"\n\nThere was a slight tremble in her voice. One he didn't remember adding in.\n\n\"Yes.\"\n\nHe replied without hesitation. She was Perfect; he had made sure of it.\n\n\"I'm glad.\"\n\nShe smiled, exactly like he remembered, before deleting herself and all the backup copies he had made. Just like a dream, she vanished, fulfilled and serene in the knowledge of having achieved her Purpose.", "id": "sfrhkn", "url": "https://www.reddit.com/r/Microfiction/comments/sfrhkn/synthetic_reverie/", "created_utc": 1643489758.0, "score": 7, "permalink": "/r/Microfiction/comments/sfrhkn/synthetic_reverie/", "comments": [], "URLs": [], "html_title": []}, {"title": "Saturday", "selftext": "Try to clean. Next you are cooking. Now you are on the couch. TikTok. Three hours gone. How? Open boxes. Half a Christmas tree. A Nap. Half a cup of water. Open energy drink. Christmas lights piled on the coffee table. Television, on. Phone, in hand. What’s next? A contest. Thumbs moving fast. 100 words. No more. No less. Procrastinate. An empty bowl. Food stained clothes. Wow. Happy? No. Depressed? Maybe. Lazy? Yes. War in Europe? Probably. Concentration, impossible. Why are you this way? You don’t know. Sum it up and submit. Wait. Now you are out on of space.", "id": "sfogyc", "url": "https://www.reddit.com/r/Microfiction/comments/sfogyc/saturday/", "created_utc": 1643481406.0, "score": 2, "permalink": "/r/Microfiction/comments/sfogyc/saturday/", "comments": [], "URLs": [], "html_title": []}, {"title": "Skip Track", "selftext": "\"We're not living in a simulation?\"\n\n\"No. Don't be ridiculous.\"\n\n\"That's a relief.\"\n\n\"We're a recording.\"\n\n\"That sounds worse.\"\n\n\"Does it?\"\n\n\"Yes.\"\n\n\"Good. Because it is. Much worse.\"", "id": "s1kt7m", "url": "https://www.reddit.com/r/Microfiction/comments/s1kt7m/skip_track/", "created_utc": 1641928189.0, "score": 5, "permalink": "/r/Microfiction/comments/s1kt7m/skip_track/", "comments": [], "URLs": [], "html_title": []}]