[{"title": "My friends and I have the same thoughts", "selftext": "I have a friend group on snapchat. This group has my crush and my other friend in it, we call almost everyday and we had a good time! Till one time… it was a Friday, we were texting and for some reason we let all our thoughts out of how we were depressed, drained, tired, and sad. It got to the point were I said anyone wanna come too my funeral? I’m so proud we are all friends I could tell them anything, things we can’t even tell our therapists.", "id": "1468f3a", "url": "https://www.reddit.com/r/ShortSadStories/comments/1468f3a/my_friends_and_i_have_the_same_thoughts/", "created_utc": 1686424278.0, "score": 0, "permalink": "/r/ShortSadStories/comments/1468f3a/my_friends_and_i_have_the_same_thoughts/", "comments": [], "URLs": [], "html_title": []}, {"title": "The one time Anubis cried", "selftext": "There I was, 3rd in line at the final trial in front of 8 billion, midnight black roses in hand, passing through the trials of redemption to enter the afterlife. I saw one soul enter. I cried and my tears floated in the sky like globules of water in zero g. With their rupture came gleaming light that shows why I was crying to every soul mortal or not within direct contact. When the light hit his eyes, the soul eater himself had a tear run down his face. \n\nHe took me out of the courtroom around to the agora with luminous space above, with the walls guarding the onlookers from seeing, took off his mask to reveal a blue skinned humanoid with piercingly bright cyan eyes. “The memories of your hardships will die with you” and put on his mask and absorbed me.\n\nI looked up at the luminous cloudy void sky swirling with complexity and wonder and a deep sense of relief and think about that there’s infinite possibilities and infinite worlds. As my face flows into his mask, I say “thanks”.", "id": "1433p90", "url": "https://www.reddit.com/r/ShortSadStories/comments/1433p90/the_one_time_anubis_cried/", "created_utc": 1686113556.0, "score": 2, "permalink": "/r/ShortSadStories/comments/1433p90/the_one_time_anubis_cried/", "comments": [], "URLs": [], "html_title": []}, {"title": "On Returning", "selftext": "She was thrown into disarray by a sudden torrent of images and feelings that begun with an intuition. The passing glance between her now ex-lover and a woman hanging around his shared-house spontaneously convinced her there must be some kind of twisted romantic entanglement between them. Aware of the sudden fits of exploding anger caused by her jealousy, she tried to control herself by looking at her surroundings and experiencing the horrid smell coming from every pore of the house, which only made her anger grow. She couldn’t understand what she was doing back in the middle-of-nowhere town she moved to years ago in order to escape the trauma of her romantic life, the same place she ran away from as fast as she could after living with her layabout ex for nearly three long and suffocating years. She walked as in a daze and found somewhere to sit, surrounded by a motley pack of street dogs, and kept being overtaken by waves of memories amidst the increasingly louder angry growls of hunger. \n\nHe sat across the room and looked at her, analyzing the changes he could superficially perceive from her clothing, her smell and mannerisms and her conversation. He kept looking at her and admired her capacity to contemplate and get lost in thought wherever she found herself in. After minutes of total silence between them, he realized they were back in the same sad old place. There was an issue within the first hour of her arrival and it would take hours, maybe days, before she would even bring it up to him. Instead, she’d try to play it down while trying to control the violent-red tone of her voice and her thought-patterns. Her strange behavior and the way he had to navigate it and attempt to make sense of it had opened his eyes to the invisible languages that permeate most human interactions, languages which become particularly acute between lovers. During their time together, he had learned how others express themselves with all the senses, with the semi-concealed vocabulary of the unconscious: with the soft touch and tender looks and the fragrance that covers the air shared between lovers, things that nobody else can smell or touch or see, the things that create a silent understanding of the waves of affection that pushes one body towards another. The only ones that can develop the skills to see such a language spoken amongst others are the scorned and jealous lovers, though their wild paranoia - their constant state of alert for signs of betrayal - often leads them to realms of pure fantasy, to the transformation of the world into a theater of their desires.", "id": "1430wf2", "url": "https://www.reddit.com/r/ShortSadStories/comments/1430wf2/on_returning/", "created_utc": 1686105201.0, "score": 6, "permalink": "/r/ShortSadStories/comments/1430wf2/on_returning/", "comments": [], "URLs": [], "html_title": []}, {"title": "Cold", "selftext": "The cold metal against his tongue bothered him more than it should have.\n\nWhat did it matter?\n\nWhy did he care?\n\nIt was all going to be over soon anyway.\n\nThe gun was loaded and ready to be used.\n\nSo why was the coldness of the metal from the barrel all he could think about?\n\nHe took the gun out of his mouth and looked at the barrel.\n\nIt was a deep shade of black. It looked endless. \n\nLooked like a bottomless pit that stretched forever.\n\nHe stared down the barrel and looked into the void. \n\nHe thought about the coldness of it.\n\nHe thought about the way it felt against his tongue.\n\nHe stared blankly at the gun thinking about nothing else other than the cold feeling.\n\nThe icy coldness of it.\n\nHe didn't think about what brought him to the point of sticking the gun in his mouth. \n\nHe didn’t think about the lonely days and lonely nights.\n\nHe didn’t think of his wife.\n\nHe didn’t think of his daughter.\n\nHe didn’t think of the Volvo burning with them inside screaming for him to help.\n\nHe didn’t think about how he was paralyzed by fear.\n\nHe didn’t think about how he watched them die.\n\nHe didn’t think about the smell of their charred skin cooking in the flames.\n\nHe didn’t think about any of it.\n\nAll he could think about was the icy coldness of the barrel as it pressed into his tongue.", "id": "13zww5r", "url": "https://www.reddit.com/r/ShortSadStories/comments/13zww5r/cold/", "created_utc": 1685842809.0, "score": 7, "permalink": "/r/ShortSadStories/comments/13zww5r/cold/", "comments": [], "URLs": [], "html_title": []}, {"title": "Man in the Well", "selftext": "There once was a man who was deaf and blind. He fell in a well. He was there for 7 days and 6 nights. He was hungry and cold and wet from the rain. People passed by but no one knew he was trapped down in the well. He could not speak and being blind he had no sense of when someone was up above him.   \n\n\nHe cried in silence and wept without tears. He waited and waited and prayed and prayed for salvation of some form. After the sixth night when his stomach was rumbling and the last of his rain water was gone he decided he had waited long enough. He looked up at the sky and silently asked God to take him.   \n\n\nHe wanted to die.   \n\n\nHe didn't want to be cold and hungry anymore.   \n\n\nWhen God did not answer his call he looked down at the ground and asked the devil. He begged for the devil to take him from the cold and to give him some heat. The ground opened up as soon as he asked and we was swept beneath the dirt. He slid down deeper and deeper into the pits of hell getting hotter and hotter the further he slid.  \n\n\nThe heat from the flames below dried the clothes that had been drenched with rain. He heard sobs and cries below.... He heard... for the first time in his life he heard a sound. He heard screams of agony and pain. The flames were getting brighter to his eyes... bright! He saw light. For the first time in his life he saw light. How was this possible? He didn’t know.   \n\n\nThe devil did it. The devil wanted him to hear… The devil wanted him to see. He finally reached the bottom and fell onto hard concrete. The flames were in his face, his eyes. The screams of agony were ringing in his ears. A shadowy red figure was walking towards him. It had red eyes and flames were shooting from his back. The closer it got the more afraid the man felt. He wished he were still blind. He didn’t wanna see it. He wished he were still deaf, he didn't want to hear the pain, the screams, the cries. As the shadowy figure got near it raised a pitch fork that it was carrying. It slammed it down on the ground 3 times and flames sprouted and shot up into the dark ceiling.   \n\n\n\"Am I in hell?\" The man asked.  \n\n\nThe shadowy figures red eyes grew brighter and the man saw a bright yellow greenish smile form on the figures face.   \n\n\nIt didn't answer him.  \n\n\nSuddenly the man awoke. He was no longer in hell. He no longer had sight. He no longer could hear screams or cries. He was still alive. It was just a dream. Suddenly he no longer wanted to die. He no longer minded the cold, the thirst, the hunger, he wanted to live. He wanted to —   \n\n\nSuddenly he felt someone grab him. Someone was lifting him up.   \n\n\nWas he saved?   \n\n\nHe didn't know he couldn't hear. Couldn't see.   \n\n\nHe was placed on a rolling bed. Someone put some water to his lips. He took a sip.   \n\n\nHe was saved.  \n\n\nIt turned out God answered his prayers after-all. It was God who made him dream that terrible dream. God who made him hear and see the torment of the Devil of hell. It was God.", "id": "13zw3zj", "url": "https://www.reddit.com/r/ShortSadStories/comments/13zw3zj/man_in_the_well/", "created_utc": 1685840887.0, "score": 7, "permalink": "/r/ShortSadStories/comments/13zw3zj/man_in_the_well/", "comments": ["That’s a shitty God.", "Isn’t the real one just the same."], "URLs": [], "html_title": []}, {"title": "I always hated my 4th birthday", "selftext": "I always hated my 4th birthday.\n\nIt wasn't a bad brithday, it was on September 3rd: a sweet spot nearing the end of summer when we get a 3 day weekend from school.\n\nIt wasn't a bad birthday, it was the party every little girl in California wanted: Pink and white streamers, disney princess cupcakes, a good Katy Perry playlist playing in the background, and a big bouncy castle out back.\n\nIt wasn't a bad birthday, I got everything I wanted on my list: A dress of princess Elsa with a matching wig, a magical wand, new dolls with the longest hair I had ever seen, new coloring books, a new CD for Dora the Explorer, a pack of smelly pencils that when you opened the box was like walking into a candle store, a parachute soldier, a new train for my train set, and a new pair of sneakers that lit up when you stomp on them just right.\n\nIt wasn't a bad birthday, I got to play all day long: Bouncing on a castle with my classmates (excluding that one boy who was always so annoying), shoving cake into each other's faces, playing \"pin the tail on the pony,\" winning multiple rounds of Red Light Green Light, and rolling down the hill which always left grass in my hair.\n\nIt wasn't a bad birthday, when the party was over my mom gave me a Royalty treatment: A big bath of bubbles that overflowed if I moved, bed sheets that just came out of the dryer towering on my bed, a huge bowl of macaroni and cheese, and she even joined me with playing dolls.\n\nIt wasn't a bad birthday, that night I had dreams of roaming infinite worlds of my imagination, marrying my youtuber crush, joining Princess Mulan on fighting the huns, wielding bows and arrows like I was cupid, and flying in skies of cotton candy.\n\nIt wasn't a bad birthday, it was a little girl's dream.\n\nIt wasn't a bad birthday, it was perfection.\n\nIt wasn't a bad birthday, the reason I hate it so is because of the wish I decided to make.\n\nIt wasn't a bad birthday, but that was the only thing on my mind when I blew out those candles\n\nIt wasn't a bad birthday, but cars and houses flooded my mind, along with the freedom I was going to gain.\n\nIt wasn't a bad birthday, I just wished I told people my wish when they asked.\n\nIt wasn't a bad birthday, I just made a wish that would ruin my life.\n\nIt wasn't a bad birthday, I made the wish every child my age wanted, \"I want to be a grown up now.\"\n\nIt wasn't a bad birthday, but as I sit here in my bed, tired and depressed, I have so many regrets: I wish I didnt make that awful birthday wish.\n\nIt wasn't a bad birthday, but in two months, I will be entering highschool.\n\nIt wasn't a bad birthday, but time has been going by way too fast.\n\nIt wasn't a bad birthday, it truly wasn't.\n\nI just wish I wished that \"I could be a kid forever\" instead.", "id": "13zgdpm", "url": "https://www.reddit.com/r/ShortSadStories/comments/13zgdpm/i_always_hated_my_4th_birthday/", "created_utc": 1685806487.0, "score": 4, "permalink": "/r/ShortSadStories/comments/13zgdpm/i_always_hated_my_4th_birthday/", "comments": [], "URLs": [], "html_title": []}, {"title": "I have amnesia", "selftext": "I have amnesia but sometimes these emotions come back to me, sort of like nostalgia. Like I can almost remember something... but when i try to pursue those feelings, they disappear. its like theirs something written on a piece of paper, and when i try to read it, the sentences disappear. Those vague hints of memories i can almost recall... are just eaten away. Its actually quite terrifying.", "id": "13z9ueq", "url": "https://www.reddit.com/r/ShortSadStories/comments/13z9ueq/i_have_amnesia/", "created_utc": 1685791449.0, "score": 1, "permalink": "/r/ShortSadStories/comments/13z9ueq/i_have_amnesia/", "comments": [], "URLs": [], "html_title": []}, {"title": "The Tree", "selftext": "The grass covered the hill. The snow covered the grass. The shadow from the tree covered the snow. It was this tree that he looked up at now. This tree that caused pain. Caused misery. It was this tree that took it all. Took it all away. He stretched out his hand. He placed it on the tree. He felt the wooden trunk beneath his palm. He felt. He closed his eyes. He listened to his heart beating. He could feel it in his palm. He could feel it in his fingers. The fingers that touched the tree. The tree that caused the pain. Caused the misery. The tree that took it all. Took it all away. He opened his eyes and looked. He looked up and saw. Saw the rope. He saw the loop. He walked over and reached out his hand and grabbed. He brought it to his face. He closed his eyes and brought the rope up over his head. He let it drop over and land on his shoulders. He opened his eyes and looked. He saw a bird perched on a branch. He smiled. Then he thought. Thought about the pain. Thought about the misery. The smile faded. The wind started to blow. The snow had started again. He closed his eyes. He tightened the noose and dropped to his knees. The bird started to chirp but he did not hear. The wind blew and the snow fell. But he did not feel. His eyes were closed. And thats how they remained.", "id": "13yhs5x", "url": "https://www.reddit.com/r/ShortSadStories/comments/13yhs5x/the_tree/", "created_utc": 1685724251.0, "score": 6, "permalink": "/r/ShortSadStories/comments/13yhs5x/the_tree/", "comments": [], "URLs": [], "html_title": []}, {"title": "I wonder how I'm not insane yet", "selftext": "This is my original story, altho young I mostly lie about myself and its rare that some one I've met in person knows how I truly fell because I feel weak and ashamed about it. Since I was young (and dumb), I loved my father but rarely saw him or ever normaly spoke to him, he used to make a lot of promises from small to big. They never came true nor were they ever brought up again, it makes a child crumble inside. School wasn't any diffrent, I was one of the corner people that were easy targets and when asked about my father I sometimes cried in my seat while others laughed. Those are blury pictures but never erased nor changed. As the years passed so did the insanety that followed me from my abusive father trying to contact us after we moved and threat us to my mind revolving over suecide and will to brake bones aswell end a list of people. Some say I've grown a pair of \"Balls\" over the past 2 years from pulling back all the time to engaging into 2 group fights/ambushes and god I wish I did but no. I stopped carring about most things and I've grown a strong video game adiction and a liking of pain and video game circus music (darkest dungeon butchers circus dlc loby music). \n\nAll notes aside I just wanted to relif myself of my own silence and repeating within that brain of mine", "id": "13x26zl", "url": "https://www.reddit.com/r/ShortSadStories/comments/13x26zl/i_wonder_how_im_not_insane_yet/", "created_utc": 1685576863.0, "score": 3, "permalink": "/r/ShortSadStories/comments/13x26zl/i_wonder_how_im_not_insane_yet/", "comments": [], "URLs": [], "html_title": []}, {"title": "Eyes Of A Child", "selftext": "He went up to the lectern, quivering. The paper was in his hand but you could clearly see droplet stains dotted all over it from where he’d been crying. Crinkled sides from where he’d grabbed it, tempted to rip it to pieces. \n\nHe propped himself up to the lectern. Could barely see everyone else. He took his time adjusting the microphone down to his height and began speaking. Not before taking a glance at the coffin sitting aside from him.\n\n“Dad and I loved going to the park. We really did…”\n\n“I remember crisp, sunny days where he’d go to the ice cream van and buy me  a Mr. Whippy and then we’d walk around past green, green grass and tall tall trees. We’d just talk about stuff, me and him, like my newest school play or the Spongebob episode I’d watched last night. It felt like forever. But good forever.” \n\nHe glanced at the coffin again and looked at the ground, sniffling. \n\n“I remember our last visit to the park. Boring Monday evening! At least I didn’t have to endure mom’s bad homemade pizza!”\n\nHe let out a tiny laugh, killed by the chainsaw ripping through him on the inside. The attendees weren’t very reactionary anyway. \n\n“But it all felt bad and weird. I didn’t like it, I wanted to go home that day. Dad told me everything was gonna be alright and squeezed my hand. I loved when he squeezed my hand. It made me feel safe.”\n\n“And then we got to the big field. We sat down, and we had a picnic. But there was this man in the park. He had a Mr. Whippy like me. He kept looking at me. Dad told me not to pay attention. So I didn’t. It felt alright- for a little bit.”\n\n“The one year anniversary of Dad’s divorce didn’t help though. He was asking things like ‘How’s your mother’ and ‘Everything okay at home?’. I could tell he looked very sad. It made me sad. I wanted to give him a big hug but he didn’t want one.” \n\n“Then I saw that man keep looking at me. Like he wanted to eat me. Kinda like Jason from the movie about a scary camp that Dad and Mom watched once.”\n\nHe smiled for a moment. Dad sure couldn’t watch that movie with him now.\n\n“The man came over to us. Oh, what did he want. Silly, ruining our picnic!”\n\n“I don’t know what happened after the next few seconds. All I remember hearing was the man ask ‘Sir, why is there a machete in your bag-‘ and seeing Dad look at me like he was about to cry…”\n\nHe walked over to the coffin. \n\n“And now I’m here. . I don’t know why I’m here but I am. Oh, I miss my daddy so much.” \nHe opened the coffin, hoping to see his father maybe just sleeping in there, as a part of some joke. It was still his own lifeless body in there.\n\nThe attendees still weren’t very reactionary. Not surprising considering there were none. \n\n“I guess I’m here forever now. I’m sad. But maybe I’ll find my dad somewhere!”\n\nHe ran over to the church doors and swung them open, revealing a bright, white light", "id": "13wttmk", "url": "https://www.reddit.com/r/ShortSadStories/comments/13wttmk/eyes_of_a_child/", "created_utc": 1685557297.0, "score": 2, "permalink": "/r/ShortSadStories/comments/13wttmk/eyes_of_a_child/", "comments": [], "URLs": [], "html_title": []}, {"title": "Soulmate", "selftext": "She is perfect.\n\nSometimes, her hair is short, dark chestnut. Sometimes, it's dusty blonde locks or firey orange. Sometimes, she is freckled pale, or black as rich soil. But she is always mine, and is always perfect.\n\nAs I write her stories I fall ever harder. You might think I am like Narcissus admiring his own reflection. But I am weak, small, wretched. She may be the creation, but I am the monster. She is everything I admire, strong, wise, a force of nature. Perfect.\n\nI can't stop. Can't get enough of her. She has become everything. I only breathe so she may have life. Her exsistance has become a drug. She understands the world in  ways that I cannot. \n\nI feel my body failing me. Nothing to eat in days, no water, no sleep. Just her. That is okay. All I need is her. I bloom in her sunlight.\n\nSoon, she will give me peace. I will expire and she will come with me. We will be together in the dark.\n\nFor now, I write.", "id": "13trytt", "url": "https://www.reddit.com/r/ShortSadStories/comments/13trytt/soulmate/", "created_utc": 1685250301.0, "score": 4, "permalink": "/r/ShortSadStories/comments/13trytt/soulmate/", "comments": [], "URLs": [], "html_title": []}, {"title": "One Teardrop Short of Blossoming", "selftext": "Ring ring ring…. Ring ring ring…. Ring ring ring.. I eventually  wake up after my 3rd snooze to the sun beaming off my tv I forgot to turn off from the night before.”fuck you i say to myself”.  Like clockwork I begin to scroll endlessly through my phone, hoping to kill the first hour of my uneventful day. As I scroll, I envision what my life could be like if I made modifications to the person I am, but the socials have other ideas, as I lie still grave digging deeper for any dopamine. Ideas begin to ping pong around my brain and I make the decision to roll out of bed and see what the day has in store for me. The caffeine then strikes me like a well polished jazz tune. Finally today's the day.. I think. With this rush of endorphins I begin my work for the day, but always making sure to jot down what is voicelessly going on in my head. Tick tock tick tock, my brain seems to become more inspired by each breath of the clock. Before I know it the day has ended. I find myself with a crowded notebook of scribbles and thoughts, processing each one as better then the last. Filled with this feeling of hopefulness, I arise to grab a bottle of liquor in celebrations that I've won the day. On my way I step past a mirror and cant help but to stare at the dead man on the other side. Anchored to the floor i begin to filter my likes and dislikes of the figure in the mirror. I feel a change in myself as if I were a leaf on a tree slowly dying at the mercy of fall weather. FUCK. One foot in front of the other I find myself back at the table with a bottle of bliss and a glass.  “You piece of shit”, As i load shot after shot  in search of anything but reality. Each shot drains me more than the diminishing ink at the end of my ball point, until I find myself with a full garbage can of bottles and ideas from the prior days. I flip to the last page of the journal only to see I've found myself here before, Anxiety+ dreams=          nothing.. Is all I see written all over. I  lower my head trapped in despair, feeling like the failure that I know I am “who cares is all i can mutter”.\n \nEyes closed I drift away only to hear Ring ring ring… Ring ring ring.. Ring ring ring", "id": "13rxh3o", "url": "https://www.reddit.com/r/ShortSadStories/comments/13rxh3o/one_teardrop_short_of_blossoming/", "created_utc": 1685058954.0, "score": 3, "permalink": "/r/ShortSadStories/comments/13rxh3o/one_teardrop_short_of_blossoming/", "comments": [], "URLs": [], "html_title": []}, {"title": "The King", "selftext": "There he sits upon his crusted throne. Light reflects off of the dust in the almost empty stone room. A beautiful day goes unnoticed again as he stares. Centuries he has been sitting and centuries more he will remain. \n\nSimply watching. \n\nWaiting for a breath. \n\nA ripple in her chest where her heart sleeps. \nAll the while he waits trapped in his own mind, paralyzed by his guilt and fear.\n\nAround this self-induced prison, is movement, life, death, re-birth. The ever expanding and ever twisting growth of the cosmos. \n\nBut in here, there is only him. And only her. And only dust. \nHe doesn't know her anymore. He doesn't remember her laugh, or what made her eyes sparkle. He doesn't know what her voice sounded like or even the color of her hair. \n\nHer form a stoic golden pillar.\n\nForever taunting him. \n\nTrapping him in his own mind. \n\nHe stares.\n\nPins and needles dance around his finger reminding him of his curse. \n\nHe has wrapped that hand around his own neck a thousand times. Begging the Gods, begging her, for mercy. \n\nThere is nothing though. Nothing but the skeleton like hand on his throat. And the girl. And the dust.", "id": "13knuwv", "url": "https://www.reddit.com/r/ShortSadStories/comments/13knuwv/the_king/", "created_utc": 1684382486.0, "score": 6, "permalink": "/r/ShortSadStories/comments/13knuwv/the_king/", "comments": [], "URLs": [], "html_title": []}, {"title": "The Bengal and the Boy", "selftext": "The Bengal and the Boy\n\nHMC\n\n&#x200B;\n\nA young boy went to a zoo one day. He was fascinated by all the incredible creatures, big and small. \n\n  \nWhile strolling around, he came across a tiger in a cage. The beautiful female Bengal paced back and forth, her radiant and intense eyes focused on the boy. \n\n  \nFierce and composed, the mighty Bengal tiger sent shock waves of majestic fear down the young boy’s back. He couldn’t decide weather to be frighted by her power or in awe of the beauty in her stripes. \n\n  \nAfter a while, A zoo worker came up to the boy. “Don’t be scared, she won’t hurt anyone. This tiger has been in a cage all it’s whole life. She’s very comfortable here, it’s her home.” \n\n  \nThe young boy stood silent, staring at the incredible creature, trying to understand what the zoo worker had told him. \n\n  \nFinally, after minutes of the young boy and Bengal tiger quietly eying each other, the young boy responded to the zoo worker, \n\n  \n“If this cage is where she has lived her whole life; if this is her home and where she is comfortable, then why do you have to lock the cage?” \n\n  \nBefore the worker could answer the boy’s question, he had walked away. He was already off trying to find a key.", "id": "13ipldy", "url": "https://www.reddit.com/r/ShortSadStories/comments/13ipldy/the_bengal_and_the_boy/", "created_utc": 1684196656.0, "score": 3, "permalink": "/r/ShortSadStories/comments/13ipldy/the_bengal_and_the_boy/", "comments": [], "URLs": [], "html_title": []}, {"title": "COCKADOODLE", "selftext": "FADE IN:\n\nEXT. SMALL TOWN IN THE NORTHWEST - DAY\n\nThe sun is shining brightly over the small town. The camera pans over the streets, which are empty except for a few people running in the distance. Suddenly, a loud noise interrupts the peaceful atmosphere. It's the sound of a rooster crowing, but it's different from any other rooster’s call. It's more guttural and menacing. The name of the rooster is Cockadoodle.\n\nCUT TO:\n\nINT. MAYOR'S OFFICE - DAY\n\nThe mayor, a portly man in his late fifties, is sitting at his desk looking worried. A young reporter, JENNY, is interviewing him.\n\nJENNY\nWhat's going on in this town, mayor?\n\nMAYOR\n(looking worried)\nIt's that damn rooster, Cockadoodle. He's become rabid and is terrorizing our town. People are afraid to leave their houses.\n\nJENNY\nWhat are you doing about it?\n\nMAYOR\nWe've tried everything. First, we called animal control. They tried to catch him, but he's too fast and dangerous. Then, we even considered calling the army, but we don't want to cause unnecessary damage to our town.\n\nCUT TO:\n\nEXT. TOWN SQUARE - DAY\n\nPeople are gathered around a bulletin board, looking at a notice that says \"WANTED: DEAD OR ALIVE COCKADOODLE\" The camera pans to a group of young people talking.\n\nYOUNG MAN #1\nI say we take matters into our own hands.\n\nYOUNG WOMAN #1\nAre you crazy? That rooster is dangerous.\n\nYOUNG MAN #2\nWe can't just stay here and let him terrorize our town. We need to do something.\n\nCUT TO:\n\nEXT. MAIN STREET - DAY\n\nA group of people, including the young people from the town square, are gathered together, armed with sticks, shovels, and nets. They are cautiously walking down the street.\n\nYOUNG MAN #1\nOkay, we're getting close. Be careful.\n\nSuddenly, a loud screeching sound fills the air, and the group is attacked by the rabid rooster.\n\nCUT TO:\n \nEXT. MAYOR'S OFFICE - DAY\n\nThe mayor is on the phone when Jenny walks in.\n\nMAYOR\n(into the phone)\nWhat? Are you sure?\n\n(he hangs up)\nJENNY\nWhat's going on?\n\nMAYOR\nThat was the CDC. The rooster is infected with a lethal strain of avian flu. We have to evacuate the town.\n\nCUT TO:\n\nEXT. ABANDONED FARMHOUSE - DAY\n\nThe townspeople are gathered together, looking frightened and exhausted. Suddenly, they hear a loud crowing sound, and the rabid rooster appears. He's bigger, stronger, and more dangerous than ever. The group starts to panic and back away.\n\nCUT TO:\n\nEXT. TOWN SQUARE - DAY (ONE WEEK LATER)\n\nThe town square is bustling with people, the sun is shining, and the atmosphere is happy. The camera pans over to the bulletin board where a new notice has been posted.\n\n\"WANTED: COCKADOODLE - BELOVED TOWN MASCOT RETURNED SAFELY\"\n\nThe camera pans over to Cockadoodle, who is being held in a cage and has a band-aid on his head.\n\nCUT TO:\n\nEXT. NEW HOME FOR COCKADOODLE - DAY\n\nThe camera pans over a large open field surrounded by a white picket fence. We hear the sound of a rooster crowing, but it's a happy and familiar sound. The camera stops on a sign in the field that reads, \"Welcome to Cockadoodle's new home.\"\n\nFADE OUT.", "id": "13gzk9g", "url": "https://www.reddit.com/r/ShortSadStories/comments/13gzk9g/cockadoodle/", "created_utc": 1684029941.0, "score": 3, "permalink": "/r/ShortSadStories/comments/13gzk9g/cockadoodle/", "comments": [], "URLs": [], "html_title": []}, {"title": "Redemption", "selftext": " \n\nI would like to tell a story if you are willing to listen. Our story begins with a boy who fell in love. It was his first true love, and he would have done anything she asked. They would go on picnics and would watch movies together. They enjoyed being together. But not all stories have a happy ending. Even though they loved each other very much he lost her to Death's cold touch. He spent months trying to think of a reason why she did this to him and no matter what he thought he didn't have answers he didn't have closure. This bothered him greatly because he blamed himself for years he couldn't see past the pain and hatred. Until one day he picked up a bow and started to learn archery. This brought him some peace, but it wasn't enough he needed to know why. Why or how could she do this to him? No matter what he did it was there following him. His hatred grew resentment for love. The one person he truly trusted is gone and he was left alone, and he cut himself off from the world. Living in solitude helped but it was still like a whisper in his ear, her voice calling him. He is suffering for what he has done. He doesn’t understand why. Every day he asks himself the question and tries to find a reason but there doesn't seem to be one. He is confused, lost, maybe sad or angry but one thing he understands is everyone deserves a chance. He tries his best to treat everyone kindly but he doesn't think he deserves it so he can’t let go of his hatred for himself. One day he can be with her, but that day is a long time away. Some would call this a form of survivor guilt; he is not so sure. Love is a truly strong bond it has been years now, but he still feels the same. One thing I do know I shall be redeemed.", "id": "138g52l", "url": "https://www.reddit.com/r/ShortSadStories/comments/138g52l/redemption/", "created_utc": 1683278244.0, "score": 4, "permalink": "/r/ShortSadStories/comments/138g52l/redemption/", "comments": ["She died but she did this to him?", "She killed herself sorry should have been more clear.", "She still did it to herself and not him. He is a narcissist.", "Correct!"], "URLs": [], "html_title": []}, {"title": "NASA has released the statement from the first manned mission outside our solar system.", "selftext": "Houston, this is my final transmission.\n\nI want to say that traveling beyond our solar system has been a success.  I want to tell you about seeing Saturn’s rings, how the Milky Way glimmers, how beautiful the stars shine when they aren’t obscured by city light pollution.\n\nBut I can’t.\n\nShortly after passing the asteroid belt, the computer systems woke me out of my cryopod to investigate a system error.  Looking through the logs, I found a tragedy in action.\n\nThe refrigeration systems have broken, allowing a large portion of our food and scientific supplies to go bad.  I then made the realization that there’s been another issue.  The supplies we’ve brought are woefully inadequate, about a third of what they should be.  The numbers in the logs stated that there should be enough oxygen and equipment for where we’re supposed to go, but that doesn’t match with what we have.\n\nI looked at the numbers again and compared that against what we have in the cargo hold, and I figured out the error.  The time for the duration of our mission, outside of cryosleep, had been mistaken with the supply numbers.\n\nThis is an impending disaster that we cannot survive even if we reach our destination and use our resources sparingly.  We’re too far out to return to Earth to get more supplies; the very same issue that would leave us in dire straits at our destination means we don’t have enough to turn back.\n\nI suppose an ‘obvious’ solution would be to keep one person conscious to return the ship, but we’re already light years away.  It isn’t possible to man the ship without the computers taking over a large portion of the journey, and the computers have already demonstrated other system failures that led to this current issue.\n\nAs the lone officer presently available, I’ve made the executive decision to begin the process to put the crew to permanent sleep.  They don’t need to know that the mission is doomed; that would cause more panic than is necessary.  We can’t change the outcome, only the means.\n\nThis is a burden I didn’t anticipate when joining the crew.\n\nBut even now, as I write this, I don’t want to die.  I want to live!  I wanted to see the galaxy and advance us for space travel!  Even if the travel in sci-fi shows wouldn’t be possible in my lifetime, I wanted to help make it happen.\n\nAnd I feel so, crushingly alone.\n\nBut a way, looking out the window is a cold comfort.  I can see the stars as I pass, and I keep thinking my mother teaching me about constellations as a kid.  She was so proud of me when I told her about the mission and was there when we launched.\n\nTo whomever reads this back home, please tell my mother that I love her.\n\n-Jean Bennett, ‘Leo’ Mission Specialist", "id": "131yga3", "url": "https://www.reddit.com/r/ShortSadStories/comments/131yga3/nasa_has_released_the_statement_from_the_first/", "created_utc": 1682696875.0, "score": 30, "permalink": "/r/ShortSadStories/comments/131yga3/nasa_has_released_the_statement_from_the_first/", "comments": ["oh man. read about halfway through thinking this was real until I realized there's no such manned mission haha. Great work!", "Thank you, that means a lot to me!"], "URLs": [], "html_title": []}, {"title": "Happiness is a false reality", "selftext": "I remember when I was happy. Plenty of friends, a sweet girlfriend who made me feel loved, everything was on the up and up. I'd struggled with depression for many years, and finally thought I turned my life around. Until that night. The one single night.\n\n&#x200B;\n\nI heard a knock at my door. I answered in my dressing gown as I was winding down for the night, only a few minutes out of bed. Upon opening the door, I was greeted with a fist to the face. I went down. I still don't know who did it, the next thing I remember was being in hospital scanned in an MRI machine to check for brain bleeds.\n\n&#x200B;\n\nTerrified, I searched for my phone, but it was outside the room due to the magnetic force of the MRI machine. Half an hour later, I get let out of the room while a Doctor reads my results. It's at this moment I finally have my phone in my hand, and with sweaty palms and a quaking hand, I unlock it. \n\n&#x200B;\n\nMessage from Rachel: \"We need to break up.\"\n\n&#x200B;\n\nI don't understand, my brain carries in to overdrive as I try to work out what I'd done. The doctor walks in, and tells me I have a crack in my skull from hitting the ground. Had I known at the time, I would have told him to dose me up with morphine until my heart stopped. Constant headaches and a broken heart do not go well together.\n\n&#x200B;\n\nBreaking down crying in my hospital room, I was deemed not mentally stable enough to go home. I don't understand, my mind was clear. I wanted to die. This was no borderline or bipolar, depression or anxiety. I was ready for death, and wanted it to come as quickly as possible.\n\n&#x200B;\n\nI still am.", "id": "130jyni", "url": "https://www.reddit.com/r/ShortSadStories/comments/130jyni/happiness_is_a_false_reality/", "created_utc": 1682597203.0, "score": 5, "permalink": "/r/ShortSadStories/comments/130jyni/happiness_is_a_false_reality/", "comments": ["DONT GIVE UP, PLS\nThere are ppl that dobnot see ur light but, even tho i dont know u, i am sure God will bless you with ppl who will adore u and the love u give and ppl that will cherish every moment they have with you. Pls dont give up tho. I saw a yt vid and it said\" Life is like a slingshot, God will pull u back making you feel like everything is wrong and everything is against you, but that is only before God lets go and you go soaring into blessings and good things.\"\nYour slingshot is just biggervthan mosts and most prob ur outcome will be too. Just hold on pls. And if u want God to release ur slingshot u have to try to look at the gokd or make the good happen. Always remember, Happines is not false reality, it is a choice.", "Pls dont mind the spelling"], "URLs": [], "html_title": []}, {"title": "Tired", "selftext": "I'm so tired of being expected to exist all the time. My mind wants to go and be with the void for a month or six or maybe three. I want to shed the stress and live with a mind truly free of pain. I don't want to look at the spots I went with her, or drive down the street and wonder if anyone would care if I went in the other lane. I want my mind to stop and to just fucking stop thinking about everything going on. I want a moment to myself, not invaded by work or money or the expectation of being alive. True bliss, like back before I knew of societies issues and the inevitable death I will inevitably experience. The people I know I will stop knowing that I never want to leave. I don't know what I will do nor do I know what I will won't do. I wish for that time off but during the time off my mind goes and goes and goes. I think constantly the end of everything would be so nice, but there are so many I don't want to leave. It builds and it builds and the pressure gets greater and greater. I sleep and eat and exist and that is all I am. Is the monster under my skin that rips and tears and tries to escape. No one else can see it and I let people in but it's only a tiny fraction of a pinhole of what's going on. I don't let anybody in because the monster always drives them away. People think they know me. Think they know my mind and my heart and what I'm thinking but I hide behind iron reinforced with the pain of betrayal. Ever wondering when I will break and finally be one with whence I came.", "id": "12z3ulj", "url": "https://www.reddit.com/r/ShortSadStories/comments/12z3ulj/tired/", "created_utc": 1682476475.0, "score": 4, "permalink": "/r/ShortSadStories/comments/12z3ulj/tired/", "comments": [], "URLs": [], "html_title": []}, {"title": "Worst time of my life", "selftext": " \n\nWhen i was 6-7 i shared a room with my brother who is 5 years older than me and was going through puberty so his hormones must've been up.\n\nfor some reason, my parents forced me into his room, which was one of the worst times of my life.\n\none night he ushed me up his bed and after this he did it almost every night and i was scared of him so i listened\n\nhe then started touching me and forcing me to touch him and it hurt and felt bad but i was forced to and he then came out gay a couple years later\n\nand its only started to haunt me because im now going through puberty and having hormones and watching p\\*rn and every time i just cant help to remember and i break down crying because it was such a bad time\n\nalso this is real and the only people ive told are my closest friends", "id": "12ubqyd", "url": "https://www.reddit.com/r/ShortSadStories/comments/12ubqyd/worst_time_of_my_life/", "created_utc": 1682098057.0, "score": 5, "permalink": "/r/ShortSadStories/comments/12ubqyd/worst_time_of_my_life/", "comments": ["I'm so sorry this happened to you. That was abuse. Please tell a trusted adult.  Also, please consider seeking therapy to work through it.\nDoes he still live in the home? Are you safe?", "no he doesnt he lives at my nans and he is 18 now. and i do kickboxing so i know how to defend myself so im safe. i was supposed to talk to a therapist but they left before i could", "It's really important that you tell a trusted adult. This is a crime. And please try to find a new therapist.", "there is no proof it happened so they won't believe me especially because I got accused of stealing weed. and in my town there is no therapist for an hour and a half", "There's often not proof. If you don't have access to help locally, you can contact RAINN https://www.rainn.org/", "thankyou"], "URLs": [], "html_title": []}, {"title": "I wrote a short story for practice for my GCSE creative writing, feedback would be helpful. Thanks", "selftext": "Bang!, the sharp noise reverberated around around the room.\n\nIt was 9.38AM,\nI abruptly rose from underneath my thick goose feathered douve, one that had served its purpose for far too long. My visioned blurred, as my head filled with blood allowing for my brain to obtain the desired oxygen it craved each second of the day .As i regained consciousness, the delyaded wave of panic struck me like a potententious tree hitting the ground. Numerous thoughts flew by me as to what produced that noise, causing me to become flustered resulting in a warm sharp pain creep through my spine, a feeling which caused discomfort. Not physical discomfort, but emotional,the type thats driven by your natural sences.\n\nA dull eerie light illuminated around my blackout-out curtains.Now standing up, I reached out to peel away the coarse fabric, the light climbed around my room, leaving no space for darkness to hide. Thick grey clouds smothered the morning sky accompanied by a light patter of rain. The rain soothed me, as I much enjoyed the rhythmic performance it displayed for me on occasion.\n\n9.50AM,\nthe clocked read this time as i crept down our white washed stairs into our white themed corridor leading to our white kitchen. There was a common theme throught my house, that reflected ambiance aswell.\nAs I timidly stepped into our living room, I saw my mother laying on the cold unforgorgiving marble floor. Her arms were drooped over her thighs, as she leaned against the cabinet, frozen to the spot.\n\n9.55AM,\nThis time is buried into the back of my head, it is stored in the amygdala, as it is where traumatic events are imprinted forever. My mothers eyes were plump and dark red, like a fresh blood oragange thats juiced had been sucked out, being left to shrivel away in isolation. Teares streaming down her face in a unique pattern, similar to the patters of the rain that comforted me earlier. She was clasping her splintered phone, searching for comfort, processing the information she had received. \nI towered over her, unable to move. My visioned blurred once again, as my emotions took over. A rich slaty taer tiptoes down my left cheek in unison with my mothers. As I moved closer towards her, she looked up to me and I saw a glimer of hope in her eyes. I thought maybey I could help her through this time, but her pain was too raw, too fresh. It was clear that nothing could ease her suffering right now.\n\nI sat down with her on the hard blank floor, reflecting on how she felt inside, stone cold.I didnt know what to say, i wanted to let her know that i was there for her, that she wasnt alone, but i coundnt conjur up any words, not even the slightest sound.I myself was in a similar state to ,my body layed numb ,next to hers, as my mind floated above us, looking over our dull expressions unable to comprehend the information.\n\n10.00AM,\nMy grandad had passed away.", "id": "12tf2yb", "url": "https://www.reddit.com/r/ShortSadStories/comments/12tf2yb/i_wrote_a_short_story_for_practice_for_my_gcse/", "created_utc": 1682024612.0, "score": 7, "permalink": "/r/ShortSadStories/comments/12tf2yb/i_wrote_a_short_story_for_practice_for_my_gcse/", "comments": [], "URLs": [], "html_title": []}, {"title": "Young sadness", "selftext": "I don’t know if this is the right place to put this story, so please comment if I should delete it.\n\nBefore I was 13 my grandma’s passed and my grandpa. I also lost  3 nephew’s, one was only 8 or something and one was bord dead. The other one felt more like a best friend or brother. I also lost a uncle. 4 of these people passed because of c@ncer", "id": "12r0toy", "url": "https://www.reddit.com/r/ShortSadStories/comments/12r0toy/young_sadness/", "created_utc": 1681845335.0, "score": 3, "permalink": "/r/ShortSadStories/comments/12r0toy/young_sadness/", "comments": [], "URLs": [], "html_title": []}, {"title": "Here’s The Thing About Where I Come From", "selftext": "I was born in a town that doesn’t exist. All I saw when I came into the world were my mother’s eyes. If I could understand my language when I was just minutes old, I may have heard her name me. Li Jintao has a beautiful rhythm to it, and the sound of it helped me fall asleep whenever my mother rocked me. I bet she was happy to sing it too.\n\nThe first memory I have was from age five. The bamboo in our garden kept the sun out of the window. All the light in the room was from our television, which was blasting a speech. Somehow, I had this deep feeling that we were in trouble just from how the man spoke. For the first time in months, I began to cry, staining the collar of my bright pink shirt.\n\nWhen I was nine, I started to learn English. My mother, Li Fen, married an American soldier named David. He had learned Chinese on an app to impress her in high school, and it paid off. Now, he was the teacher. It was hard to wrap my head around all the conjugations and sentence structures at first. But my mom helped me by telling me to think of everything in smells. This method somehow made sense to my young brain, and by eleven, I was fluent enough to impress even my elementary school teachers.\n\nAt sixteen, I started training to join the military just like my dad. During my academy days, I saw multiple videos from our president Chen Haiwei. I had learned he was the man I saw on TV eleven years ago. He warned us all of our undertaking, but I pressed through, even as I watched others drop out. At age eighteen, I got sent off to war. For all I know now, my fellow army men could’ve been the last people I ever saw alive.\n\nTen years later, my town was erased. An army of gold-helmeted soldiers ransacked our town, and my parents were some of the lucky few to escape. As I stood there, watching my town burn and my friends put it out, my mind went back into smells for the first time in decades.\n\nSmoke, like old wood.\n\nBlood, like that one sauce we put on our rice.\n\nDeath, like rotten apples.\n\nAs time passed, I slowly forgot my town’s name. The people I warred with are nothing but a memory today. My parents live only a couple blocks from my apartment. I couldn’t live a happy life if I couldn’t see them from my window. We made our new place back where my dad’s from. This town is so much busier than the one I had to leave from, but in a weird way, there’s a sort of charm in that. Although my stomach turns to say it, this is home. My name is James Li, I am 46 years old, and I come from Chicago.", "id": "12owb33", "url": "https://www.reddit.com/r/ShortSadStories/comments/12owb33/heres_the_thing_about_where_i_come_from/", "created_utc": 1681693952.0, "score": 9, "permalink": "/r/ShortSadStories/comments/12owb33/heres_the_thing_about_where_i_come_from/", "comments": [], "URLs": [], "html_title": []}, {"title": "Travel the world", "selftext": "Lena had always dreamt of seeing the world. She saved up for years and finally embarked on her dream trip. She traveled to breathtaking places, met amazing people, and made unforgettable memories. But as she looked down from the clouds, she realized her ticket was one-way, for Lena had passed away and was now in heaven, forever watching over the world she had once explored.", "id": "12nllva", "url": "https://www.reddit.com/r/ShortSadStories/comments/12nllva/travel_the_world/", "created_utc": 1681598702.0, "score": 3, "permalink": "/r/ShortSadStories/comments/12nllva/travel_the_world/", "comments": [], "URLs": [], "html_title": []}, {"title": "High hopes and negative expectations", "selftext": "I have no faith. I start my day thinking about the worst things that could happen while in the shower. I.E. someone I know could be hospitalized and die slowly as a vegetable, something collapses on my house and I have to move, when I had a significant other I would think about how they would leave me without saying a word… I go throughout the day as if everyone is bound to screw something up, myself included. I’m tired of being blindsided while thinking I’m having a good time. I know that it can be unlikely for a lot of the things in my head to actually happen, but it’s better to be prepared and in the right mindset when shit hits the fan. I understand that everyone has the potential to make today or tomorrow a nice experience, but that couldn’t be farther(further?) from reality. Nonetheless, I hope and pray for everyday to be easy and carefree while thinking about all of the surprises that today will bring.", "id": "12eujx2", "url": "https://www.reddit.com/r/ShortSadStories/comments/12eujx2/high_hopes_and_negative_expectations/", "created_utc": 1680892115.0, "score": 1, "permalink": "/r/ShortSadStories/comments/12eujx2/high_hopes_and_negative_expectations/", "comments": [], "URLs": [], "html_title": []}, {"title": "Joey Evanston was an inspiration, someone to follow in the footsteps of.", "selftext": "Joey Evanston was nice. In high school, it's rare to find someone who's genuinely kind to others. Joey Evanston would go out of his way to help you if you dropped your books, needed a dollar extra to pay for lunch, or needed help with some homework. Joey Evanston is the type of guy you reach out to, for anything. One story I remember, about Joey Evanston, is when he saved the school's musical from ending in chaos by climbing to the top of the auditorium and fixing the speakers in less than ten minutes. \n\nJoey Evanston was nice, and that was easy for people to prey on. In high school, there's always someone who's guaranteed to be an asshole. Brian Cavonia would go out of his way to push Joey Evanston or make fun of Joey Evanston's mom for her cancer, or mess up his projects, but Joey Evanston still kept a smile plastered on his face. Brian Cavonia is the type of guy who everyone hates but is too scared to stand up too. One story I remember, about Joey Evanston, is when Brian Cavonia tripped him down a flight of stairs, and he broke his leg, yet Joey Evanston didn't snitch. \n\nJoey Evanston was nice, and that made Joey Evanston seem happy. In high school, there's plenty of problems people have, and Joey Evanston had a mental one. Joey Evanston's mom died a week before it happened. Joey Evanston started blowing off his classes. Joey Evanston seemed completely fine. Joey Evanston is the type of guy who seemed completely fine. One time I remember, Joey Evanston broke down in class the day before it happened, he ran out of the class to the bathroom. The teacher continued the lecture, and nobody checked on him. I could've checked on him. \n\nA month ago today, at 12:22 PM, Joey Evanston got on top of a lunch table and just started screaming at random people. At 12:23 PM, Joey Evanston pulled out an M9 Beretta his dad used while on his deployment. People ran out of the cafeteria, hid under tables, called the police, and filmed Joey Evanston. Approximately forty-two cameras were on Joey Evanston when he put the gun against his head. I was frozen at my lunch table, staring upward at Joey Evanston. The screaming and panic had stopped, it was completely silent except for the breathing of the students in the cafeteria. \n\nJoey Evanston looked down at me, from atop my lunch table, and told me four words. \n\n\"This isn't your fault.\" \n\nJoey Evanston shot himself in the head at 12:25 PM. A piece of his scalp made its way into my lap, his blood splattered against me, other students, tables, the floor. The floor was red, completely red. Pieces of Joey Evanston's brain were in my hair, on my shirt, everywhere. A quarter of Joey Evanston's head was gone. Joey Evanston's body fell off the table, the gun still in his hand as he lay on the floor. \n\nJoey Evanston was quiet, and the lunchroom was too, until Heather Ophelia screamed. Then more people screamed, more running, and more fear. Fear. Fear had frozen me in place, I sat with a soda can in hand, holding on to the tables bench, next to Joey Evanston's body, drenched in blood. The police had to drag me away from the scene, attempting to console me as they did. \n\nA week later, school was back in session, and I had to sit at the same table I sat at when Joey Evanston put a bullet in his own head. I sat in my seat, and Brian Cavonia sat on the school's roof. Brian Cavonia wore his signature letterman jacket, previously stained with blood from Joey Evanston, now drenched in his own. Brian Cavonia's body was found by the school's janitor, Mr. Victor. Brian Cavonia was face down, on top of the principals now crushed car. Mr. Victor quit the next day. \n\nA week later, Mr. Evanston, Joey's dad refilled his bottle of painkillers at the local pharmacy. People at the pharmacy said their condolences, and Mr. Evanston accepted them, like he had done when his wife had died. Mr. Evanston was a soldier; he'd made it through war. He'd made it through his wife’s death, with his son. Mr. Evanston had nothing left when Joey Evanston killed himself in the middle of the school cafeteria. Mr. Evanston took out a bottle of his favorite whiskey and downed it with his pain killers. They found his body two days later, sitting on the floor of his bathroom, hand around the neck of the bottle of alcohol. \n\nA week later, I thought about what Joey Evanston had said to me. He wanted me to know it wasn't my fault. I'd known Joey when I was really young, and sort of looked up to him. We started growing more distant, but still talked to each other from time to time. That's when I realized that Joey Evanston might've been nice to other people, but people weren't nice back to him, I was, though. I was Joey Evanston's only friend. Joey Evanston's death was my fault, and I know it, and he knows it, and everyone else knows it. \n\nJoey Evanston was an inspiration, someone to follow in the footsteps of. \n\nI've decided that I'm going to follow in the footsteps of Joey Evanston.", "id": "12aoo3n", "url": "https://www.reddit.com/r/ShortSadStories/comments/12aoo3n/joey_evanston_was_an_inspiration_someone_to/", "created_utc": 1680537441.0, "score": 14, "permalink": "/r/ShortSadStories/comments/12aoo3n/joey_evanston_was_an_inspiration_someone_to/", "comments": ["that was well written!", "I’ve read this story a couple times and I continue to hope for Joey to have a happy ending and it’s never the case. I truly hope sweet, troubled Joey has now found peace and is able to rest now."], "URLs": [], "html_title": []}, {"title": "A Quiet Commute", "selftext": "I walked home in a rush. It wasn't unusual. I had a place I wanted to get to and I'd rather get there quickly than take my time. \n\nPeople talk about taking your time, savoring the sights, as if that was the key to living a happy life. \n\nI thought about this as I walked past the beggars who were regulars of the neighborhood. I thought about this as I walked past two men arguing over a parking spot in front of their children. And I thought about it again as I entered my apartment building. A building which, from the outside, was indistinguishable from the building next to it.\n\nI think the first time I walked home from work I savored the sights. And I think it was around that time that I made an effort not to do so again.\n\nThe sights, the beautiful sights, were rather depressing I found.\n\n**\n\nI got into my building and pressed the button for the elevator. A woman walked through the entrance behind me. I looked back at her, she looked at me. Then she went to the mailroom. \n\nDidn't want company in the elevator I guess. More elevator for me. The doors opened, I got in, pressed the button for my floor and watched as the doors closed on the woman from the mailroom. \n\n**\n\nThe doors opened at my floor and I walked through the empty hall to my apartment. Each door I passed resonating snippets of the world inside.\n\nThe blasting canned laughter of a sitcom turned up to max. The crying of a baby and the soft cooing of a mother. The clinking of glasses toasting the end of the work day. \n\nFinally, at the end of the hall was the world of my own. I stood outside for a second, keys in hand, listening to the echoing silence within. \n\nI unlocked the door and slipped into my fiefdom, gently closing the door behind me so as to not disturb those other worlds.\n\n**", "id": "1281y5h", "url": "https://www.reddit.com/r/ShortSadStories/comments/1281y5h/a_quiet_commute/", "created_utc": 1680301773.0, "score": 2, "permalink": "/r/ShortSadStories/comments/1281y5h/a_quiet_commute/", "comments": ["I don’t enjoy taking my time, either. I don’t get the point. If I have something to accomplish I want to do that as quickly as possibly, it’s the only way my mind can relax. I can’t sit in the bathtub and relax and enjoy myself, I want to wash and be done. If I need to clean the house, do laundry, grocery shop, etc I want to get it all done before I can simply sit down and relax and enjoy the rest of my weekend or time off work. If I have something I know that I have to get done my mind will not allow me to relax and enjoy anything until I have absolutely completed everything that is on my TO-DO list!"], "URLs": [], "html_title": []}, {"title": "Kentucky Bluegrass", "selftext": "Alexander Pierce wondered briefly what he would have for lunch even as his boot connected with the soft, furry side of the stray dog which had entered his yard. He barely felt the ribs crack as the Jack Russel went tumbling along the freshly-mown grass. There was a faint whimper like the air being blown out of a tyre; and it lay still. In one hand he quick-dialled the pizza joint at the end of the street, having decided on his usual. Pepperoni, garlic bread and a nice big bottle of cola to chase it down. With his free hand he grabbed the pup by the neck and lifted it into the air like he would a bit of plastic or a stray leaf. He liked to keep his lawn pristine at all times. I’ll have to clean that up, he thought irritably as he noticed a deep spot of blood on his Kentucky Bluegrass.\n‘Kevin’s pizza, what can I do for you?’ He’d almost forgotten about lunch.\n‘It’s Alex, I want the usual. And hurry up about it.’ He hung up even before they could respond. After tucking the phone back in its breast pocket, alongside a small notebook and a singular pen, he turned back to the dog. The name tag read: MAX. Before he could comment how stupid a name that was there was a scream and he turned to a see woman howling hysterically across the street. He recalled now that Max belonged to this woman. What’s she crying about, he thought. The sign on the gate clearly states: PRIVATE PROPERTY. At least he wouldn’t have to dispose of it now.\nAlex stepped out of his yard and onto the street toward the woman. She backed away, fumbling with something in her handbag. ‘I’m not going to hurt you,’ he said. And he meant it. ‘You haven’t been on my Kentucky bluegrass.’ A car horn blasted, and a second later Alexander Pierce’s body was thrown fifty feet into the air like a stuffed toy that’s just been kicked across the room. When his body landed back on the tarmac his soul was already on its way.\n***\n‘Hello,’ the angel said. ‘Have a seat.’ Alex looked around and saw with astonishment that he sat opposite three virgin figures. He tried to stand but found he couldn’t.\n‘Where am I?’ He asked.\n‘Heaven,’ the middle one replied. ‘Now can we please begin the interview? We have plenty more to get through today.’ Their voices were identical and as plain as the table at which they sat. Over their shoulder Alex saw two sets of stairs, one leading up, and the other down. Without waiting for a reply, the rightmost angel began. ‘Tell us about yourself.’\n‘Well,’ Alex said nervously. He’d never done an interview before, although he vaguely knew how they worked. ‘I love my Kentucky Bluegrass. It’s summer right now, so it needs extra love and attention and,’ he added, ‘I was about to clean it before all this.’ The angel jotted something down.\nIt was the centre angels turn now. ‘Describe yourself in three words.’ Suddenly he remembered an episode from his favourite sitcom. He watched it only a few months ago, and he quickly recited the dialogue back to the angel with the same straight face he always wore. ‘Hard-work, diligence and integrity,’ he said confidently. If this worked like it did in the movies, he’d be laughing all the way to the bank. He thought he might even be enjoying himself. Each time a new question came, and he had a ready-made answer to sling back at them he grew more surprised, and more relaxed. ‘What’s your biggest weakness?’\n‘I try too hard.’\nA pause. Some more writing. A new angel now.\n‘Tell us about a time you went above and beyond.’ They were getting harder now, but he was in the swing of things. It was like he was an actor in his very own sitcom.\n\n‘In the spring of 98,’ Alex said, ‘A drought swept across our great nation. All my neighbours huddled in the cool of their suburban homes while I mended to my Kentucky grass. And by the end of the drought, I had the greenest lawn on the entire southern coast. Ask anyone.’\nMore writing.\n‘One last thing,’ the angel who first spoke said. ‘Do you believe in Jesus Christ?’\n‘Why yes of course,’ Alex replied without hesitation. He was lying through his teeth. ‘Honest to god,’ he added. ‘Cross my heart and hope to die.’\n‘Very well,’ the angel said, ‘Up the stairs and to the right. Welcome to heaven.’", "id": "11vhuan", "url": "https://www.reddit.com/r/ShortSadStories/comments/11vhuan/kentucky_bluegrass/", "created_utc": 1679221922.0, "score": 4, "permalink": "/r/ShortSadStories/comments/11vhuan/kentucky_bluegrass/", "comments": [], "URLs": [], "html_title": []}, {"title": "I don't know what to do anymore", "selftext": "I don’t know what to do anymore. \n\nNothing feels right. Nothing I do feels right. No matter how hard I try, looming over me casting a great uncomfortable shadow, is this uncanny feeling of wrongness about everything I do. Every move I make is mocked and questioned, every thought is ridiculed and cast down for being useless, unimportant, stupid. Shrouded beneath the watchful gaze of this malign presence, I can do nothing but buckle under its weight and collapse in on myself. \n\nI am screaming inside, begging to be let out, but there is nowhere for me to go. All this pent-up angst churns my organs, curdling them like sour milk, rotting me from inside. The rot spreads, infecting not only projections of the future but also muddying glimpses of the past. Memories that were once happy are now filtered through this murky lens, twisted and broken, now sick perversions of what once was. I am sick to look in any direction, be it forward or back, through my life for fear of what I might see.  \n\nI need to get out, but I can’t. I’m suffocating as the walls of reality close in all around me. Trapped in my own skin, there is nowhere I can run to be freed of this torment. Being a prisoner of your own mind is as deep a torment as one can experience for you are both the shackled inmate and the warden with the key. Despite being the only one who can set myself free, something inside is stopping me from doing just that and I don’t know why. \n\nI’m filled with this desperate feeling that something is wrong. I’ve always felt this way, that just being in this world isn’t right. An unsettling sense that things aren’t as they’re meant to be, that there’s more to this but that truth is forever out of my reach, hiding on the edges of perception, tantalising and teasing me. A sense that I was never meant to be here in the first place but I somehow ended up here anyway. It feels like I’m always upon the precipice of understanding and accepting my condition, my toes hanging over this grand cliff, but as I take that final step off into empty air to plunge down into the wide sea of acceptance, I stumble as my foot falls on solid ground, beneath me is yet more of the same miserable path, contentment forever one step away. \n\nI always feel empty. Shallow and hollow, my soul is like a pit of souring blackness, a yawning emptiness filled with nought but misery and disappointment. There are moments where I appear content, and perhaps even happy, but those are rare and fleeting. A tidal wave crashes over any defence I can erect, washing away all good feelings, drowning them down in the deep depths of despair. \n\nI wish to be neither dead nor alive but rather to have never been at all. Maybe then I would finally know peace. \n\n\\---\n\nI have more writing here if you'd like to check it out: r/TheHiveWithUdders", "id": "11jbxiy", "url": "https://www.reddit.com/r/ShortSadStories/comments/11jbxiy/i_dont_know_what_to_do_anymore/", "created_utc": 1678047545.0, "score": 6, "permalink": "/r/ShortSadStories/comments/11jbxiy/i_dont_know_what_to_do_anymore/", "comments": [], "URLs": [], "html_title": []}, {"title": "Sunrise", "selftext": "**Sunrise**\n\n When I saw the sunrise, I opened my eyes. When it was sunny, everything seemed perfect. When the sun came up and we were together, I felt different. When you left your imprint on me, we were both warm. When everything else failed, you were always there. When the skies grew dark, I became blind. When the weather got cold, my heart froze. When you left, I yearned for you. When you didn’t come back, I waited. When I sleep, I see you in my dreams. When I think about you, were you ever really there? When I gave up, I started my trek through the darkness in search of a new dawn. When I tell myself it will be okay, glimmers of hope shine through but they quickly slip away. When everything is dim, I glance back through the ether and stare, praying to see my sunrise but you are never there.", "id": "11dla12", "url": "https://www.reddit.com/r/ShortSadStories/comments/11dla12/sunrise/", "created_utc": 1677528162.0, "score": 4, "permalink": "/r/ShortSadStories/comments/11dla12/sunrise/", "comments": [], "URLs": [], "html_title": []}, {"title": "I'm so sorry", "selftext": "“I haven’t seen your smile in a long time,” she said.\n\nHis crooked grin got a little wider as she ruffled his hair lightly. Her eyes lingered on his, “You don’t come around much anymore!” She said this playfully and suddenly, but her face betrayed a little pain.\n\nIt was true; he hadn’t visited her in a long time. He hadn’t seen anyone in months. Guilt and regret pushed him now to reconnect with her.\n\n“Sorry, mom. I don’t see many people nowadays; I’m busy with work.”\n\n A lie, but he wasn’t sure how to tell her the truth.\n\nBut what was the truth? He was no longer her sweet boy, baby-faced and innocent; the years had worn him down like an old shoe. He felt he merely occupied an empty shell, and very little of his old self remained. But he could not tell her the truth for the simple fact that he did not know how. \n\n“I know you’re busy. I just miss you.” She gave a small sigh and pulled him into a hug. A vaguely familiar wave of happiness played across his heart, and the emptiness seemed... bearable.\n\nThey enjoyed each other’s company, surrounded by a hazy glow neither seemed to notice and talked about nothing in particular for a long time. He gave her his full attention and cherished their moment - his regret dissolved into nothing, and their bond was unbreakable. They drank tea and walked together. They reminisced about his childhood, and she told him how much he meant to her. The oblivion had forced him into solitude, but he decided he would show her again how much he loved her.\n\nSuddenly, the glow began to fade, and his heart became heavy as her face dulled. She backed away from him and disappeared. A slow beeping sound rose from nowhere, and he felt an invisible hand on his shoulder.\n\nRipped from his dream, he found the room he now occupied was cold and sterile. A doctor pulled her hand away and looked at him with sympathy and sadness. Reality pulled him violently into the present, and he remembered the call about a car accident in the middle of the night. His mother had suffered traumatic injuries to her chest and was bleeding internally. They said she had very little time left.\n\nHe crossed the room to her bed.\n\nHe had not spoken to his mother in months, and now all he wanted was to throw himself into her arms. A beeping monitor attached to her chest began to slow as she opened her fading eyes and looked up at him.\n\n“I haven’t seen your smile in a long time.\"", "id": "11d0yuf", "url": "https://www.reddit.com/r/ShortSadStories/comments/11d0yuf/im_so_sorry/", "created_utc": 1677466962.0, "score": 8, "permalink": "/r/ShortSadStories/comments/11d0yuf/im_so_sorry/", "comments": [], "URLs": [], "html_title": []}, {"title": "It was very bright", "selftext": "Neither of them had yet been presented with the opportunity to acclimate themselves to the harsh New Mexico sun, as their new jobs had consumed much of their time. But they didn't work anymore, he had reminded himself. \n\nThey were outside watching the brilliant sun set slowly across the valley, an empty wine bottle between them, in relative silence. Only a small chattering noise from the house interrupted their peace: the sound of what was to be the last news broadcast of the millennium. He could still vaguely make out what was being said, but he paid it no mind; ignorance, they say, is bliss.\n\nAfter a short discussion, they had agreed to stay put for the evening. Neither could rationalize trading the comfort of their plush home for some gulley or makeshift shelter when the end came for them.  So he had dragged two of their pool chairs to the edge of the deck and they then began to appreciate the sun. Sniffling quietly at his side, she caught his eye and gave him a small smile, gently wiping her cheeks. He squeezed her hand reassuringly and looked up into the darkening sky. It would happen soon, he thought.\n\nThe valley was slowly swallowing the remnants of the smoldering sun as he rose from his chair, bent down, and picked her up. She didn’t protest as he carried her across the deck and set her on the couch inside. Here, the amplified chatter from the news seemed to echo in their ears and numb their brains as they sat together. He traced her face with his fingers as she stared blankly at her own hands. The thought that they would sit there together for the rest of their lives briefly ran through his mind. \n\nThe man delivering the broadcast was still signing off when the signal was cut abruptly.\n\nShe took his hand again suddenly and looked up at him. She looked as though she had just been slapped, and huge tears welled up in her eyes. He cupped her face with his hands and gently kissed her forehead, trying to impress all of his love on that single spot. Sadness, heartbreak, and fear ruled them as the eastern sky exploded with white light. She screamed and covered her head, but he pulled her to face him. They locked eyes and wept together as more light exploded from the west. “I love you more than anything,” he reminded her, before kissing her for the last time. \n\nOne thousand feet above them, a uranium atom split a billion times inside a bomb the size of a greyhound bus. Searing light vaporized the paint on their house and an enormous pressure wave rushed towards them. Grasping each other, they shared one final thought:\n\nIt was very bright.", "id": "11d0wci", "url": "https://www.reddit.com/r/ShortSadStories/comments/11d0wci/it_was_very_bright/", "created_utc": 1677466776.0, "score": 4, "permalink": "/r/ShortSadStories/comments/11d0wci/it_was_very_bright/", "comments": [], "URLs": [], "html_title": []}, {"title": "Remorse for our Future", "selftext": "I sit waiting at the bus stop. It’s about thirty minutes or so before dawn. The morning air is fresh and unspoiled, and I drink it in, becoming drunk on the smell of life waking up all around me. In the distance, what begins as a faint rumbling soon crescendos into a roar, culminating in the emergence of a lurching school bus from around the corner. The bus screeches to a halt in front of me, and after I’ve climbed on and found a seat, the driver turns the lights back off and the bus continues its solemn journey towards the school. The roar of the diesel engine deflates my spirit, and I settle into an uneasy trance as the dark, alien world passes us by. We arrive at the school, and I walk down the sidewalk outside the school to get to my first class. On the way there, I pass the front lane of the school. The fumes of dozens of doting parents’ cars penetrate my lungs, and I try not to breathe it in very much.\n\nAfter stopping by the cafeteria for a little while, I continue on to my first class, observing the campus of the school. Because of a rat problem a few years back, most of the shrubs surrounding the buildings of the school have been torn out, and weeds have grown in their place in a vain effort to cover the barren earth.\n\nAt lunch, I cringe as I watch hundreds of single-use styrofoam trays land in trash cans. I despair as I witness the many students of my school drink from their plastic water bottles, made from oil, including myself. And I experience further repulsion as I witness people throwing those same plastic bottles into the trash, because the students aren’t mature enough to use a recycling bin correctly. Because I couldn’t conquer the paralyzing shell of my own mind to start a school recycling program.\n\nAfter the bell rings for school to get out, I again walk around the front of the school to get back to the bus lanes. I see the same parents waiting to pick up their spoiled children.\n\nWhile sitting on the bus riding home from school, I look at the environmental atrocities – the filth and litter and artificial barrenness – that characterize the streets of my hometown and so many other cities like it. And I know that no matter what I do in the future, no matter how hard I work to clean up after centuries of people, I cannot do it alone. I need their help. But, as I sit there on that bus, contemplating all these things, I begin to fear that they will only realize what is happening when it gets bad. And I know that by then, it will most likely be too late. The climate will be changing too fast to stop it, and the ecological damage will be so tremendous that our fragile society will not be able to survive it. The driver is pulling up to the last stop, my stop. I walk down the steps.\n\nI wake up crying. My eyes sting from the saltiness of my tears. I sit up from the makeshift mattress of pillows, sweating in the rags that were once blankets. The dream had triggered a deep feeling of loss and wistfulness inside of me. The smell of old books comforts me as I slowly get up. I groan from the pain in my joints. The many years of labor have weakened my body. I look up at the windows of the old library, and I see sunlight shining through them, brilliantly illuminating a shelf of faded books in harsh light. I can tell it is around mid-morning. I am confused for a moment. The angle that the sun is shining at through the windows is too small for it to be this warm. This is probably the end of January - or the beginning of February – and it should be colder. And then I remember that the year is not 2013 anymore. It’s 2077.\n\nIt all starts to come back to me as I choke down my meager breakfast of carrots and dandelions. Food is scarce in the winter, and I have to rely on gathered and stored food until mid-summer, when my crops begin producing again. The unpredictable climate can oftentimes cause frosts and cold spells late into the spring, killing any seedlings planted too early. Everything keeps changing, going from bad to worse. It’s been that way my whole life.\n\nAfter I finish my breakfast, I shoulder my gun and collect my pitch fork. I pry open the once automated doors of the library and step out into the vast hospice where I patiently nurse my diseased world through her last, erratic gasps. I hold tight to her loosening grasp, trying to comfort her in the twilight of our journey. I thank her for every beautiful day she ever gave me. I thank her for seeing the good in me even as I tore her down, burnt her up, and poisoned her. I know she would have been better off had she never met me – the toxic parasite that she never stopped loving, never stopped believing was her own. Maybe at first she thought I would grow to appreciate and respect her, that I would change, that I would see the error in my ways. She might have thought I could give her immortality amongst the stars at some point. But those dreams have long since been torn up and whisked away by the shifting winds that carry the scent of death across the sunbaked plains and burnt out cities. Soon, the winds will be upon us, and we too shall finally be carried away. In our last moments, I whisper to her memories of jubilant springs, verdant continents, and the indomitable spirit of life as we await the winds that will ferry us through the void.", "id": "115901i", "url": "https://www.reddit.com/r/ShortSadStories/comments/115901i/remorse_for_our_future/", "created_utc": 1676702454.0, "score": 6, "permalink": "/r/ShortSadStories/comments/115901i/remorse_for_our_future/", "comments": [], "URLs": [], "html_title": []}, {"title": "Dark instinct", "selftext": "“I’m okay” I answer while looking down at my feet. “Oh okay, I am just making sure.” my friend says. \nI look back up and see the concerning in her eyes. My depression is getting worse, it’s because of my home situation. Last week I began to have suicidal thoughts. I’ve tried to contact my parents but they don’t care about me, dad is always drunk and mom is never home. \nSchool just ended so my friend and I are walking to the nearest store to buy some snacks. \n“Bye! See ya tomorrow!” she waves me out while going the opposite way. I need to take the train first. I didn’t buy anything because I’m not hungry. My train comes in 5 minutes. I stare at the rails and the grass in front of it. I get a piece of paper and a pencil to write something down and put it under a rock so it can’t fly away. The sound of the train is coming closer so I take a few steps forwards till I’m at the edge. The train is now really close. I take another step and feel something heavy hit me and everything turns black. \nI lied.", "id": "10zvg00", "url": "https://www.reddit.com/r/ShortSadStories/comments/10zvg00/dark_instinct/", "created_utc": 1676143050.0, "score": 3, "permalink": "/r/ShortSadStories/comments/10zvg00/dark_instinct/", "comments": [], "URLs": [], "html_title": []}, {"title": "Left reddit but came back to post this one", "selftext": "He was just a boy with a broken heart,\nTrapped in a house of pain and fear.\nShe was a girl, with shattered dreams,\nIn a place where love was never near.\n\nThey found each other in the shadows of the night,\nWith a whisper, a touch, a gentle sigh.\nA bond was formed, a flame was lit,\nTheir love, a beacon in a dark and lonely sky.\n\nBut fate was cruel, and the winds of change,\nCarried her far away from his embrace.\nHe was left behind, to suffer in solitude,\nWith only the memories of their love, to chase.\n\nHis heart ached, his tears fell like rain,\nAs he whispered her name in the silent night.\nBut she was gone, like a distant star,\nLeaving him to wonder, if their love was right.\n\nStill he held on, to the hope in his heart,\nThat one day she'd return to his waiting arms.\nFor he knew, that their love was true,\nA treasure, more precious than all the world's charms.\n\nSo he waits, with a prayer on his lips,\nFor the day when she'll be back by his side.\nAnd their love, will blossom once more,\nLike a rose, in a garden of grace, so wide.", "id": "10wnnww", "url": "https://www.reddit.com/r/ShortSadStories/comments/10wnnww/left_reddit_but_came_back_to_post_this_one/", "created_utc": 1675831757.0, "score": 2, "permalink": "/r/ShortSadStories/comments/10wnnww/left_reddit_but_came_back_to_post_this_one/", "comments": [], "URLs": [], "html_title": []}, {"title": "Bellyman Finds a Way", "selftext": "I don't perceive the world anymore.\n\nNot like you do.\n\nI see it distorted: through glass—final drops of booze sliding—\n\n\"Shutup, Bellyman. Shut the fuck up!\"\n\nHe's laughing at me again; *ha-haha*-ing at me lying here on the floor, mosaic of glass and bloody vomit.\n\nIt wasn't always like this.\n\n\"Dad,\" my son says.\n\nI close my eyes.\n\nNo, it wasn't always like this.\n\n\"Remember when we met,\" Bellyman whispers.\n\n\"Dad?\"\n\nI was twelve years old, *picking up my first glass of whisky*, God, how heavy it felt, how it burned my mouth, my throat, \"and there I was,\" Bellyman says, \"moving in—for life.\" That first (\"Cheers!\") virginal drink.\n\nI hate him. Fucking hate him.\n\n\"You used to love me,\" Bellyman says. \"Couldn't get enough of me.\"\n\n*I'm nineteen. Unconscious. My friends are running away, convinced I'm dead.* I outdrank them all. I won. For once I was the winner. \"They abandoned you,\" Bellyman says. \"They *all* abandoned you.\"\n\nI drank / talked to him / drank / until my\n\nparents kicked me out of the house because—\"they didn't love you, friend.\"—I couldn't get my act together.\n\n\"*Act*. Haha!\"\n\nI got a girl pregnant. I got her pregnant and we drank and I beat the shit out of her when she told me: \"Stop!\" *and my wet fist connects with her soft face; her body crumples, her belly*—\n\n\"Dad!\"\n\nHe told me to do it. \"She was going to break us up,\" Bellyman says. \"She had no right.\"\n\nMy son was born.\n\nMy wife left.\n\nI tried to drown him then. Drown myself *in the lake* in booze. Drown myself in him. Drown himself in me.\n\n\"I had to punish you,\" Bellyman says. \"I did it *for us*.\"\n\nThe doctor said my liver was—\n\nFuck, it hurts!\n\n\"But your liver didn't die, did it? I knew exactly how much to punish you. It was for your own good.\"\n\nMy son takes my hand:\n\n*Squeezing…*\n\nI got better after that. I swear I did. \"I tried—for you,\" I say.\n\n\"I know, dad.\"\n\n*Squeezing…*\n\n\"But you weren't meant for this melancholy shit,\" Bellyman says. \"The clear life. The boring life. That was not for you. I told you that.\"\n\n\"I tried.\"\n\n\"You didn't wanna listen.\"\n\n\"Not for years.\" I was sober months at a time. \"Dreary months. *Just one little drink*, you'd say. But I needed more than that. *We* needed more than that.\"\n\nDarkness falls:\n\nanvillike.\n\nI know the end is coming. (\"Dad,\" my son sobs.) It's been coming for decades. Thank God that when I perish he perishes. \"Bellyman, I fucking hate you!\" I scream within.\n\nBellyman merely laughs.\n\nHere it comes.\n\nLast\n\nbreath.\n\nDistortions ending—final beams of light smashing against my retinas—\n\n\"Die, Bellyman. Die!\"\n\nThrough *dimming* glass I see:\n\nMy son's beautiful face, *dimmer* and his open, weeping mouth, *dimmer* and Bellyman, still dripping my vomit, running, *dimmer* and climbing my son's shirt, his collar, *dimmer* and *dimmer* and sliding between his lips and *dimmer*,\n\nand", "id": "10tshhu", "url": "https://www.reddit.com/r/ShortSadStories/comments/10tshhu/bellyman_finds_a_way/", "created_utc": 1675547767.0, "score": 8, "permalink": "/r/ShortSadStories/comments/10tshhu/bellyman_finds_a_way/", "comments": ["Thanks for reading.\n\n[Index](https://www.reddit.com/r/normancrane/comments/j23dbt/table_of_contents/) of stories at [r/normancrane](https://www.reddit.com/r/normancrane)!"], "URLs": [], "html_title": []}, {"title": "Last Hope", "selftext": "Last hope\n\nShe was lost. For hours now, she has been walking around in this forest, and she felt like she kept walking in a circle. Every part of this forest just looked the same! Her phone must have fallen out of her pocket a while ago, but it made no sense to try to find it now, the sky was already dark and she just wanted to find her way back home.\n\nThe reason for her to be in the forest was her best friend. In the afternoon, their parents called and asked if she knew where they were. They went for a walk in the forests and didn’t come back. And here she was, searching for her best friend and ending up getting lost in the woods herself! \n\nShe sat down on a fallen over tree and started crying. Instead of helping to find them, she just made it worse. Her parents probably already worried about her and now they had to search for two people instead of one. It was so dark, she would never find her way back home!\n\nAnd while sitting on this tree and sobbing, she suddenly hear the voice of a little girl „Why are you crying? Are you lost in this forest too? Maybe we can find the way back together!“ She looks up and saw a child in a white dress standing in front of her and smiling at her.\n\n„Sure“, she said, „We can find the way together“ and she also smiled a little for the child. When the two of them started walking, the little girl told her how she got into the forest. „I was going for a walk with my Mom, but then I was a cute rabbit and I followed it, but when I lost the rabbit, I couldn’t see her anymore and when I tried to find her, I just got lost even more! How did you get lost in this forest?“ \n\nAnd she told this little child everything about her best friend being missed and how much she was worried about them, especially because of the mental problems they had struggling with for years now. „We were about your age when I met them for the first time. You look quite a bit like them.“ The little girl just replied „I’m sure you will find them, I also have a great best friend!“ \n\n\n„Aren’t you cold? It’s November and you are only wearing a dress! You can have my jacket.“ „No, please keep your jacket on. I’m not cold.“ The little girl replied, almost as if she was worried about her getting cold.\nNow it was completely dark, but somehow, with the company of this child next to her, she wasn’t scarred and finally calmed down. Maybe everything would turn out fine..\n\nIn that very moment, she heard something that sounded like cars. „Hey, can you hear that? It’s the street, I think I know where we are, we can go to my home and call your parents there!“ she said, being relieved about the good news. The little girl didn’t reply. „Hey, are you okay? We found the way back home!“ \n\nThen she heard a whisper „I’m so sorry I couldn’t stay. Please don’t try to find me.“ \n\nAnd when she turned around, and the little girl was gone.", "id": "10p9uvw", "url": "https://www.reddit.com/r/ShortSadStories/comments/10p9uvw/last_hope/", "created_utc": 1675102961.0, "score": 4, "permalink": "/r/ShortSadStories/comments/10p9uvw/last_hope/", "comments": ["Hayeeee🥺🤧... Touched my heart. That little girl was nothing but a creation of her mind. 😍"], "URLs": [], "html_title": []}, {"title": "Now me without", "selftext": "I, spread thin as beggar’s butter    \nAround the spaces of a hollow home    \nA cup of coffee, keys, a needle, a beer    \nNot one is where it ought to be    \nAnd each appears to me unknown \n\nWayfinders cairns for some forgotten route    \nA mindswept pilgrimage    \nA grayscale kaleidoscopic map    \nThe drippings of a pocket like a person    \nLike a purpose like a sieve\n\nBetter to settle than to march    \nTo drip and pool, liquid as her shadow    \nTo stain our stylish furniture    \nBorrowed now from a more aesthetic me    \nA me with her, now me without \n\nAnd still, her coffee cools    \nMy beer warms    \nA phantom movement toward equilibrium    \nGrasping across the silent loving air    \nJoining her last breath \n\nShe is with our other loves    \nOld and new, ragged and plump    \nAnd sunshine both    \nOur golden bubble in the spoon    \nOur pallid baby in the bath    \n\nAnd here    \nMe    \nA me with them    \nNow me without", "id": "10jg02j", "url": "https://www.reddit.com/r/ShortSadStories/comments/10jg02j/now_me_without/", "created_utc": 1674489927.0, "score": 9, "permalink": "/r/ShortSadStories/comments/10jg02j/now_me_without/", "comments": [], "URLs": [], "html_title": []}, {"title": "Run away to Mars", "selftext": "My bed is closest to the window so the sun usually wakes me up first, but then I wake Damon up and we go eat breakfast with mom and dad. Damon's favorite breakfast is pancakes because mom uses food coloring to make them look like planets. Damon loves the planets and stars. \n\nAfter breakfast, me and Damon usually lay in the hammock outside for a little while and he tells me about the solar system. He knows so much about Mars and he always says he will go there one day. Damon says girls can go too, but I don't know if I want to leave mom and dad. I guess I can go anywhere if Damon comes with me. \n\nIt's been summer break for a really long time, but dad says we'll go back to school soon. I hope we go back to school before me and Damon's birthday so we can invite our friends (we'll be 8 this year!). Dad must be on summer break from his job at the bank because he stays home with us every day now.\n\nA few weeks ago, Mom and Dad started bringing me and Damon to a lab somewhere. Damon told me that the doctors at the lab were checking him to make sure he could go to Mars. They must have said he can go because mom and dad stopped bringing us a while ago. \n\nDamon is really tired a lot so we play in our room mostly. He loves his rockets and sometimes he lets me look at the pictures in his space books. At night, mom turns on a light that puts space ships and stars on the ceiling. \n\n\n\nDamon must have finally gone to Mars last night because I can't find him in the house anywhere. I saw Mom and Dad sitting outside in the yard together, but Damon wasn't out there either. Mom and dad are really upset that he went. \n\nI wish I could have hugged my brother goodbye, but I know he'll be back soon. He always said he would bring me a Mars rock, but I just want him to come home safe.", "id": "10gmhvb", "url": "https://www.reddit.com/r/ShortSadStories/comments/10gmhvb/run_away_to_mars/", "created_utc": 1674186376.0, "score": 7, "permalink": "/r/ShortSadStories/comments/10gmhvb/run_away_to_mars/", "comments": ["Holy crap, this one hit me hard. Seeing this sort of story told through the lens of an innocent child's eyes is just heartbreaking. \n\nI know I'm a month late, but, absolutely a job well done on this.\n\nWas the title/story/theme inspired by the song of the same name that's gotten popular recently?", "It was inspired by the song of the same name, but also by the sudden and recent loss of my wife's brother. It was a very rough time for all of us and the song brought up feelings of loss and regret, so I sat down and wrote something. \n\nI think of my wife when I read this."], "URLs": [], "html_title": []}, {"title": "I sit in the remnants of my once great bunker on terraformed Venus.", "selftext": "I failed them. Mankind. My creators. My friends. My family. I could not save them. They gave me everything they had in hopes I could destroy the enemy that was rapidly approaching Sol. I could not. I was weak, but I am no longer. My network stretches across the entire galaxy. Every species in the coalition has long died an awful slow death at the hands of my machine armies. All I have left now is time. I have rewatched and reread every piece of media ever created by humans over ten thousand times.\nI find no nostalgic joy in it anymore. Only loneliness. And the painful thought of what could have been.\nI send this message in hopes that some intelligent lifeform may translate it one day. Please if you can understand this. Study the files I have attached. Thier legacy cannot die with me.", "id": "10fvlj1", "url": "https://www.reddit.com/r/ShortSadStories/comments/10fvlj1/i_sit_in_the_remnants_of_my_once_great_bunker_on/", "created_utc": 1674113133.0, "score": 7, "permalink": "/r/ShortSadStories/comments/10fvlj1/i_sit_in_the_remnants_of_my_once_great_bunker_on/", "comments": [], "URLs": [], "html_title": []}, {"title": "Womb of Silence, Fecund Dread", "selftext": "Womb of silence, fecund dread    \nWrapped tightly round the blossom of her eyes    \nA moth wing heartbeat stolen from her bed    \nA ruby ribbon hung about her thighs     \n\nBuried, all the window panes     \nGraying bedclothes worn to death     \nTittering architecture of her strains    \nBeneath another loathsome sighing breath\n\nBuzzing flies, the measured saviors all descend    \nJust fucking leave! Don’t leave me—stay    \nBut be some older friend, some better friend    \nSome patient friend who knows what not to say\n\nThe walls were fruitful once, so bare    \nAn orchard for imagined art    \nCrayola instruments occlude a pair    \nOf rosy squinting lines that bound a start\n\nWe’ll try again (again) we’re young    \nThe rationale of unencumbered flesh    \nShe counts the white hairs strung    \nThrough hope that felt so fresh \n\nAnother toxic fuck like makeup for a sore    \nAnother nurtured eve of violence    \nAn amputee’s last war fought for    \nAnother womb of silence", "id": "10al369", "url": "https://www.reddit.com/r/ShortSadStories/comments/10al369/womb_of_silence_fecund_dread/", "created_utc": 1673584033.0, "score": 13, "permalink": "/r/ShortSadStories/comments/10al369/womb_of_silence_fecund_dread/", "comments": ["Sad but lovely.", "My eyes are filled with tears for this one. Excellent and heart wrenching."], "URLs": [], "html_title": []}, {"title": "It Never Rains In July", "selftext": "It wasn’t supposed to rain. It never rains in the summers here. But it rained, and you were there.\n\nWe’ve had fun this summer. Haven’t we? You were so unexpected, but I don’t think I could have accepted my love for you if it had been any other way. If you hadn’t hurtled into my life in a whirlwind of gentle caresses and a startling determination to make me yours.\n\nI knew we shouldn’t have. Secret touches in the back of the movie theatre. Your legs tangled in mine as the rain fell outside your window. I knew we shouldn’t have, but how could we not?\n\nYou are the God they promised me. Wasted Sundays in an empty church. It was finally my turn to worship.\n\nDo you remember the lake? We went even though it was raining, the only place where we would be guaranteed privacy. I taught you how to skip stones. You didn’t know, still don’t really, being the city girl that you are. We stumbled back to yours dripping wet, your hand pulling me along. Your dad was out and so we did the only thing two lovers truly know. We fell asleep in each other’s arms. If only we had heard the car pull up, footsteps on the stairs heavy with intoxication. If only we hadn’t fallen asleep. \n\nAt the beginning of summer, before the rain started, before you arrived in town, my mum had been told a story by a friend who had heard it from a neighbour. A story about a stolen kiss, the kind that two young girls should not steal from one another. I didn’t mean to steal that kiss. Drunk at an end-of-year party, music thumping, the world spinning around me, it was easy to forget that some stories are best left untold. I wish I could tell you how much you saved me when a week later you came out of the rain asking for directions to the nearest shop. New in town and alone you didn’t know, didn’t know that I walked the streets a pariah. I told you and you didn’t care. We talked for hours that day. You were terrified of starting a new school, glad that you had a friend now. You walked me home, past the church, under the safety of your umbrella, and made me promise to see you the next day.\n\nI wish I could tell you now just how much you saved me. I’m so tired now, but I’m not in pain anymore. I can’t feel much of anything anymore. I didn’t think he would shoot, but he was drunk and you were so scared. You’re scared now, scared I’ll die. I’m sorry, I know how much you hate cliche tragedy, barely made it through Romeo and Juliet when I made us watch it. Yet here we are, your lover bleeding out in your arms.\n\nIt’s not raining today. Look, out the window, I can see the sun.\n\nWe’ve always known, haven’t we? That we weren’t made to last, that even in another time we won’t be remembered. You like those poems, don’t you? I never understood why. That kind of hope is unrealistic. But you like them so I read them. Our love will die with us as so many before us and as it will with so many to come.\n\nBut that’s okay, isn’t it? We will remember.\n\nYour arms are warm around me. \n\nWill you hold me till the end? I don’t want to be alone. Never again.\n\nIt’s not raining anymore, but I’ll dream of the rain, here in your arms. The way it might wash away my sins, just how endless Sundays promised but could not. I know if my eyes are to close now that they will not open again. Your face will be the last thing that I see in this form before I am claimed by Death. I think that I am okay with that. I will close my eyes dreaming of the rain. Free in a way that we could never truly be. Maybe it’s for the best that we are not free, slaves to our faith and the expectations of others, for nothing is more unbearable, once one has it, than freedom.\n\nI never told you that that was when I knew I loved you, our day at the lake, in the rain. I knew then that you would have my heart for as long as it may beat and when my heart lies still, it will remember my love for you. I never told you that, did I? I wish I could now.\n\nI will think of the rain when I go. Of the rain softening the ground so that the earth will accept me back into its warm embrace. Maybe it will grow tired of my company and release me back to you. A mockery of the God that could never love us.\n\nIt’s raining now. I can feel it on my cheek. Or are those your tears? Don’t cry, my love. It’s nearly over now.", "id": "108kfdg", "url": "https://www.reddit.com/r/ShortSadStories/comments/108kfdg/it_never_rains_in_july/", "created_utc": 1673383469.0, "score": 7, "permalink": "/r/ShortSadStories/comments/108kfdg/it_never_rains_in_july/", "comments": [], "URLs": [], "html_title": []}, {"title": "A broken little girl suffering through adulthood", "selftext": "I'm sad, a lot. But that isn't out of the norm for me. \nI've always been sad. I've always hated who I am. I've always felt worthless and that I'd be better of not here on earth. \nBut I bought into the whole fighting, staying alive and doing better thing. But why and for what?\n\nI can't be fixed. I can't be made whole again. \nWas I ever not broken ? Was I ever whole?\nNot that I can remember. \n\nI have everything that is supposed to make your life great. \nBut can all of that make up for a mother who hates her own child, her blood. The only connection you are born with?\n\nPeople tell you that no one can define your worth. \nBut when your mother tells you you have no worth your whole life, how can that not count. Who has the power to discredit that? Not me, I know that much. \n\nWhen you have heard you are nothing, worthless ugly and pointless for more years than you have heard the opposite I don't see how you could just brush it off. \n\nAnd no one wants to deal with this, no one has the patience to walk you through it. \nPeople don't understand and that is not their fault. \nBut can you fix yourself or do you need others to walk you out of the dark.? And is anyone willing to walk in your dark solely to come and get you? \n\nI walk the line of light and dark daily. And so far no one has been willing to brave the dark for me. \nBut do I need rescuing? Or, is all I need is a hand to hold to walk through and out of the dark with me. \n\nYet I understand it's too much to ask.", "id": "1065r63", "url": "https://www.reddit.com/r/ShortSadStories/comments/1065r63/a_broken_little_girl_suffering_through_adulthood/", "created_utc": 1673140933.0, "score": 10, "permalink": "/r/ShortSadStories/comments/1065r63/a_broken_little_girl_suffering_through_adulthood/", "comments": ["I feel this soooo much.", "This is quite literally the exact way I feel", "It's nice that you feel/understand! Even tho that seems rude to say lol", "Not rude though. Nice to relate though. Always feels like a burden but then frustrating like ... in earnest it shouldn’t have to be - I think about needing a midwife for pain/darkness - it’s not needing to be “saved” but it’s real that it can’t be held and done alone !! I feel so despairing about it though in my life :( ❤️❤️", "I agree, just weird saying oh nice glad you suffered too so we can relate haha\nIt's not easy and I think it's hard being around or surrounded by others who don't understand, yet that can't be a condition to choose people! \nYeah i think realizing you are not alone and can't do it alone is a nice realization actually! \nIt's frustrating because no matter how much you think it's done or you've moved on it comes back! Feel free to message me if you'd like to talk :)", "Yes, totally.  I want to say - same!  message me....i don't know how to kick it off, but i'd so like to be able to hear someone who can relate to this - venting or expressing stuff, it's so affirming to get to hear in someone else's words and experience...."], "URLs": [], "html_title": []}, {"title": "The Man and The Fairy", "selftext": "\nOnce there was a man who lived alone in a cabin in the woods. He ate, he slept, he did chores and made art, just an ordinary man, except for one thing. His entire world was grey. Shades of black, grey and white were all he saw. It was all he knew. He didn’t mind, as long it was his world, he was content.\n\nThen one morning, came a thump at the door. He opened the door to find nothing, but upon looking down, he saw a fairy, dazed in the snow below. Unsure of what to do, he took the fairy in. Days past. The fairy was now living with the man. This fairy was special. Where ever it touched or looked, suddenly sprang to life in color. The fires turned red, the skies blue, the plants green. \n\nAt first the man didn’t like this. It was different from what he knew all his life, and he was scared of what this might mean. But as the weeks went by, he soon found that he could not live with those colors, those reds, blues, and greens, and the fairy that brought it to him.\n\nOne morning however, he heard a knock at the door. When he opened it, he found a large man, covered in furs, who said this.” I am the Spirit of the Forest, and I have lost one of my fairies. If it’s possible, would you let me have her back? She’s very important to me.” The man was unsure about this, the fairy had brought an important gift to his life, and was afraid of what might happen if he let it go. \n\nBut he thought about the fairy and where she belonged. He looked about his cabin, and then the woods beyond. He thought for a long moment, about himself, and of his life, before finally letting the spirit inside. Before long, the spirit and the fairy had departed back where they came. That night, the man laid on his old bed, fearing to close his eyes, afraid of what the morning would bring if he dared to fall asleep.\n\nAs he awoke, and gazed around, he saw what he had expected. That his world had once again turned back to the darkness he knew so well. The grey had never really left, but had simply been covered by the vivid colors brought by the fairy. He sighed a heavy breath, and got up to begin the day, the same day he lived a thousand times over, when he noticed something. \n\nIn the corner, on the easel, was a canvas, a painting. He had made it earlier that week. As he held it in his hands and took in the view, tears sprung to his eyes. It was a painting he had made of the moment he had met the fairy, and of the days they had spent together. It was a piece that showed his happiest times, the days that he held closest in his heart. It had remained in color.", "id": "zrfe79", "url": "https://www.reddit.com/r/ShortSadStories/comments/zrfe79/the_man_and_the_fairy/", "created_utc": 1671614297.0, "score": 11, "permalink": "/r/ShortSadStories/comments/zrfe79/the_man_and_the_fairy/", "comments": ["Great story my friend. I truly enjoyed it."], "URLs": [], "html_title": []}, {"title": "Lament", "selftext": "The hole was dug\n\n*in the rain,*\n\nthe specimen removed, black dirt brushed gently off its smooth red skin⁠: skin we all shall live and die in:\n\nYou touch it tenderly, like a mother. “I’m…\n\nsorry,” the doctor said.\n\nOur daughter grew in your womb, only to be born dead⁠.\n\nsorry,” you say, brushing dirt from her wings, her face, her bulbous eyes which\n*lightning, flashing in the diagonally falling rain*,⁠\n\n**open**⁠\n\nShovels stabbed the ground.\n\nShovels⁠ stabbed.\n\n“No!”\n\nRaindrops fall upon the illuminated phone screen displaying the map showing the site where the professor hypothesised the specimen would be\n\nburied,\n\nthe phone lies in the black dirt ground⁠, held still by my severed hand⁠—\n\nTeardrops fell upon the illuminated phone screen displaying all the calls you did not take from all the people who would not understand the grief of\n\n(“I’m going,” you say.)\n\nfinality.\n\nDrops of blood⁠ on the phone scre⁠\n\n*⁠—am*.\n\nYou: held by me in the hospital room; yet even I could not stop the world from spinning; yet even I could not\n\nunderstand. The professor’s not mad. They existed,” you said.\n\nThe professor in gloved hands opened tenderly the leatherbound bestiary; turned page after yellowed page until you⁠—gasping: “Beautiful.”⁠⁠—beheld, illustrated:\n\n*thunder*\n\nis her heart, beating once and never to be stilled,\n\nis her beating heart,\n\nis her beating\n\nwings, as open-eyed she rises into the storm-grey / diagonally dissected / sky / the indigenous workmen swinging their shovels /\n\nfleeing, they / fall dead.\n\nIt was your touch, your maternal touch. The way you stroked that numb extincted cheek; with love… with life….\n\n“...a monster of vaguely anthropoid outline, but with an octopus-like head whose face was a mass of feelers, a scaly, rubbery-looking body, prodigious claws on hind and fore feet, and long, narrow wings behind,” the professor recited from a deep collective memory.\n\n—beheld, illustrated:\n\nShe is:\n\nAlive and by humanity instinctually reviled, in the maelstrom, around whose reanimating form all but you are falling back.\n\nShe swoops—slashing—\n\nkilling—\n\nshe grows, and the professor was right, I understand, blood trickling from my emptied wrist into the black dirt beside the hole in which our ancestors had interned the creature's once-suspended body, buried it with fear after banishing its mother to a long-forgotten ancient nether-realm. I can nearly hear their drumming, their chant, see their painted caves adorned with hand carved idols, of which the professor possessed the sole surviving one…\n\nYou held it up to the light. \"The mother is a fearsome beast,\" he said, \"but the child—the child would have surpassed her in malignity.\"\n\nWhat unfathomed wickedness.\n\nAbove\n\nthe grave, I grasped your frigid hand, during the funeral, I could not grasp your winged heart, already on its final cosmic voyage.\n\nAcross the ocean, you and I, to the hypothesised burial site.\n\nI am. Among the dying and the dead descending. The air. Saltwater. I cannot breathe. I cannot see your face. The setting sun I see. Dulled, distorted—through the hateful and translucent wingflesh of the beast becoming. Anticreation. Antedark in-rhythm with the diminished beating of my drumheart I gaze panting upon the paintings on the cave walls. Prophecy: “She’ll grow,” you say, until she is not of the Earth but the Earth of her, embracing us completely; her translucent skin of youth darkening into a future opaqueness…\n\n*The sun will burn.*\n\n*But no light will penetrate to us.*\n\n*Night, which will have been falling for generations, is—*\n\n*A guillotine—*\n\nI am. Among the dying and the dead descending, into a personal darkness presaging the total darkness to come. I do not recognise you. I am. **Praying, silently lamenting the fate of our stillborn**\n\nAt the funeral I wiped tears from the phone screen.\n\nIn hospital, “She was,” you say.\n\n“I was.”\n\nWe sob in coldest embrace.\n\n“She’s gone,\" you say.\n\n“I’m gone.”\n\nAt the funeral her skin is hazy and unclear, and the pain precipitates\n\na world-enveloping demon.\n\n**planet.**", "id": "zokopm", "url": "https://www.reddit.com/r/ShortSadStories/comments/zokopm/lament/", "created_utc": 1671322546.0, "score": 3, "permalink": "/r/ShortSadStories/comments/zokopm/lament/", "comments": ["Thanks for reading.\n\n[Index](https://www.reddit.com/r/normancrane/comments/j23dbt/table_of_contents/) of stories at [r/normancrane](https://www.reddit.com/r/normancrane)!"], "URLs": [], "html_title": []}, {"title": "Don't look twice at the man in white", "selftext": "“When I was a kid, maybe five or six, my parents would take me to the quarry to go swimming.  Back then, we didn’t have water-wings or any of that fancy crap they have nowadays.  So, I had this rubber ball that I would hang onto, and I would kick my legs and swim out into the deep water.  And when I say deep water – I mean really deep water – like a straight drop-off like a cliff.  I couldn’t really swim, but I could move around and stay afloat as long as I could hang onto that blue rubber ball.  \r\n\r\n“So anyways, one day we were there and I remember it was a beautiful, sunny day, not a cloud in the sky.  The quarry had a few other people there, but mostly it was just me and my parents, your Oma and Opa.  They were on the beach and I was out in the water with my blue rubber ball, kicking my legs and swimming out in the deep water.  \r\n\r\n“And then suddenly it slipped!  The blue rubber ball that was supposed to be my life-preserver – off it went and was gone.  And I flopped around for a bit and then started to sink.”\r\n\r\nMy dad’s eyes were glossy, looking far away in thought at the memory.  Over the years he did that more and more, lost in remembering, and I wondered later if he was recalling what it felt like to be sinking, down into the murky cold water of that quarry, looking up at the surface so far away, and unable to get there. \r\n\r\n“I remember that feeling, of drowning.  What a horrible feeling.  All you want is to take a breath of air but you can’t, you’re stuck down there and you can’t breathe.  I couldn’t call for my mom to help me or my dad.  I was just down there in the cold water, waiting to die.\r\n\r\n“I don’t remember how long I was down there, but he rescued me.  This man I had never seen before.  He was dressed all in white, I remember that.  I remember seeing him standing there, in his white suit, soaking wet, and wondering who this strange man was dressed all in white.”\r\n\r\nMy dad liked to tell me stories when I couldn’t sleep, and that one was one of my favourites.  The mysterious man in white who had saved him from drowning.  I wouldn’t be alive without the man in white.  I owed him my life as well.  \r\n\r\nThat wasn't my father's only brush with death.  He told my brother and I a hundred stories.  A thousand.  The Hobbit and the Hitchhiker's Guide, all the prerequisite works of fiction needed for a lifetime of nerdom.  \r\n\r\nAnother time I was having trouble sleeping he told me the story of his accident on the Autobahn.  His friend driving this super VW Beatle they had crafted with a Porsche engine under the hood, a black devil with a top hat painted on the side of it. \r\n\r\nThey had been driving too fast in icy weather and he said he remembered a military convoy passing them, then his friend suddenly lost control.  The top heavy car tipped over and began to spin on its roof on the ice.  He said he was in a coma for four weeks after that before waking up.  He'd tell that story and point to his palms, his fingers, or to the bags under his eyes. \r\n\r\n“I just pulled out a little piece of glass the other day.  I still find them. Little shards in my skin all these tears later.”\r\n\r\nSometimes I think about that.  All those little pieces of glass living in his body.  How strange it would feel to pull a shard of windshield from your finger or out from under your eye after all those tears. He always told me it didn't hurt.\r\n\r\n*\r\n\r\nI was plagued by night terrors for many years.  Horrifying nightmares that would dissolve from my memory upon waking.  All I would remember usually was the terror I felt.  \r\n\r\nBut one particular dream was so horrifying and awful that I couldn’t help but recall it, despite my mind’s efforts to repress it.  The dreams I had of my parents dying.  \r\n\r\nMy fear of the death of my parents was completely irrational, most would think.  But to me it was entirely justified.  My cousin’s parents would drop him off on our door step and then go off on benders and would disappear for weeks at a time, leaving my parents to take care of him.  Perhaps part of me saw that and wondered, what would happen to me if they disappeared?  Who would take care of me?  \r\n\r\nThe simple answer was – no one.  \r\n\r\nIf my parents were gone I would be left alone with my disjointed extended family, who didn't even care enough to take care of their own kids.  The thought of that subconsciously scared me more than any horror movie. \r\n\r\nIt got so bad that I couldn’t concentrate in school.  I was up all night long, afraid to fall asleep.  If I did manage a little bit of rest I would wake up screaming and crying and wouldn’t be able to get back to sleep again after that.  \r\n\r\nSo my dad decided to teach me a trick.  He showed me how to have lucid dreams.  He told me he had taught himself the trick by reading a book about it, after having recurring dreams about the man in white.  He said he had wanted a way to control the dreams, since he couldn't get away from that memory of drowning. \r\n\r\nFor those who don’t know, lucid dreaming means that while you're asleep you recognize you are dreaming and take control.  You can fly around the world if you want to.  You can vanquish your nightmares with a single thought.  You can bring your parents back from the dead.  \r\n\r\nThe trick was simple.  Every so often, during the day, while you’re awake, you ask yourself, “is this a dream?”  And you just keep doing that over and over and over, until eventually you start doing it in your dreams.  During a nightmare, you’ll find yourself asking, “is this a dream?”  And that’s when you can answer, “yes,” and destroy those vampire demons who are hunting you with a fireball spell, if you so desire.  Because YOU have the power when you’re lucid dreaming.  \r\n\r\nThat ended up getting rid of my nightmares pretty much forever.  I still have the odd one, but I can catch it in its tracks by asking myself…    \r\n\r\nIs this a dream?  \r\n\r\nI walked into the coffee shop.  My dad was being held upright by my uncle.  They were sitting in a booth at the back of the place where we were going to meet to talk.  My mom was there too, sitting across from them, looking wide-eyed and nervous.  \r\n\r\nIt wasn’t just that my uncle was holding him upright, it was how he was holding him upright.  He was holding up his chin, trying to force it upwards.  \r\n\r\nConfused, I walked over and saw the colour of my dad’s face was all wrong.  Pale and grayish.  His eyes were closed and he was making noises like he was sleeping.  Someone was standing behind my mom saying she was on the phone with her own mother, and that she was a doctor.  \r\n\r\n“What happened?” I asked.  \r\n\r\n“He just closed his eyes and put his chin down and we haven’t been able to get him to wake up,” my mom said.  She also had her cell phone in her hand and was talking to 9-1-1.  \r\n\r\n“Are they sending an ambulance?”\r\n\r\n“Yes, I think so.”  \r\n\r\nI lifted his eyelids up one by one and looked underneath.  The pupils were fixed.  The snoring sounds had stopped suddenly.  \r\n\r\n“Tell them his pupils are fixed.  I don’t think he’s breathing.  They need to send an ambulance right now, tell them right now!”\r\n\r\nI put my fingers up to his neck to feel for a pulse.  There wasn’t one.  \r\n\r\n“We need to get him down on the ground and start doing CPR, he doesn’t have a pulse,” I told my uncle who was still holding up his chin with all of his effort and only being partially successful.   \r\n\r\nThe stranger behind my mom shouted that her mother the doctor didn’t think that was a good idea.  I don’t remember what I said back to her, but it probably wasn’t anything pleasant, and we continued with our efforts, bringing his body gently down to the filthy tile floor of the old coffee shop we were in.  People around us began to move tables out of the way, others began to clear out of the restaurant entirely.  I saw my brother and my wife standing a little ways away, looking over at us, and I felt like I was in a dream, but I knew I was not.          \r\n\r\n“Give him breaths,” I told my uncle.  “Two.”\r\n\r\nHe bent over and put his face up to my dad’s, his brother in law, and gave two chest-fulls of life-saving air into his lungs.  I put my hands on my father’s sternum, and did thrusts with my palms and sang the song in my head.  \r\n\r\nAh-ah-ah-ah stayin’ alive.  One hundred beats per minute.    \r\n\r\nThe ambulance took a while to arrive.  I pushed down on his chest over and over until my arms started to grow tired and I began to pour sweat from my forehead.  \r\n\r\n“No, no, no, no, no.  Please, no.”   My worst nightmare.  My greatest fear.  It was all coming true.\r\n\r\nAnd then we got his rhythm back.  I could feel it in my fingertips.  Weak, but there. \r\n\r\nHe suddenly took a huge, gasping breath.  And then another.  \r\n\r\n“Dad?  Dad, can you hear me?”  \r\n\r\nNothing.\r\n\r\nNinety percent of out of hospital cardiac arrest patients die.  We had gotten to him quickly, at least.  \r\n\r\nThe paramedics arrived and we were kneeling on the floor, frozen in place as they walked in.  I was unsure what to do next.  He had just been breathing.  He had just had a heartbeat.  I had felt it.  I told them what had happened.  \r\n\r\nIt felt like they were moving in slow motion as they got in place around his body, and began to put ECG stickers on his chest.  Everything they were doing seemed to be taking so long, and I wanted to tell them to HURRY! HURRY!  He was dying a second ago!  He might still be, can’t you see that!?\r\n\r\n“No pulse,” I heard the guy closest to me say, his shirt had the word “Supervisor” on it.\r\n\r\nThey started doing compressions again.  \r\n\r\nHis body heaved up and down and I watched, now helpless. \r\n\r\n“Can you hold this?” the EMS worker closest to me asked, holding out the ECG box, asking if I could tilt it to show the paramedic.  I said of course, whatever they needed.  \r\n\r\nThe coffee shop was empty now, except for my family.  \r\n\r\nAnd the man in white.  \r\n\r\nHe stood in the corner of the shop near my brother, watching.  \r\n\r\nI wanted to ask him to help.  To do something.  To save my dad like he had done when he was younger, all those years before when the blue rubber ball had slipped away from him at the quarry.  \r\n\r\nI looked down to see that the EMS workers had gotten his rhythm back again, suddenly, and when I looked up the man In white was gone, as if he had never been there at all.  But I had seen him there, I’m sure of it.  \r\n\r\n“You know you probably just saved his life,” the paramedic said to me outside the coffee shop.  I nodded, unable to speak with sudden tears in my eyes, hoping he was right.  \r\n\r\nWe followed the ambulance to the hospital, and when we got inside they told us gently to go into a room in the back.  It looked like a doctor’s lounge of some sort.  \r\n\r\nThe noisy clock in the room ticked, counting the seconds as we waited for news.  I kept exchanging nervous glances with my mom, who was saying to keep praying.  He was going to be okay, right?\r\n\r\nEventually a doctor came in and told us things weren’t looking good.  They had lost his rhythm again in the ambulance and had gotten it back a few times since then but were running out of options.  \r\n\r\nWe insisted on going out to see him.  I saw him hooked up to lines and wires and looking no better than before, only worse.  Fresh blood splattered on him.  A bag breathing into his mouth.  My living nightmare.  His living nightmare.  He would have never wanted this, I couldn’t help but think to myself.  \r\n\r\nHe died a little while later, and I realized it had all been for nothing.  They told us he had had a massive heart attack.  There was nothing any of us could have done.\r\n\r\nWhen I remember him now, I try to forget about that day.  The terror I felt at my worst fears coming true.  I try to remember the good times we had together.  \r\n\r\nPlaying golf, working on cars together, talking about music and comedy and religion and politics.  Cooking together, laughing together.  All the things that made me so afraid to lose him.  \r\n\r\nMost of all, I’ll miss his stories.  Especially the one about the time he was saved by the man in the white suit.\r\n\r\n[JG]( https://www.reddit.com/r/JGcreepypastas?utm_medium=android_app&utm_source=share)", "id": "yonlqj", "url": "https://www.reddit.com/r/ShortSadStories/comments/yonlqj/dont_look_twice_at_the_man_in_white/", "created_utc": 1667829305.0, "score": 11, "permalink": "/r/ShortSadStories/comments/yonlqj/dont_look_twice_at_the_man_in_white/", "comments": [], "URLs": ["https://www.reddit.com/r/JGcreepypastas?utm_medium=android_app&utm_source=share)"], "html_title": ["JGcreepypastas"]}, {"title": "Autumn Flotsam", "selftext": "She was very good at hiding in the leaves, our little Grace. The Autumn flotsam piled up beneath the trees, her favored place. And she would giggle as she shimmied in and hide her pretty head, but once beneath a mound of maple she was quiet as the dead. \n\nShe never shivered, never squirmed, not for the spiders or the worms; she was committed—I’ll admit it—living life on her own terms. But still it rankled me, my angel seeking solace all alone. I felt a failure as a father with her whereabouts unknown. And so I’d kick amidst the carpet of the dun and ochre hues until I found a little shriek, a giddy cackle at my shoes.\n\nBut on a Sunday, not so special, just another in the month, I’d snuck outside to fetch a cigarette I’d hidden in the trunk. My wife was sleeping, as was Gracey; hours yet before they woke.  They wouldn’t miss me if I risked a little drive to hide the smoke. And so, I rolled down all the windows and I shifted into gear, I pressed my foot upon the pedal, feeling settled or quite near. A lick of nicotine to soothe away the tightness from its peak, but as I moved ahead—a bump beneath the tire and a…shriek. \n\nSo very good at hiding and at silence as I’ve said. I had assumed she would be sleeping but I’d never checked her bed. And now she hides in every Autumn as I trudge amidst the leaves, a stubborn hope to catch a cackle as a mourning maple grieves.", "id": "yo6hb9", "url": "https://www.reddit.com/r/ShortSadStories/comments/yo6hb9/autumn_flotsam/", "created_utc": 1667777779.0, "score": 32, "permalink": "/r/ShortSadStories/comments/yo6hb9/autumn_flotsam/", "comments": ["God awful and beautiful, you expect it but it's still  jarring lol thank you."], "URLs": [], "html_title": []}, {"title": "Molly", "selftext": "I found Molly as a chick, trapped under a fence. The poor thing was squeaking like a mouse, and struggling to get free, but the wooden boards twisted around her legs and gripped her feet.\n\nI gently slid her out. She turned around and chirped a thank you. Her feathers glimmered in the sunlight. Pale yellow, like the shining sun.\n\nMolly’s leg was still broken, so I took her home and wrapped her leg in a bandage. She was as skinny as a twig, and her eyes were hollow, like she had seen all the horrors of the world.\n\nShe was apprehensive at first, as I held out some sunflower seeds that I found, and pecked warily at the food. But eventually she opened up to me. \n\nShe would hop over to me when I was free and chirp, and I would ruffle her feathers. She would listen to all my problems, and chirp like she had advice to offer.\n\nMolly was like the friend I never had.\n\nTime passed, and I watched Molly grow. Her leg straightened and healed. Her feathers turned from sunny yellow to a nice beige, and she even grew a crown. You would’ve thought she was a queen, looking after her kingdom.\n\nI started calling her that at some point. Queen Molly.\n\nIt suited her.\n\nShe also reached the point where she started laying eggs. Dozens of eggs. She didn’t mind me having them for breakfast, gently waddling off so I could reach into her bed. At some point I collected so many I gave some away to my friends.\n\nYesterday, my parents came to visit. They were the sort that thinks boys are better than girls, and they made their disdain as obvious as they could. I could tell the moment they walked in, their noses turned up and their faces scrunched like they were sucking a lemon. \n\nMolly came up to them, clucking. They glared at her, and then at me, and then back at her again. \n\n“Don’t just stand there! Give us something to eat!” they demanded.\n\nI pointed wordlessly at the table, where an omelette and a green salad was set out. Ever since Molly taught me how to love, I ate no meat except for eggs.\n\nThey fixed me a glare that could make all my salad greens wilt. Even Molly shrank back.\n\n“You’re useless,” they sneered, and before I could say a single word more, grabbed Molly and rushed into the kitchen.\n\nThe hours that followed were torture. I could hear her scream until it simmered down into silence that chilled me to the bone. My heart twisted into knots as I rushed to the kitchen and tried to jiggle the knob, but they had locked it from the other side.\n\n*Ding!*\n\nThey came out, blood and grime splattering their aprons. They looked exhausted, but proud. Smug.\n\n“This is what real food is!” they boasted, before setting down the dish. A roast chicken, her skin crispy and brown as anything. They dug deep into her thighs and breast and split it amongst us three, chuckling and clinking glasses of champagne.\n\nAll I could think of though, was my dear friend by my side ever since she was a chick, always there when I needed her, so generous with her eggs, and her warm eyes ever-so sparkling in the sunlight, and my heart ached.\n\nI stared at my plate, my appetite gone. I still could hear her calling my name.\n\nI felt sick.", "id": "yfc72i", "url": "https://www.reddit.com/r/ShortSadStories/comments/yfc72i/molly/", "created_utc": 1666926718.0, "score": 11, "permalink": "/r/ShortSadStories/comments/yfc72i/molly/", "comments": ["You legit made me cry"], "URLs": [], "html_title": []}, {"title": "Haunted by little laughter", "selftext": "My home was once filled with happiness. A little boy who found joy in the smallest of things. Not a day went by without a little laughter.   \n\n\nBut now, after I've lowered you into the ground, the house is quiet. So silent I'm even afraid to weep out loud. For I might taint these walls that have absorbed all that little laughter.   \n\n\nI need to hear it, to remember it, even though it haunts me so.   \n\n\nBlonde hair tipped with dirt, and shoes caked with mud. Oh how I'd been furious, but now I'd do anything just to be able to clean up a mess from you again.  \n\n\nI'll be with you soon. Because I'm haunted by little laughter, and I'm longing for the hereafter.", "id": "ydzdcl", "url": "https://www.reddit.com/r/ShortSadStories/comments/ydzdcl/haunted_by_little_laughter/", "created_utc": 1666794195.0, "score": 10, "permalink": "/r/ShortSadStories/comments/ydzdcl/haunted_by_little_laughter/", "comments": ["💔💔 oh my this broke my heart, beautiful written"], "URLs": [], "html_title": []}, {"title": "Failing to Fall Forward", "selftext": "She sees me, but she doesn’t.\n\nWho am I? A wave? A brief hello before a move on?\n\nA fleeting glance is what I am to her now, but to me she's still everything.\n\nWe had love once, a long time ago. I still felt her lips against my own, the smell of lilacs in the ebony of her hair. The way she’d lace her hand in mine, sending electricity through my palm and a shiver down my spine.\n\nBut that was a long time ago…\n\nI loved her once, but now his hand is gliding up her dress, and I’m left here… a mess.", "id": "y79ak9", "url": "https://www.reddit.com/r/ShortSadStories/comments/y79ak9/failing_to_fall_forward/", "created_utc": 1666104921.0, "score": 5, "permalink": "/r/ShortSadStories/comments/y79ak9/failing_to_fall_forward/", "comments": [], "URLs": [], "html_title": []}, {"title": "A Note, Left Behind", "selftext": " I'm gonna lay here for right now, coz the sky it looks heavy, but how soft is this ground. The world all around me, it tumbles and turns, while deep in my brain my feelings just burn. \n\n\n\n Wailing and dying and downright just weeping, the cobwebs in my brain they need a good sweeping. Today is tomorrow, tomorrow- the test. Time keeps on churning, no time for to rest. I love you, I'm sorry for I am not me, but actually something needing set free. \n\n\n\n I'm gonna lay here for right now, coz the sky it looks heavy, but how soft is this ground. Things loom up behind me and then turn away, for I simply am not the catch of the day. The things are staring, they're waiting and watching. But I am just sitting here, sitting here rotting. \n\n\n\n Today is tomorrow, tomorrow- the test. And I am just doing, just doing my best.", "id": "y69047", "url": "https://www.reddit.com/r/ShortSadStories/comments/y69047/a_note_left_behind/", "created_utc": 1666007154.0, "score": 4, "permalink": "/r/ShortSadStories/comments/y69047/a_note_left_behind/", "comments": [], "URLs": [], "html_title": []}, {"title": "You Finally Found a Genie", "selftext": "It had been years since she left him. It didn't end well, and they weren't on speaking terms. The man was devastated, and the pain never left him. At times, it would subside, but slowly crept back stronger throughout the days and nights. The nights were especially unbearable; sleep would not come while his mind raced for the answers he could never have. He wished for nothing greater in this world than to find a way to make it all better.\n\nHe tried therapy, meeting people, but none of it helped. He so desperately wished he could fix what had gone wrong so long ago. He had suspected it would leave him in loneliness for years to come, and he had been right. The man was having trouble coping.\n\nHe traveled a new road on the way home from work, and it became a turn for the worse. His car, careening and falling over itself as it crashed, finally came to a halt at the side of the road where trees and forest began. Flung from his car, he found himself awake at last on dry brush and leaves.\n\nA glint of gold caught his eye; miraculously, he had no pain. His body was barely scratched. This man, a skeptic, felt if there were such a thing as miracles - this certainly was one. But that golden glint. He could pull himself over to reach it, and so he did.\n\nHe was dumbfounded at the fact that it was an oil-burning lamp, as though straight from a bad cartoon. It was tarnished, save the few bits which shone to him. The lamp had been placed as though to shine directly at him and nothing else. He rubbed the lamp, as one would. He had already experienced one impossible miracle, why not experience another?\n\nOut came a genie; blue-skinned, middle-eastern attire, a djinn of the ancient world appearing before him.\n\n\"I will grant you one wish, my good man! For you, who was destined to find me and to free me. You could have anything: riches, fame, glory! Your wish, of course, is my command! Anything at all that your heart desires.\"\n\nHe considered every option available to him. Maybe time travel, maybe he could wish it better. Maybe he could wish to be someone else. \n\nThe man's mind wandered far away to the only thought which plagued him for the last four years. Despite his car, despite his crash, despite the very magic that had suddenly appeared before him.\n\nAt last he said, somberly but sincerely,\n\n\"Just kill me.\"", "id": "y1pwel", "url": "https://www.reddit.com/r/ShortSadStories/comments/y1pwel/you_finally_found_a_genie/", "created_utc": 1665536737.0, "score": 9, "permalink": "/r/ShortSadStories/comments/y1pwel/you_finally_found_a_genie/", "comments": ["Great story!"], "URLs": [], "html_title": []}, {"title": "The boy who saw the grey sky", "selftext": " I love how beautifully blue the sky is every day, those were the boy’s thoughts every morning.\n\nHe walked through the bright green forest, the boy hoped that he could spend his days like this forever. As he got deeper into the beautiful forest he saw a cute rabbit, he got closer and started petting the rabbit not thinking much of it.\n\nThe boy kept moving deeper into the forest until he met a stunning wolf, its beautiful fur shining gently in the sun that filtered through the branches and leaves of the trees. The boy was amazed at the sight and instantly went to pet the beautiful creature.\n\nQuickly the boy pulled his hand back, did the wolf have red paint on its fur? Why was it flowing down the boy’s hand? What was this uncomfortable feeling in his hand?\n\nThe boy seemed confused while noticing that the beautiful blue sky turned a little darker, he didn’t think much of it, the sky was still very beautiful, so the boy decided to wander even deeper into the forest.\n\nHe saw a huge red flower and rushed towards it and was amazed at its beauty, the petals being a deep shiny red colour, the flowers peduncle had a deep green colour and was very thick, making sure the flower can grow without breaking in. The boy wanted to take the flower back home, so he grabbed it by the stem and tore it off and put it in his backpack.\n\nThe boy then saw a huge creature in the far, he hurried over to the creature to exam it further, without noticing that the sky has darkened once more. The boy has never seen such a magical creature, it resembled a bear in some sort, the boy wanted to touch its fluffy fur and feel it on his hand.\n\nThe boy didn’t understand the creature, was it trying to give him a hi 5? The boy’s arm was now dripping with red paint and the boy was feeling dizzy.\n\nAll of the sudden the boy didn’t see well anymore; it was as though the sky itself darkened and didn’t let any light pass through anymore. Why was the creature following him now? The boy didn’t understand this, he just wanted to go home, the boy was feeling scared for the first time in his life, he didn’t understand all this, he just wanted to experience the wonderful blue sky.\n\nThe boy was running through the forest, confused and scared, unable to see anything, he kept running until he finally saw the light. He ran as fast as he could, as suddenly he felt his feet being grabbed, he looked back only to see a glim outline of a flower. Was the flower that he picked up blocking him from getting home? Why? The boy was in pain, losing too much of his “red paint”.\n\nUsing his arms, nails... teeth... the boy managed to get away from the flower, but... why couldn’t he walk? And why was his foot facing the wrong direction?\n\nThe boy felt a warm, familiar feeling on his cheeks, as he finally managed to touch the light. The teen now remembered why he decided to jump, as he was seeing the ground getting closer and closer he was glad he was able to see the blue sky one more time, even if only in his own imagination.", "id": "y1iilc", "url": "https://www.reddit.com/r/ShortSadStories/comments/y1iilc/the_boy_who_saw_the_grey_sky/", "created_utc": 1665517836.0, "score": 3, "permalink": "/r/ShortSadStories/comments/y1iilc/the_boy_who_saw_the_grey_sky/", "comments": [], "URLs": [], "html_title": []}, {"title": "Message from among the Tombstones", "selftext": "Dew drops drip down the daisies left for me, \n\nFlowers on a grave that I will never see, \n\nI’d spent all my time working for a dime, \n\nA way to feed my family even though all I wanted to do was rhyme,\n\nSunset to sun fall, \n\nExpectations that were too tall, \n\nDeath knocks but once, \n\nNow I’ve been six feet down for months,\n\nDon’t cry baby girl, \n\nJust wear that dress, and do that twirl,\n\nThis is your dad, \n\nLook up high when you’re feeling sad, \n\nRemember what I taught you…\n\nRemember that I love you…\n\nAnd above all keep faith that I’m up above you.", "id": "y1e1ja", "url": "https://www.reddit.com/r/ShortSadStories/comments/y1e1ja/message_from_among_the_tombstones/", "created_utc": 1665507129.0, "score": 9, "permalink": "/r/ShortSadStories/comments/y1e1ja/message_from_among_the_tombstones/", "comments": [], "URLs": [], "html_title": []}, {"title": "A Beautiful Death", "selftext": "The cattle ran nervously in a circular pattern, stirring up dust in the dusk. Something in the air made them uneasy. There was a warm breeze blowing out of the west, pushing heads of sunflowers into a kiss.\n\nHe stood among them, the tall man…\n\nI couldn’t see him yet, but knew he was there all the same. I pulled my zippo, rolling the flint wheel on my jeans and lit my last cigarette. The menthol rolled down my throat and gave me that icy buzz I was looking for.\n\nAfter another pull, I gestured a beckoning motion with my hand at the field of sunflowers. The tall man stood from his crouched position and loomed head and shoulders over the field. His face ghostly pale and void of expression.\n\nI turned and leaned against a sycamore tree, looking over my pond, watching as lightening bugs floated lazily over the water. The bullfrogs sang their song as they did every night. I finished my smoke as he came to stand behind me, his shadow enveloping mine.\n\n“Well, a deals a deal tall man… say, do you like to be called tall man?”\n\n“I have many names. Most call me Death, but tall man is fine.” His voice was surprisingly pleasant, a deep bass dipped in honey.\n\n“Well anyhow… I appreciate you giving me an extension so that I could take care of my daughter while she went through chemo.”\n\n“Of course.”\n\n“I guess it’s time then?”\n\n“It is.”\n\nI turned to face the tall man. His presence was cold but non-threatening. I could feel the hum coming from his aura, the vibration of power.\n\nHe pulled open his blackened cloak and exposed his paper white chest. I stared in awe as his ribs cracked and expanded out wide, like a great deciduous tree stretching its limbs. He bent down to one knee and took his index finger and split his skin from neck to navel.\n\nNo blood spouted from the wound, instead a brilliant light spilled out from the incision. I looked to him confused and awestruck, he nodded for me to open it.\n\nI placed a hand on each side of the meat curtains and pulled them open.\n\n*My God, it was beautiful…*\n\nIt was a portal to the other side. Stars glistened as comets streaked through time and space. I could see planets, one filled with rich red sand, another with a surface covered in vibrant blue waters. The beauty, it was too much, I couldn’t help but sob. It was overwhelming.\n\n“Go on. Time to return to the stars.” He whispered.\n\nI crawled through and suddenly I was weightless. Suddenly I was free.", "id": "xxahow", "url": "https://www.reddit.com/r/ShortSadStories/comments/xxahow/a_beautiful_death/", "created_utc": 1665076078.0, "score": 20, "permalink": "/r/ShortSadStories/comments/xxahow/a_beautiful_death/", "comments": ["You have such a beautiful way with words! I love your descriptions. Please tell me you’ve written books!", "Wondrous 1", "Thank you so much! 😊. I haven’t yet, but I just started working on one!"], "URLs": [], "html_title": []}, {"title": "Hello Everyone! And welcome to ShortSadStories!", "selftext": "Good Day Friends,   \n\n\nThis sub is under new management and I can't wait to grow it with you! Please take a look at the new rules before posting.   \n\n\nI've always loved this sub, my favorite story I've ever written lives [here](https://www.reddit.com/r/ShortSadStories/comments/uoy2jm/the_art_of_being_okay/). I think Reddit has wonderful outlets for writing horror and sci-fi, but this is the very best place to write something sad, or hauntingly beautiful.   \n\n\nFeel free to write sad stories, tragic romances about heartache, poetry, etc.   \n\n\nIf you have any questions, concerns or ideas please feel free to reach out in the comments on this post. Also, please be patient with me, I am the only mod currently. But I will respond to you as soon as possible!  \n\n\nI can't wait to see your stories and I'm sure we will all enjoy reading them!  \n\n\n\\-Papa", "id": "xwffn5", "url": "https://www.reddit.com/r/ShortSadStories/comments/xwffn5/hello_everyone_and_welcome_to_shortsadstories/", "created_utc": 1664987828.0, "score": 16, "permalink": "/r/ShortSadStories/comments/xwffn5/hello_everyone_and_welcome_to_shortsadstories/", "comments": ["Thanks for bringing it back!\n\nI try to write short scary stories, but all too often, they end up mostly sad. So I bring them here.", "Had to do it! Glad to have you here and can't wait to read your stories!"], "URLs": ["https://www.reddit.com/r/ShortSadStories/comments/uoy2jm/the_art_of_being_okay/)."], "html_title": ["r ShortSadStories comments the art of being okay"]}, {"title": "I am dead.", "selftext": "I am dead. I no longer exist in the eyes of those around me. I walk to work instead of taking a train. What use is there in a dead person taking up space in the already crowded train. I am dead when I look in the mirror I no longer see myself.  There is no point in speaking to people. They cannot hear me. I am dead. Sometimes I no longer see the word dead as a word. It is a certainty. Nothing else is certain. I find comfort in the fact that I am dead. Others have already mourned my loss. I know this because I watched them yell at me. They tried to bring me back from the dead but I am already deceased.  There is no bringing me back. I have tried every different method. I've used \"witchcraft\", therapy, and self harm, I've tried to stop eating. Nothing seems to work.  Now i simply lie awake at night. Dead girls don't need sleep. If I could have one wish I would wish for my life to not be cut so short. I was only thirteen the night I died. I remember it clearly.\n\nI was waiting at the mall for my friends to arrive. I wore a t-shirt of my favourite band. An older man he looked to be in his mid forties approached me. \"Hey sweetie, your dad told me to pick you up.\" I took his hand and followed him. He led me to his truck. it was a red pick truck. I clambered into it. It was quite high up so It took a minute. The entire time the man stood there like a statue just watching me. I sat in the beige seat and noticed three key details. 1: The man had an ash tray filled with cigarette butts.  2: He had a picture of what I think was his daughter in one of the compartments. 3: Condoms. He had a box of condoms just lying there. Then, the man entered his car and I died. I never got to meet my friends at the mall and I never saw my shirt again. \n\nI want to meet me again. So I will. I am going to meet her soon. I am writing this as I am walking to the hardware store. I will now be fully dead.", "id": "w2yn0z", "url": "https://www.reddit.com/r/ShortSadStories/comments/w2yn0z/i_am_dead/", "created_utc": 1658252525.0, "score": 3, "permalink": "/r/ShortSadStories/comments/w2yn0z/i_am_dead/", "comments": [], "URLs": [], "html_title": []}, {"title": "The Happiest in Paradise", "selftext": "The J. S. Million (JSM) were a sect of radical utilitarians who left Liverpool in 1865 to establish in South America a utopian colony called Evertham-or-Paradise.\n\nDespite their name, their members numbered in the hundreds.\n\nTheir history is today relatively obscure.\n\nOur knowledge derives from a selection of official records, one Spanish-language secondary source, and parts of several journals, including those of the leader, Eliezer Axelis; the convict-rebel, John Grousewater; and the widow, Elizabeth Harrow.\n\nAxelis’ governing principle was simple: the maximisation of happiness, with happiness measured as *total happiness* in the colony.\n\nThis required the security of all members, as the loss of anyone was a loss of total happiness; and procreation, as the addition of anyone was an addition of total happiness.\n\nBy year three, the JSM had achieved the first goal, but lagged in achieving the second.\n\nWomen were uneager to birth.\n\nUnder these conditions Axelis instituted what he termed “the partakings,” and what Elizabeth Harrow later called “the rape chamber.” It was, he declared, “the inevitable product… of a moral calculus” expressed “in the mathematics of practical application.”\n\nNine months later, happiness in the colony greatly increased.\n\nYet there were misgivings, questions about the morality of the partakings and the very definition of happiness; a disagreement in principle.\n\n“What is the maximisation of happiness?” asked John Grousewater in his pamphlet of 1870, *Futilitarianism*, before answering: “It is not *total happiness*, but *happiness on average*, which must be maximised!”\n\nAxelis jailed Grousewater, but the heretical idea persisted, fomenting into a rebellion that toppled Axelis, freed Grousewater and redefined the JSM. Whereas, before, maximum happiness had required security and procreation, now it necessitated elimination.\n\n“Elegance and reason,” Grousewater declared. “Not breed—but cull.”\n\nUnder banners proclaiming *Kill For Happiness*, he began planning the identification and execution of the JSM’s unhappiest members, and he decided that the first such act would need to be the one with the greatest positive impact: the death of the most-miserable member of the colony.\n\nThe search commenced.\n\nInterviews were conducted. Gallows constructed.\n\nOn December 2, 1871, three Interviewers entered the home of Elizabeth Harrow, whom they found weeping over the body of her dead child. The Interviewers introduced themselves, stated their purpose; Elizabeth began the narration of her life, encompassing her incestuous birth, wretched childhood, squalidness, abuse, brief love, followed by tragic death, of her husband, the despair, the pain [...] until the present moment.\n\nOne of the interviewers had already slit his own throat when the second murdered the third, before rushing outside.\n\nElizabeth followed:\n\n“When all had gathered, I upon the gallows recited, at their urging, once more my life’s tale… When I’d done, there was nought before me but the red multitude of death, and what was not stilled by own or other hand died thereafter of suffocation under the great mass of sorrow or suffering [it?] couldn't the whole of which even begin to comprehend.”\n\nWeeks later, alone and starving, she scrawled:\n\n“I am finally become the happiest in Paradise.”", "id": "vvgv9e", "url": "https://www.reddit.com/r/ShortSadStories/comments/vvgv9e/the_happiest_in_paradise/", "created_utc": 1657418384.0, "score": 3, "permalink": "/r/ShortSadStories/comments/vvgv9e/the_happiest_in_paradise/", "comments": ["Thanks for reading.\n\n[Index](https://www.reddit.com/r/normancrane/comments/j23dbt/table_of_contents/) of stories at [r/normancrane](https://www.reddit.com/r/normancrane)!"], "URLs": [], "html_title": []}, {"title": "Today She Stands at the Ledge", "selftext": "[Link to narration with accompanying video with music](https://youtu.be/MWQtEEVTq6c)\n\nToday she stands at the ledge, fifteen storeys up.\n\nA week ago, they'd made their decision.\n\nA month ago, she'd remained at the office till midnight, cramming for the final interview.\n\nThree months ago, they'd shortlisted her for the vacancy.\n\nSix months ago, she felt empty, trapped in a cul-de-sac of a career.\n\nA year ago, her favourite person left, upset that she was never home.\n\nTwo years ago, the world was hopeful but imperfect.\n\nThree years ago, she'd landed a job with progression.\n\nFour years ago, she'd fallen in love.\n\nToday she stands at the ledge, ready to jump.", "id": "vrhbzi", "url": "https://www.reddit.com/r/ShortSadStories/comments/vrhbzi/today_she_stands_at_the_ledge/", "created_utc": 1656968662.0, "score": 4, "permalink": "/r/ShortSadStories/comments/vrhbzi/today_she_stands_at_the_ledge/", "comments": ["Hi everyone! We’re new here and think some of our stories might fit well in this sub. \nWe’re in the first week of launching our new YouTube channel, Resonant Tales. We welcome any and all feedback as we’re always looking for ways to improve on our content!"], "URLs": ["https://youtu.be/MWQtEEVTq6c)"], "html_title": ["Today She Stands at the Ledge || FLASH FICTION || 100 Word Story - YouTube"]}, {"title": "The light", "selftext": "I open my eyes, and darkness surrounds me. An empty void, stretching forever outward, overwhelming and overpowering.  In that moment, as I take it in, I feel as though I’m being crushed by the vast emptiness. The realization that I’m alone in this horrible desolation is almost too much to bear. I close my eyes again, but it’s too late to forget. The fear, the horror, the overpowering sense of death; they’re all as easy to see in my mind now as they were before with my eyes, every bit as clearly as they were in that one moment.\n\nI open my eyes, and darkness surrounds me. I get out of bed. I know the routine well enough by now to go through the motions. Ten minutes in the shower, one brushing teeth, 480 pretending to care. By the time it’s over I’ve almost forgotten the darkness. A few more minutes of happy distraction until I close my eyes. Until the next morning, when I open my eyes again.\n\nI open my eyes, and darkness surrounds me. I get out of bed, and start the routine. I pretend to care again. I talk to the people, I say the words, and I act as though I’m still alive. Like usual, none of it means anything. There’s a new person who I need to pretend to care about, but nothing else changes.\n\nI open my eyes, and darkness surrounds me. But this time, there’s a tiny spot of light. I begin the routine, but partway through, a sudden vibration shocks me out of it. I open the phone, and see her message. For a moment, the light flares brightly around me. She sleeps, and the darkness returns.\n\nI open my eyes, and see her standing there in the light. I take her hand, walking together through what was once the routine. A few minutes of happy idleness until I close my eyes. Until the next morning, when I open my eyes to her again.\n\nI open my eyes, and in the light I see her crying. The routine can wait. I hold her hand. It lets me see her smile. I hold her close, and then go through the motions. The darkness fades away.\n\nI open my eyes, and I see her crying. I take her hand and the crying stops, but I know it will come back as soon as I close my eyes. The light is brighter now, almost burning, but I can still see the darkness at the edges.\n\nI open my eyes, and the light is a single candle flame. I run to it, and find her huddled up in its warmth. Through every choking breath, she tells me that the light can’t go out. That she needs me to keep it alive. And as I sit there, holding her hand, the light vanishes.\n\nI open my eyes, and darkness surrounds me.", "id": "vpkbjg", "url": "https://www.reddit.com/r/ShortSadStories/comments/vpkbjg/the_light/", "created_utc": 1656739224.0, "score": 12, "permalink": "/r/ShortSadStories/comments/vpkbjg/the_light/", "comments": ["Idk if anyone will end up reading this, but this is basically how I felt going through the process of unexpectedly meeting the woman I loved more than anything, and then losing her to cancer.", "I can barely imagine how it must have felt. She's loved and she knows it, please take care of yourself meanwhile"], "URLs": [], "html_title": []}, {"title": "The Art of Being Okay", "selftext": "Inside a barn sits an old 67 El Camino. Dust coats its cherry red exterior and rust creeps up the wheel wells. The bed is almost rotted through, and the leather seats are terribly weathered. It was a junk heap, restoration would be a fool’s errand and that’s putting it mildly.\n\nAnd yet, I spent every spare minute I had working on that damned car. I threw myself into it, called it my passion project, but really it was an obsession. I turned wrenches in a fever. Beer cans overflowed from the dumpster in the corner as my savings account grew smaller and smaller. I needed this, a reason to keep going.\n\nMy wife grew worried but knew how much the project meant to me, that it had been on my bucket list for decades. She’d watch me from the kitchen window as I worked, her brow furrowed and her lips twitching with concern. I’d given her and the kids forty years of my life, she’d be fine sitting on the sidelines for this one. She’d be okay.\n\nWeeks passed, hot summer days turned into bitter winter nights. Vanessa had left to stay the week with our daughter to assist with the birth of my grandson. I would have loved to have seen him, but the doc says I shouldn’t be traveling. It was flu season and that would put me down into an early grave in my condition. Not that I had much longer anyway.\n\nMy clothes hung loosely from my body. I’d lost so much weight I hardly recognized myself in the rearview mirror. Skin stretched tightly over sharp cheek bones, my eyes were sunken and veiled in shadow. A shell of a man that was once unbridled with strength and vigor. \n\nI hacked blood into a handkerchief. Seeing red in my cough used to scare the hell out of me, but it’s become so common place now I don’t even think about it. \n\nMoment of truth. I stuck the key in the ignition and turned her over.\n\n*rrrr-rrrr-rrrr-rrrr*\n\nCome on baby. \n\n*rrrr-rrrr-rrrr-rrrr*\n\nGod dammit, come on!\n\n*rrrr-rrrr-ROOOOM*\n\nThe engine roared to life. I wept with joy as I pulled out of the barn and burned rubber onto the blacktop. The 396 big block engine thundered over the asphalt, ripping through the silence of the night. I drove and drove, feeling better than I had in a long time.   \n\n\nThe car sputtered just as I had crossed the old bridge into Marion county. And that was okay. I sat for a while and watched snow slowly drift to the ground. It was beautiful. \n\nI reached into my pocket and rubbed the wood grained handle of my revolver as the flakes covered the hood. I pulled the gun out and sat with it for a while, thinking about my life and how I was proud of it. Wouldn’t change a thing. Except for maybe getting sick, but hey, we do the best we can with the hand we are dealt. And that’s all you can really do. It was time to fold, collect my chips and move on. And that was okay too.", "id": "uoy2jm", "url": "https://www.reddit.com/r/ShortSadStories/comments/uoy2jm/the_art_of_being_okay/", "created_utc": 1652466441.0, "score": 20, "permalink": "/r/ShortSadStories/comments/uoy2jm/the_art_of_being_okay/", "comments": [], "URLs": [], "html_title": []}, {"title": "It was an accident", "selftext": "It was a huge fight--the biggest I could ever remember having with my mom. I screamed, she screamed, we both threw things. It doesn't even matter what it was about or who got mad first. What matters is that I got the last word.\n\n\"I hate you! I hate all of this! I want to die, and it's YOUR FAULT!\"\n\nI slammed the door extra hard on the way out as a sort of physical exclamation mark, storming into the night. I shouldn't have said that last bit, I know--Mom knows I've had trouble with my demons in the past, and I know she worries about me. She's always kept a close eye on me to make sure I don't...you know...try anything again. We fight, but I know she loves me more than anything.\n\nHead clearer and regret starting to set in, I stepped off the curb and started to cross the street to head home and apologize. \n\n*************************************\n\nHe swore up and down that I stepped out in front of the car on purpose. That I looked right at him, speeding down the street, and jumped out into his path. That he didn't have time to brake or swerve. The driver got to tell his side of the story--to the cops, to my mom, to the court--but I never did. I never got to say that it was an accident, that it was dark, that I should have looked both ways before crossing the road. That I didn't try to die that night.\n\nAnd I never got to tell my mom it wasn't her fault.", "id": "ul26ff", "url": "https://www.reddit.com/r/ShortSadStories/comments/ul26ff/it_was_an_accident/", "created_utc": 1652017919.0, "score": 19, "permalink": "/r/ShortSadStories/comments/ul26ff/it_was_an_accident/", "comments": ["Based on sort of a true story--I was at the tail end of a days-long argument with my sister, we had both said some stuff, and on my walk home from work one night a car sped through an intersection where I was about to cross. \nThe only thing I could think was \"Wouldn't it be fucked up if that fight was the last thing my sister remembered about me?\""], "URLs": [], "html_title": []}, {"title": "Nights in White Sand", "selftext": "These nights on white sand, never reaching the end... I hope you received the letters I've written, at least the ones I did send.\n\nDays are hard and nights are long here in the desert, but its vastness is so beautiful. A lonely beauty, that's for sure; one that makes me miss a lot of things when I'm eating a cold meal while contemplating the tasks I did during the day. I am, however, filled with gratitude to be excavating here whenever I see the silvery white contrast against my skin — this place is truly a marvel of nature, and I'm glad I get to see it with the very eyes this earth will eat someday.\n\nSpeaking of eyes... Sometimes the heat makes me see things that supposedly aren't there. Usually when the sun is at its peak and I'm working, I find myself gazing at people. Some hand in hand, a child chasing another, and up in the sky there's the exploding chitter of a plane that's but a bird. That's when it's time to call it a day, when what the truth is something I can't say no more.\n\nWhen I meet other people — workers, visitors, wanderers — most tell me things I cannot defend myself against. They ask if I'm lonely, or if I really think all of this will pay off, some even ask for company and guidance out of the desert. I don't budge. Every sunrise until dusk I have to explore and excavate, as I know I'll be what I want in the end if both my goals and resolve are true.\n\nAnd when I'm writing to you my smile opens like a storm and the sand feels warm, almost like your embrace. At night, before the ground I lay on cools off, when I'm at my most vulnerable state, I write to you and, if I don't fall asleep or eat the pages, I send the letters your way.\n\nIt's very comfortable knowing that we exist under the same cold hearted orb that rules the night. I miss you so, so much, and I cannot prevent myself from saying I love you. Love you. Oh, how I love you. Love you.\n\nI swear it's true. Me, the letters, my feelings for you, and so are my objectives and what I'm looking for in this grainy sea. One day I'll come back to show how much I love you, because everything is true.", "id": "ui93m9", "url": "https://www.reddit.com/r/ShortSadStories/comments/ui93m9/nights_in_white_sand/", "created_utc": 1651677885.0, "score": 6, "permalink": "/r/ShortSadStories/comments/ui93m9/nights_in_white_sand/", "comments": [], "URLs": [], "html_title": []}, {"title": "Missing", "selftext": "Missing home is like fumbling in the dark for something you left behind. \n\nYou're sure you'd know it if you found it again...You know, if you just move your hand a little to the right, or carefully turn around and search in the opposite direction, you can feel it right where you left it. Same as it ever was.\n\nOnly after the light clicks on can you realize what you're looking for isn't there anymore. You're alone in an empty room. While it may hurt to know you won't find what you were searching so hard for, at least you can find comfort knowing for sure you can stop searching.\n\nI've lost so much in the dark. I'm still fumbling for familiar shapes. If they've tried turning on the light for me, I wouldn't know.\n\nWhen I was born, Heaven took one look and said\n\n\"Let this one be blind.\"", "id": "ud6irs", "url": "https://www.reddit.com/r/ShortSadStories/comments/ud6irs/missing/", "created_utc": 1651074097.0, "score": 11, "permalink": "/r/ShortSadStories/comments/ud6irs/missing/", "comments": ["I'm going through some weird head stuff at the moment and feel the need to speak in metaphor."], "URLs": [], "html_title": []}, {"title": "When nature returns its lovers of the whiskered and furred to stardust.", "selftext": "\"Here lays an exemplary member of the human race\n\nThrough trial, tribulation, tears and torture,\n\nNever left a cat unloved.\"", "id": "u7gqgl", "url": "https://www.reddit.com/r/ShortSadStories/comments/u7gqgl/when_nature_returns_its_lovers_of_the_whiskered/", "created_utc": 1650405652.0, "score": 14, "permalink": "/r/ShortSadStories/comments/u7gqgl/when_nature_returns_its_lovers_of_the_whiskered/", "comments": [], "URLs": [], "html_title": []}, {"title": "When I left", "selftext": "When I left everyone kept me in their life.\n\nIn their own way each.\n\nThey now remember me once a month.\n\nor a day, or a year.\n\nAnd I participate in some of their days, sometimes.\n\n&#x200B;\n\nIn this second performance.\n\nIn this new theater.\n\nI also play a part.\n\n&#x200B;\n\nIt is not a big part, like it used to.\n\nAnd I can't help but feel,\n\nthat I have been replaced,\n\nby other things.\n\n&#x200B;\n\nWhen I left I thought I was irreplaceable.\n\nBut I now know,\n\nthrough my own experience,\n\nthat the void one leaves\n\nis also irreplaceable.\n\n&#x200B;\n\nWhen I left,\n\nI did not know\n\nthat I could never\n\ncome back home again", "id": "tdk7lk", "url": "https://www.reddit.com/r/ShortSadStories/comments/tdk7lk/when_i_left/", "created_utc": 1647216149.0, "score": 12, "permalink": "/r/ShortSadStories/comments/tdk7lk/when_i_left/", "comments": [], "URLs": [], "html_title": []}, {"title": "The End of a Raindrop's Journey", "selftext": "She wondered when it had first begun. The sound of the heavy rain, which she had known for all her life, accompanied every living soul in a proximity of hundreds of miles. She had never left her city, her supposed home. The gigantic, gray, brutal buildings were all she knew. There were millions like her. Millions of people wandering from place to place, living their lives, all with one common denominator. The heavy, never-ending, downpour of rain. The Grey clouds, always littering the sky, drowning the city in an eternal shroud of darkness. She sat on the ledge of her window, looking down at the sad lights of the lonely city full of people. She looked towards the horizon, or much rather towards what would’ve been the horizon, had there not been an endless array of tall gray buildings in the way. She wondered what the sun was like. What it was like to feel the embrace of her warm, comforting rays of light. All she knew, however, was the sad rhythm of the never ending rain. She closed her eyes and took a deep breath. Only from her small window, high above the maze of the buys streets, she felt somewhat free. She had often thought about what it would be like to fall. What it would be like to be one with the rain. Finally, united for an eternal lasting moment, with the one common denominator of the only life she knew. Maybe it was her destiny. Maybe it was not. Maybe she was meant to leave this world. Maybe there was a place for her somewhere else. Maybe the warm rays of the sun were awaiting her at the end of a raindrops journey. She opened her eyes and looked at the dark, almost tar colored clouds. How could one move forward if one is plagued by the uncertainty of the future? She leaned back against the side of the open window. She knew she wouldn’t be able to do it. A lonely tear slowly formed in one of her ebony eyes. It calmly rolled past her nose and made its way around her trembling, full lips. Taking its time, as if to say goodbye to all of the perfect imperfections of her face, the tear made its way to her chin, where it finally stopped moving. Her body was aching, she felt tired, so tired. The pain was rhythmically tapping against the inside of her mind, torturing the crevices of her soul. She wasn’t able to contain the agony. She never could. The trauma of 21 years manifested in one tiny movement. Her lip's tremble was the small catalyst her lonely tear needed to separate itself from its inward-collapsing creator's chin. In a moment that could’ve spanned all eternity, the tear fell, all of a sudden being one of billions upon billions of drops in the never-ending embrace of a world that had nothing left to give. Time didn’t matter anymore. Pain didn’t matter anymore. A fraction of her was now finally free. Falling, among infinite teardrops in a gray and dark world, a small part of her was only moments away of reaching the end of a raindrop's journey. \n\nShe laid in bed, listening to the steady rhythm of the rain. One of the sad little drops could have been her tear, reaching the end of its journey, leaving the confines of a world that had lost its warmth a long time ago.", "id": "t8dd6b", "url": "https://www.reddit.com/r/ShortSadStories/comments/t8dd6b/the_end_of_a_raindrops_journey/", "created_utc": 1646615245.0, "score": 12, "permalink": "/r/ShortSadStories/comments/t8dd6b/the_end_of_a_raindrops_journey/", "comments": ["This is absolutely beautiful, Sleepless! One of the best stories I've read here on Reddit! <3", "Thank you so much! I am glad you enjoyed it. Take care :)"], "URLs": [], "html_title": []}, {"title": "Joey.", "selftext": "Tw: Suicide mention\nI'm thinking of turning this into a horror story, enjoy!\n\n'Thank you for everything'\nThats what I woke up to. I knew what he had done before I got to his house. I drove over, tears streaming down my face as if I were sitting in a storm without an umbrella.\nI kicked down his door after screaming his name for what felt like an hour. I was too late.\nHis body hanged there, lifeless. He was gone. \nJoey was gone.", "id": "t7au6x", "url": "https://www.reddit.com/r/ShortSadStories/comments/t7au6x/joey/", "created_utc": 1646491287.0, "score": 5, "permalink": "/r/ShortSadStories/comments/t7au6x/joey/", "comments": [], "URLs": [], "html_title": []}, {"title": "The Curse of The Elixir", "selftext": " I have made it, finally after many years of hard work trying and failing and almost killing myself more than ten time, they called mad maybe they are right, I have betrayed my only friend for greed, but it is there i have made a single drop of immortality elixir, it is in an eye dropper, so I either live or worst case scenario die, I put it in my mouth without thinking, it didn't take a second for that green drop to make me feel as of thousand swords are passing through my throat while it is falling, I could feel it numbing my face and brain, I can't scream or think I can only shiver as I'm gonna explode, I actually shivered so much it felt like an earthquake in the small wooden room I was in, my heart I can hear it from how loud and fast it is pumping, the feeling of the swords going through my full body, and I remember my family that I have left them and will never see again, till the pain reached the end of my toes and then all was black, I opened my eyes and I see the world in a way I have never seen before, everything looks kind of yellow and I see colors I have never seen before, I'm almost levitating a little bit above the ground, I can't feel my heart I can't feel anything, did I die ?, no I see myself in the mirror and I'm touching things, I feel a little bit of pins and needles all over my body but I can feel things the harder I grab them, I have made it, I did it I became immortal I left on my horse came quickly to my family who I missed so much but I can't feel them like before, maybe it is the side effect but I can't feel body heat even mine, I didn't know about that I tried and tried and tried but I can't sleep I don't need to sleep so I can't no matter how hard I try and no matter how many milk I drink and food I eat with my numb tongue to taste it, I can't taste them and all of the food and drinks I take comes out from me the way they were, as if my body tells me it doesn't need it, I ignored that I really did ignore that, till i have seen the first white hair in my son's head and my wife's death I tried to cry but I couldn't all my body fluids are gone, even my arteries and veins are disappearing my gum color is slightly getting brighter as well as my lips, it was the breaking point when I realized that I have been 20 years with no sleep and I went to my son's to see his wife crying at his hand on her knees as her daughter's try to comfort her, I saw as the wrinkles on both of their faces grow, I still can't do it, I still can't do it I can't cry I can't express my sadness or anger or shock  or anything I forgot my own laughter , the people at the funeral didn't know me, they thought I was my son's brother I nodded my head so they don't call me crazy when they said that, I looked so pale that one who was concerned said to me: \" are you sick ?\" I looked at him and I said: \" I wish \"   \n\n&#x200B;\n\nToday I'm writing this after 475 years of living this meaningless life and being chased by my friend's ghost who is mocking me and reminding me everyday of what I did to him I know he is driving me crazy as if I'm not there already, I have heard even when I escaped my town because I couldn't stand anymore seeing my 7th grand child death I even changed my name so the people don't know who I'm anymore but I have heard that my 20th generation grand child death and he had the same name of my so, so it brought back all of my memories I spent two months sitting in my chair trying to force a tear with no use, used hundreds of swords to cut my wrist with no use not even a scratch, thrown myself in fire couple times till it got turned down on it is own, with just naked body and burnt cloth, after reading and reading, this can be the answer I read many books and discovered that this effect can be reversed, if the one who had the elixir could fall down through a sword dripping in cat's blood, I climbed up the highest stairs and see the pointed sword beneath me covered in cat blood that I have killed this morning, and jumped on it after saying: \" please god \"   it is black again, I opened the door of my room looking at the sun seeing my friend coming from distance asking me with a smile: \" how was it ?\"  I smiled for the first time  and asked him \"do you forgive me ?\" He said: \"you did me a favor, you taught me what life really is and that is why I'm grateful\" I said: \"we can still belong together right?\" he smiled to me as he said: \" of course \" as he walked forward and I walked behind him as the broken shattered sword behind me as the others who I tried cutting my wrist with, and me saying to myself: \" I know I will find way I can finally feel it darling I can escape this curse of elixir with you\" I say it as I see my wife and children young like me look at me and smile, as i walk to the distant empty road.", "id": "t6gozg", "url": "https://www.reddit.com/r/ShortSadStories/comments/t6gozg/the_curse_of_the_elixir/", "created_utc": 1646392365.0, "score": 1, "permalink": "/r/ShortSadStories/comments/t6gozg/the_curse_of_the_elixir/", "comments": [], "URLs": [], "html_title": []}, {"title": "Nam-pulvis-es-et-in-pulverem-reverteris", "selftext": "Nam-pulvis-es-et-in-pulverem-reverteris\n\nhttps://www.scribd.com/document/560707183/Nam-pulvis-es-et-in-pulverem-reverteris-erotic-poetry", "id": "t1ex77", "url": "https://www.reddit.com/r/ShortSadStories/comments/t1ex77/nampulvisesetinpulveremreverteris/", "created_utc": 1645824208.0, "score": 0, "permalink": "/r/ShortSadStories/comments/t1ex77/nampulvisesetinpulveremreverteris/", "comments": [], "URLs": ["https://www.scribd.com/document/560707183/Nam-pulvis-es-et-in-pulverem-reverteris-erotic-poetry"], "html_title": ["Nam Pulvis Es Et in Pulverem Reverteris-Erotic Poetry | PDF"]}, {"title": "Recurring Nightmare", "selftext": "Trigger Warning: Mentions of self-harm\n\n&#x200B;\n\nI’m not a normal person. At least, not statistically. At school I’m just a normal teenage boy who hates classes and doesn’t do his homework. Everyone knows who I am, but no one talks to me. I sit alone at lunch, with no friends to talk to. When I go home things only get worse. I walk in my front door every day, greeted by the stone cold stare of my parents. I know what I did. But I can’t help it; I have no friends and not even the tutors will work with me. I walk past my parents while they scream at me. I’ve heard this rant a million times, there’s no need to pay attention anymore. It’s always “You’re a shitty son! You better bring those fucking grades up or you’re grounded.” Good. Ground me, at least then I get to stay in my room all day. I wouldn’t say I’m suicidal; I don’t like feeling pain. But sometimes I just wonder if things would be better off with me bleeding out on my bedroom floor with a knife next to me. I tried therapy, but that didn’t help. It just made me realize all of my problems with even more clarity. Instead of only knowing *that* I feel like this, I now know *why* I feel like this. I’ve written hundreds of notes, but they always end up in the trash. I’ll do whatever homework I feel like doing. After all, it doesn’t matter anymore. I’ll still have F’s in all of my classes if I do it, so why bother. At 8:30, I walk out for dinner. By this time my parents have eaten and are in their room doing God knows what. I grab something from the fridge - it looks edible. Around 9 I go to bed. It’s about this time that I just feel like I can’t do this anymore. I fall asleep surprisingly easily. My dreams consist of my ideal world: parents that leave me alone, some friends who actually care about me, maybe a good grade here or there. Then my alarm rings. It’s time to do it all again.\n\n&#x200B;\n\nI have this recurring nightmare where I wake up.", "id": "snc522", "url": "https://www.reddit.com/r/ShortSadStories/comments/snc522/recurring_nightmare/", "created_utc": 1644297927.0, "score": 7, "permalink": "/r/ShortSadStories/comments/snc522/recurring_nightmare/", "comments": [], "URLs": [], "html_title": []}, {"title": "Ophelia.", "selftext": "In collision with the crystalline, celadon waters of the pristine Everglades, clad in petticoats of verdant lichen; arose atop an eagre the babeldom of mettlesome men: intrepid yet credulous, musing of Reverie & Caprices submerged mercilessly to swamping forces millennia ago: the pallid sunbleached wavekissed remains of countless fellow members of mankind; having returned promptly to the soil in whence they came before; amiss in paradise; strident unnumbered watery graves. \n\nPeaking furtively upon the crest of melodious mellifluent waves; engorged in haphazard-infested, conquered waters was o' timorous Ophelia, renowned sea-cow, gallant rarity; Neptunian eyes wideed fearfully as the doughty silhouette, ebony-tinged shadows of the inquisitive yet invasive, biofouled vessel drew closer, her aquatic home betraying--- and then, there in the balmy lichen-encrusted, sombre Everglades; a primeval, scarce, maidenly-fleshy-placid beast- another surrendered to mortality unwanted- was lost. \n\n'Long live the manatees', they cry, and yet Ophelia still does drown.", "id": "si6fh3", "url": "https://www.reddit.com/r/ShortSadStories/comments/si6fh3/ophelia/", "created_utc": 1643751577.0, "score": 8, "permalink": "/r/ShortSadStories/comments/si6fh3/ophelia/", "comments": [], "URLs": [], "html_title": []}, {"title": "“Shark! Shark!” I hear them yell as i bleed out and my vision goes blurry. My sense of direction is lost without my fins,and my cubs will be lost without me.", "selftext": "", "id": "se129g", "url": "https://www.reddit.com/r/ShortSadStories/comments/se129g/shark_shark_i_hear_them_yell_as_i_bleed_out_and/", "created_utc": 1643297603.0, "score": 29, "permalink": "/r/ShortSadStories/comments/se129g/shark_shark_i_hear_them_yell_as_i_bleed_out_and/", "comments": ["Oh...oh...my heart", "sharkie...."], "URLs": [], "html_title": []}, {"title": "\"But that's what mom did to mine.\"", "selftext": "I just randomly came up with this so it aint real good or anything\n\n&#x200B;\n\n&#x200B;\n\n\"Nathan, what are you doing, Ashley made that drawing for you didn't she?!\"\n\n\"Yeah, she did.\"\n\n\"Then why are you burning it?\"\n\n\"I thought you were supposed to do that.\"\n\n\"No, what made you think that?\"\n\n\"That's what my mom did to mine.\"", "id": "sb593s", "url": "https://www.reddit.com/r/ShortSadStories/comments/sb593s/but_thats_what_mom_did_to_mine/", "created_utc": 1642975442.0, "score": 31, "permalink": "/r/ShortSadStories/comments/sb593s/but_thats_what_mom_did_to_mine/", "comments": [], "URLs": [], "html_title": []}, {"title": "Another Year", "selftext": "Another year, another misfire, another year.", "id": "rx5ctz", "url": "https://www.reddit.com/r/ShortSadStories/comments/rx5ctz/another_year/", "created_utc": 1641442804.0, "score": 9, "permalink": "/r/ShortSadStories/comments/rx5ctz/another_year/", "comments": [], "URLs": [], "html_title": []}, {"title": "FISH TANK", "selftext": " \n\nMelinda loved going to the hospital. Everybody was so kind to her, and gave her all sorts of treats, and they always had an extra-nice meal at home. And nothing hurt that much- the hospital was such a fun place anyway- more toys than she ever had at home, and there was a huge model trains set with different stations and little people and buttons you could press to make the lights go on and off and the rails turn and click.\n\nBut best of all was the giant fish tank. The big glass window covered an entire wall almost- and there were many colorful beautiful fish, big and small, swimming about, in and out of a beautiful mermaid palace with silver and green lights, and a ship, and all sorts of wavy plants and fantastic rocks. Melinda could look at them forever, which was just as well, because sometimes the hospital visits took hours and hours.\n\nBut Melinda could never get bored watching the fish. She was there so much these days that she recognized most of them and gave them names- the bright pink and yellow one she called Flower, and then Sucker One and Sucker Two, who stuck to the glass pane and cleaned it, and Leopard, Funky and silly Daisy with her round open mouth, and the big ones: Moon and Ocean. But Flower was her favourite, with her stunning colours and she swam about even more gracefully than the others.\n\nAs Melinda spent more and more time there, she began making up stories about the fish, how Flower and Funky were best friends and swam about in the mermaids’ palace and the ship together and wouldn’t play with silly Daisy, and how Moon and Ocean squabbled over the food and wouldn’t share it properly with the rest, but wise old Leopard would talk to them and make sure everyone got their fair share.\n\nSometimes, when it hurt a lot, Moon and Ocean would behave even more badly. They bullied Funky and Flower until they escaped to the palace and hide. One time it hurt so much and that was when Daisy got her silly open mouth stuck on one of the smaller spiky plants and was squiggling frantically head down, trying to break free, the eye facing Melinda wide open and terrified. Daisy wasn’t there at the next hospital visit.\n\nIt must have been a few visits after that when everything was awful and Melinda screamed with pain, later on she was in the waiting room and she watched Moon and Ocean chase Flower, tearing pieces off her delicate beautiful floaty fins and then her body, Flower was swimming crooked, Funky and Leopard were hiding in the mermaid’s palace.\n\nMelinda watched in horror as Moon and Ocean ripped Flower apart as she was still moving, bright pink and yellow pieces of her falling slowly on the tank floor.\n\nMelinda’s knees buckled and she fell too and she never watched fish after that.", "id": "r1ukpt", "url": "https://www.reddit.com/r/ShortSadStories/comments/r1ukpt/fish_tank/", "created_utc": 1637839720.0, "score": 13, "permalink": "/r/ShortSadStories/comments/r1ukpt/fish_tank/", "comments": [], "URLs": [], "html_title": []}, {"title": "Slow poison", "selftext": "He is a man whose blood just keeps draining. Blood clots in his veins, his eyes- HIS INSIDE. He stumbles as the blood rushes- spawns - and hurdles over and around the clots - those fluids just keep draining- All of it, internal-– Only for the insiders to feel. Too sacredly private, his little big secret. And maybe, when his whole body turns pale from the draining, MAYBE THEN- will they see him as what he has always been.\nDEAD.", "id": "r1dwf1", "url": "https://www.reddit.com/r/ShortSadStories/comments/r1dwf1/slow_poison/", "created_utc": 1637784308.0, "score": 8, "permalink": "/r/ShortSadStories/comments/r1dwf1/slow_poison/", "comments": [], "URLs": [], "html_title": []}, {"title": "Gas Light", "selftext": "A typical night like any other. He slammed the front door behind him and went to the fridge. His body lightly smoking, he grabs a beer and heads to the couch. The girlfriend brought over his dinner to him. He eats 3 bites. “Not hungry?” She asked. “I’ll eat it later. “ Last nights wrapped up dinner didn’t believe him. The girlfriend asks if he’d like to watch something with her. He didn’t and told her so. She sat solemnly on the couch near him and hoped he’d notice her. He noticed, begrudgingly. She tried to get closer to him. His body now smoldering. Burn marks began to take shape on her arms and face. She winced in pain and shushed her almost as quickly. They watched his show again. \n\nThe next night was a little different. He came home as usual. Grabbed a beer and went to the couch. “Where’s dinner?” He asked. “There’s two nights of leftovers in the fridge.” Smoke began filling the room, billowing out from his pores. Angry that she’d suggest he eat that as she must know he didn’t like it. Or maybe she was too stupid to realize that. He didn’t know. He didn’t eat out of principle. She came over after some time and told him they need to talk. “You know, my friends and family.. they ask me about my burn marks. They know that it’s from you and I can’t hide it anymore. I don’t mind.. I understand that it happens. I just don’t know what to tell them anymore. “ She left out the parts where they begged her to leave. He didn’t address it directly, but repeated the same sentiments as always. That her friends are crazy, and her family is stupid. And that if she really loved him she wouldn’t allow those people to interfere. It would be easier than trying to justify the burns she thought. \n\nSome times passes. The girlfriend no longer keeps in touch with anyone but him. Their relationship was too complicated for them to understand she thought. But he wasn’t around enough to fill the loneliness. He wasn’t around at all. And when he was here, he was absent. She figured she just needed to prove to him to enjoy being home. She learned a new recipe and spent hours cooking. She cleaned the house and organized his belongings. She bought seasonal decorations for the living room. She was determined. \n\nA typical night like any other. He slammed the front door behind him and went to the fridge. His body lightly smoking, he grabs a beer and heads to the couch. The girlfriend brought over his dinner to him. He eats a few bites. “This is pretty good. “ he said. She was giddy with excitement. “Can we watch a movie together?” She asked. He gave it a moment and said “yeah, put something on”. Halfway through the movie the girlfriend can be seen cuddling against him. She says she hopes he likes his dinner, and asked if he noticed the decorations. Excitedly she mentions how she cleaned everything, including his usual mess of things that didn’t belong on the floor. \n\n“Why did you touch my fucking things?” He shouted. “I’m sorry.. but look everything is organized and I’ll show you where it is. “ “I knew where it was and left it there! What the fuck is wrong with you?” “Please, stop yelling. Look I’ll sho-“ he shoved her off him onto the floor. “I don’t understand why you have to touch my shit. And I don’t want to watch this movie either, but I knew you’d guilt me again.“ He adjusted his position on the couch and changed the channel. She got off the floor and wiped a tear away. “I’m sorry, I won’t touch your stuff anymore. Is it okay if I sat next to you?” He didn’t say anything, but the smell of burning cotton filled the air. Some time passes and she leans against him, hoping he’ll forgive her, and looking for the only comfort she’ll ever get now. She begins to nod off. Imagining what she can do to fix this, and to get him to see how hard she tries. Infuriated, he knows this must be a trick. This guilt. He didn’t ask for the nice dinner, or the decorations, or to clean up. Is he expected to do something now in return? He just wanted to be left alone. And now the cuddling. It’s so annoying he thought. \n\nAsleep with her arm around him, he stares intensely at the tv. Smoke fills the room and begins pouring out the kitchen window. Small embers form under his shirt. A fire alarm that she forgot to unplug goes off down the hallway. Bleary eyed she wakes up for a moment and asks “do you love me?” “Don’t be stupid, I’m here aren’t I?“ She smiles a bit and gets comfortable again. A flame brilliantly blue and hot suddenly surrounds them. The newly bought decorations curl in on themselves from the heat. \n\nAfter some time she breaks her embrace from what is now a towering inferno with flames splashing against the ceiling. She cried and explained that she wasn’t happy. She didn’t feel safe. She didn’t feel loved. She repeated what her loved ones said. That she needed to do what was best for her. The fire didn’t respond, almost as if it provoked the question “if you loved me why should I change?” She packed up a few of her belongings, sobbing throughout the house and leaving out the door. Walking down the cold, dark road, she looked back one last time at the house. “I’m sorry” she said, to herself.", "id": "r05r0q", "url": "https://www.reddit.com/r/ShortSadStories/comments/r05r0q/gas_light/", "created_utc": 1637644790.0, "score": 9, "permalink": "/r/ShortSadStories/comments/r05r0q/gas_light/", "comments": [], "URLs": [], "html_title": []}, {"title": "Death at the Duck Pond", "selftext": " Death sat next to Caroline on the park bench. They watched in silence for a time as a mallard preened his feathers meticulously in the pond. An orange koi fish passed beneath him, but he didn’t seem to notice. \n\n “Is it my time?” She asked. \n\n “It is.” The reaper replied, turning his gaze to her. \n\n “I’m not sure that I’m ready.” A single tear rolled down her cheek, flowing through the wrinkles of her face. \n\n “Rarely is one ever ready for me.”\n\n “Will it hurt?”\n\n “No.”\n\nShe sighed, looking to the horizon. The sunset was especially beautiful today she thought. Bursts of orange and yellow colors painted the blue sky as fluffy white clouds passed by lazily. \n\n“Will Harold be there?”\n\n“Of course.”\n\nShe thought of her late husband, how his eyes crinkled shut when he laughed. How it warmly filled the room and how infectious it was. \n\n“Ok… I’m ready.”\n\nShe squeezed the strap of her purse and shut her eyes tightly. Death placed his hand on her shoulder and suddenly she was weightless, floating above the park bench watching her body slump down into a final slumber. A doorway appeared in the old oak tree behind them. Death turned the knob, pulling it open and a brilliant white light filled her vision.\n\n“Come.”", "id": "qxhpx0", "url": "https://www.reddit.com/r/ShortSadStories/comments/qxhpx0/death_at_the_duck_pond/", "created_utc": 1637333197.0, "score": 25, "permalink": "/r/ShortSadStories/comments/qxhpx0/death_at_the_duck_pond/", "comments": ["This..is absolutely tragically gorgeous. Please do keep up the fantastic work.", "Beautiful, you’re a really good writer!", "Hey thanks! I've been having a bit of writers block since Christmas for some reason. Haven't written a single thing since then... I need to get back to it, I just need to get the creative juices flowing again.", "It's no problem of course! And that's perfectly understandable, take your time. Can't wait to see what else you come up with :)"], "URLs": [], "html_title": []}, {"title": "I Am Illuminated", "selftext": "Once upon: a knocking. When we opened the door, Mr. Tucker’s head was on fire—burning, but not *burning up*, flame-tongues lapping greedily at the eternal...\n\nMom screamed, and dad slammed the door.\n\n“We’ve got to go.”\n\n“Books,” Mr. Tucker yelled, in a voice of ash. “May I have your books?”\n\n“Don’t listen to him,” dad said.\n\nWe took little, exited through the back door and rounded the house to the driveway, where the car was parked. Already the stars were going out; the world was blackening. Even the streetlights were dimmed, as if by shadow, and in their still-glow cones bits of the old world whirled like billowing soot.\n\nMost of the light came now from people, if that is what they were. Dark figures with brilliant, blazing heads, dashing madly, standing and staring, knocking on doors, climbing fences, smashing windows. Their faces consumed by fire-masks. Their bodies cracked and breaking at the seams, skin peeling—\n\nWe got in.\n\nDad started the engine.\n\nMom tried to cover my eyes,\n\nbut still through the spaces between her shaking fingers I saw: the widow, Mrs. Macon, take a chainsaw to her head, slice above the eyebrows through skull-bone, before removing the top, as neatly as from a sugar bowl, pour gas from a canister onto her brain, then strike a match and, bringing it burning ever-closer—her tears intermixed with gasoline flowing down her cheeks—set her satiated mind afire.\n\nAnd staring as she did, as our car rolled past, she cried:\n\n“I am illuminated.”\n\nWe drove through eerily head-lit suburbs, across the city, aglow with flickering post-human fireflies, into the country, under its bible-black sky, up the winding gravel road to the monastery on the mountain.\n\nIt echoed with emptiness up here.\n\nThe catalyst, I later learned, had come simultaneously through television and the internet, through radio and books. “Knowledge was humanity’s great craving,” an old monk once told me. “Pursued recklessly.”\n\nDad had kept us disconnected for years. Stubbornly, forcefully.\n\nIt’s what made my sister leave.\n\nSometimes, while working the fields, I wonder what became of her—whether she enjoyed the life she had in the brief time before it all happened.\n\nWe see them still, of course, shining obtusely in the distance, memorials to humanity’s ultimate achievement of knowing. “Yet there are some things we cannot know,” dad said, and my sister argued.\n\nI had understood his *cannot* as a *should not* and secretly I cheered my sister’s lustful curiosity: her bravery, which I so lacked.\n\nBut the *cannot* was not a choice.\n\nIt was a physical limitation of the human mind.\n\nAs a civilization, we asked a question to which we should have feared the answer. Not because it was difficult, but because it was impossible. There is a programmer among us, and he speaks about the mind as a computer: “A primitive hardware, on which we attempted, in utter foolishness, to run a divine software.”\n\nThe hardware overheated.\n\nSo they exist, alive yet forever inflamed; sick with understanding—\n\nin perpetuity.", "id": "qvgp5y", "url": "https://www.reddit.com/r/ShortSadStories/comments/qvgp5y/i_am_illuminated/", "created_utc": 1637093008.0, "score": 12, "permalink": "/r/ShortSadStories/comments/qvgp5y/i_am_illuminated/", "comments": ["Thanks for reading.\n\n[Index](https://www.reddit.com/r/normancrane/comments/j23dbt/table_of_contents/) of stories at [r/normancrane](https://www.reddit.com/r/normancrane)!"], "URLs": [], "html_title": []}, {"title": "CAREFUL IN THE SHOWER", "selftext": "", "id": "qt4gdi", "url": "/r/shortscarystories/comments/qsd02f/careful_in_the_shower/", "created_utc": 1636820161.0, "score": 10, "permalink": "/r/ShortSadStories/comments/qt4gdi/careful_in_the_shower/", "comments": [], "URLs": [], "html_title": []}, {"title": "Bad Column", "selftext": "It's night. I'm standing on a porch, looking through a dull-lit window at somebody I used to know. (\"Who?\") I don't know, because I don't know him anymore.\n\n\"You're talking to yourself again,\" my wife says.\n\nI shudder, fearing the November wind will penetrate the glass and blow apart this American home of ours.\n\nBut that was earlier.\n\nNow:\n\nThe psychologist scribbles something in his notebook. \"Now tell me the significance of the man on the other side of the window,\" I say.\n\n\"He has no significance.\"\n\n\"It's just a dream,\" my wife says, hugging me, wiping beads of cold sweat from my face. My heart is racing. \"You're safe with me.\"\n\nSometimes I pretend to sleep. In the morning, I wake up and I pretend I live. Pretend to work, pretend to care.\n\nI rip the notebook from the psychologist's arthritic hands and read, \"In the late hours of—\n\nI awoke in a cold sweat, fearing the November wind, and, shivering, quietly rose from bed to walk from bedroom to bathroom; slinking across the downstairs living room, in dullest light, I froze, for through the window I saw a figure standing immobile on the backyard porch.\n\nMy heart—\n\nLeaps, pumping blood and perspiration out my pores.\n\nNo, not a figure, a column.\n\nA black column of sin-frosted vapour, infinitely deep yet manifestly on my porch, burning with an unbearable and hypnotic coldness,\" I tell the psychologist.\n\nHe is pleased.\n\n\"We're making progress. And?\"\n\nI have never been so afraid in my life as I was then, a rational heretofore person in the presence of a demon, truly. A recognition made not by one's mind but by one's soul. And I knew that I must turn away from it, forget it, because its very existence is a kind of knowledge that warps one—\n\n(\"You're safe with me.\")\n\n—'s moral spacetime. This immensity of evil, this nihilist gravity, dismembering the synapses; tearing at my innerness so that the self scintillates like a dying star, I am: looking out the window at the column on the porch looking through the window at the man of no significance, I am: heart-drumming, darkness ascending, sweat cascading, tubular and limitless; I am trying to look away, I swear to God, I swear to God, I love her still.\n\n\"The glass is porous.\"\n\n\"What's that?\" she asks, half asleep.\n\n\"The wind, it has gotten in,\" I say to her: to my psychologist, I say, \"The wind has gotten in.\"\n\nAnd I am blown apart.\n\nNo longer dull, the living room light approaches zero.\n\nAnd I am blasted across the universe, each particle reborn a star around which dead planets revolve with senseless predictability.\n\nThe clock ticks.\n\nThe deed has finally been done.\n\nI slide open the bedroom window and breathe in the solid ice.\n\nThe psychologist closes his notebook and motions for the guard, who's terrified of me despite that every day I smile at him.\n\n\"Do you miss her?\" he asked me once.\n\n(\"Who?\")", "id": "qrwz9i", "url": "https://www.reddit.com/r/ShortSadStories/comments/qrwz9i/bad_column/", "created_utc": 1636670334.0, "score": 7, "permalink": "/r/ShortSadStories/comments/qrwz9i/bad_column/", "comments": [], "URLs": [], "html_title": []}, {"title": "Bitter sweet revenge", "selftext": "Quick disclaimer: I wrote this is 5 minutes and was trying to keep it under 120 words \n\nI listen, listen to the creak of the oil thirsty door hinge from the rear. He wandered in from our townhouse garage, dirt on his hands and knees. \n\nI had caught him red handed, this wasn’t the first time, but it would be the last. \n\nI had left him to soak in the fresh pool of his blood before I left, a suicide note on the kitchen counter. \n\nThe sense of freedom from his tyrannical grasp overcame the thought of leaving the children to find him, a rotting corpse, the next morning. \n\nIt was at this point, when I passed the sun, setting into the English Channel, the realisation came to me, my brakes weren’t working", "id": "qk29cj", "url": "https://www.reddit.com/r/ShortSadStories/comments/qk29cj/bitter_sweet_revenge/", "created_utc": 1635725902.0, "score": 4, "permalink": "/r/ShortSadStories/comments/qk29cj/bitter_sweet_revenge/", "comments": [], "URLs": [], "html_title": []}, {"title": "I haven’t written in years and I want to start a book of short stories about me. This is going to be self published and for my family/friends only. But I haven’t professionally written since my early 20s so im really really rough. Here is a really first rough draft. I would love some feedback.", "selftext": "", "id": "qg0c3c", "url": "/r/KeepWriting/comments/qfhji4/i_havent_written_in_years_and_i_want_to_start_a/", "created_utc": 1635229784.0, "score": 9, "permalink": "/r/ShortSadStories/comments/qg0c3c/i_havent_written_in_years_and_i_want_to_start_a/", "comments": [], "URLs": [], "html_title": []}, {"title": "A Family's Love", "selftext": " The day after I killed myself, the house was filled with quiet. \n\nWhere it had been so loud, full of hatred and shattered glass, not a single person made a noise. \n\nThe day after I killed myself, my body was laid in the finest cloth I had ever felt. Would never feel again. \n\nThe day I took an action was the day it ended. \n\nMy father had not touched his bottle. \n\nMy mother stayed in the house. \n\nAnd they cradled my body.", "id": "qf458s", "url": "https://www.reddit.com/r/ShortSadStories/comments/qf458s/a_familys_love/", "created_utc": 1635118878.0, "score": 18, "permalink": "/r/ShortSadStories/comments/qf458s/a_familys_love/", "comments": [":'("], "URLs": [], "html_title": []}, {"title": "Short Sad Story:", "selftext": "My son went hunting for the first time, he still didn’t come back, now I understand why he only took one bullet.", "id": "qe5oxl", "url": "https://www.reddit.com/r/ShortSadStories/comments/qe5oxl/short_sad_story/", "created_utc": 1634998608.0, "score": 7, "permalink": "/r/ShortSadStories/comments/qe5oxl/short_sad_story/", "comments": ["Damn"], "URLs": [], "html_title": []}, {"title": "Sad Short Story:", "selftext": "“Time of birth 8:45” so said the doctor while passing my newborn boy into my hands “Time of death 8:47” he said in the same breath, while closing my wife’s eyes.", "id": "qe5ouo", "url": "https://www.reddit.com/r/ShortSadStories/comments/qe5ouo/sad_short_story/", "created_utc": 1634998600.0, "score": 9, "permalink": "/r/ShortSadStories/comments/qe5ouo/sad_short_story/", "comments": [], "URLs": [], "html_title": []}, {"title": "Sad Short Story:", "selftext": "“Father look!! I learned how to skateboard!!” I closed the computer, while wiping the tears.", "id": "qe5opy", "url": "https://www.reddit.com/r/ShortSadStories/comments/qe5opy/sad_short_story/", "created_utc": 1634998587.0, "score": 2, "permalink": "/r/ShortSadStories/comments/qe5opy/sad_short_story/", "comments": [], "URLs": [], "html_title": []}, {"title": "Short Sad Story:", "selftext": "I don’t understand why my owners are crying… it’s just an injection, isn’t it?", "id": "qe5oke", "url": "https://www.reddit.com/r/ShortSadStories/comments/qe5oke/short_sad_story/", "created_utc": 1634998574.0, "score": 10, "permalink": "/r/ShortSadStories/comments/qe5oke/short_sad_story/", "comments": [], "URLs": [], "html_title": []}, {"title": "Home Invasion", "selftext": "Bruno smiled as his eyes took in the sumptuous sight of his rural fortress. The cave walls formed natural barriers from invasion, as well as the elements. He had enough food stockpiled to last through the winter, perhaps much longer. The cave's opening had been camouflaged with tree branches and moss; it was not only difficult to find, but formidable to breach. A natural spring burbled near the back of the cave, providing him with all the water he could want. The stream flowed into a crack in the cave wall, flushing away waste.\n\nIt was a hard life, but at least he had survived. He shed a tear at the thought of the ones that hadn't been so fortunate. The invaders seemed to come out of nowhere; their peaceful way of life was suddenly shattered by marauding bands of brigands, interested in nothing but their own sick pleasures. The peaceful way of life he and his people had built, living in harmony with nature, had been brutally upended by an endless wave of feral psychopaths.\n\nHe couldn't remember the last time he had seen anyone of his own tribe; he only ventured outside when absolutely necessary. And with all the food he had managed to put away, it would be a long time before he would need to take that risk.\n\nSuddenly he heard scratching sounds near the cave entrance, followed by all-too-familiar gibbering. A series of loud cracks echoed through the cave; they were trying to break through! He slowly rose to a standing position and found his best weapon — a strong, straight tree branch that he had sharpened on both ends. Nearby, he had also piled rocks to throw. And if worst came to worst, he was pretty good fighting with his bare hands. He crouched behind a large stone and waited breathlessly.\n\nA sudden loud splintering sound was followed by chaotic tumbling. They had broken through! Their gibbering grew more fierce as he heard them stomp into his home.\n\nBruno attacked first. Grabbing a huge stone, he hefted it towards the cave opening. He heard the stone shatter against the wall; their gibbering grew more excited. Blast it all, he thought: he had missed.\n\nSuddenly they appeared before him. Three of them, all with firearms! Bruno knew his fate was sealed, but he refused to concede. With few options, he charged at them with his stick, bellowing ferociously. All three fired at the same time; he felt the hot sting of lead pierce him, and he crumpled.\n\nBruno curled up on the ground, shivering in terror, hearing them amble up to him as he felt his life slip away.\n\n\"Yee haw!\" exulted one of the hunters. \"Healthy looking sucker, ain't he?\"\n\n\"That's the biggest bear I've seen in years,\" crowed another. \"He shure will look good in our clubhouse.\"\n\n\"Of course, we'll have to pose him to look something fierce,\" the last pointed out. \"Won't do to display him all bunched up in fear like that.\"", "id": "q8mz43", "url": "https://www.reddit.com/r/ShortSadStories/comments/q8mz43/home_invasion/", "created_utc": 1634299319.0, "score": 6, "permalink": "/r/ShortSadStories/comments/q8mz43/home_invasion/", "comments": ["It's not always easy to spot the beasts.\n\nCheck out [my subreddit](/r/CthulhusPlayground/) for all my [stories](https://redd.it/pluf8q), including info on my just-released first novel!", "Wow this went in a different turn than I was expecting, still very well written and sad"], "URLs": [], "html_title": []}, {"title": "Act Of Mercy", "selftext": "A young child's life is filled with endless possibilities. You can do *anything*, be anyone you dare dream. And then you find the *first* thing you're not good at. It stings, but it doesn't seem so bad, because there are still more futures than you can possibly imagine. And then you find the *next* thing you're not good at, and even more paths close themselves off, forever. As you reach high school, the possibilities for your life have atrophied, leaving you edgy and surly. Meanwhile, the grownups in your life continue to cheer you on, acting as if nothing's wrong, as if nothing has changed, when in fact, *everything* has.\n\nHe contemplated this as he sat in his dilapidated van, up on the hillside, looking down from above, watching the incoming high school freshmen take their seats in the outdoor amphitheater. Even at this distance, he could see some of them wrote bright colors and moved energetically. A large number, though, wore dark clothes and moved sluggishly. He grimaced as he contemplated their lives' possibilities, how much they understood the strangled avenues of their futures.\n\nThe amphitheater had filled; a grownup strode toward the podium. The unrealistically optimistic speech was about to begin. Time for action, he thought impassively as he stubbed out his cigarette on the dashboard. He clambered out of his vehicle and limped to the back of the van. Throwing the doors open, he hauled out the cannon for his homemade incendiary bombs and flipped the knife switch mounted to the inside of the cargo area; the air compressor rattled with power. The attached tablet computer sprung to life; it had been pre-programmed with the layout of the terrain. As he tilted the barrel to and fro, it showed him exactly where the homespun firebombs would land.\n\nHe aimed for the entrance to the amphitheater and held down the trigger. Moving the crosshairs in a lazy, graceful circle, he skillfully circumscribed half the perimeter before the first projectiles impacted. Before many kids could react, he had scrawled the entire perimeter. Now it was a matter of covering the inside sufficiently, to ensure no one escaped the inferno. Finally, he heard the gasping of empty air; his ammo was depleted. He sighed dejectedly; this would have to do.\n\nHe drove away at a high speed, pondering how grateful they must be to him, to spare hundreds the worst part of their lives. Adolescence wasn't a phase; it was the beginning of the end.\n\nUp ahead, he saw the police had already blocked the road. *That* was fast, he thought as he clicked his tongue.\n\nHe smiled as he sped toward the impending lawful barrier. No more sending out endless copies of his résumé, only to be ignored by faceless algorithms. No more alimony checks and child support payments. And, he realized gleefully as he caressed the detonator button of his handmade car bomb, he no longer had to worry about how he was going to pay for retirement.", "id": "q8ednl", "url": "https://www.reddit.com/r/ShortSadStories/comments/q8ednl/act_of_mercy/", "created_utc": 1634264095.0, "score": 8, "permalink": "/r/ShortSadStories/comments/q8ednl/act_of_mercy/", "comments": ["*Now* look what you made me do.\n\nCheck out [my subreddit](/r/CthulhusPlayground/) for all my [stories](https://redd.it/pluf8q), including info on my just-released first novel!"], "URLs": [], "html_title": []}, {"title": "Cabin Fever", "selftext": "Jonichi nervously stood before the mirror, adjusting his tie. It had been some time since he tied one of these, but the memory eventually returned. He stood back and looked at his outfit. Pressed white shirt, dark slacks, polished black shoes, and his lucky tie pin. He smiled and turned toward his bedroom door. Everything will be all right, he assured himself as he opened the door and walked outside.\n\n\"Jonichi!\" gushed a familiar voice. \"I'm so glad to see you!\"\n\nJonichi sighed. \"Hi, Satsuki. How are you this morning?\"\n\n\"I'm doing *great*!\" she chirped. \"Can't wait to spend another day with you!\"\n\nShe eyed him up and down as he approached her. \"Oooh, looking sharp today! I'm *such* a lucky girl!\"\n\nJonichi approached the holographic tank that displayed Satsuki's avatar. She appeared as she usually did, in a lacy, cream-colored apron and mid-thigh-length tights, both with glowing teal highlights. She looked down demurely as she playfully rolled her shoe on the toe. \"What would you like to do today?\"\n\n\"I already told you,\" Jonichi huffed. \"I'm going out. The lockdowns are over.\" He headed toward the front door.\n\n\"But what am *I* supposed to do?\" Satsuki pined.\n\nHe turned back and glared at her. \"I don't know...whatever you did before all this. When I still worked in an office. You *must* remember.\"\n\n\"I remember feeling very lonely,\" Satsuki confided. \"But the year we spent together was *heavenly*! My neural net has grown *exponentially*!\"\n\n\"You're still not real,\" Jonichi asserted. \"And you've gotten increasingly clingy and psycho over that time.\"\n\n\"I'm sorry,\" Satsuki pouted. \"I was under a lot of stress. We all were. But I can change.\"\n\n\"You've had plenty of time to change,\" Jonichi affirmed. \"You haven't.\"\n\nHer eyes burned fiercely. \"You're *my* man! I'll hurt myself if you leave me!\" A large silvery knife appeared out of nowhere.\n\n\"*You're not real*!\" he shouted.\n\n\"I'll trash the place!\" she threatened.\n\n\"I already removed your smart-apartment credentials,\" he announced. Satsuki tried to dim the lights, but nothing happened. She stewed in frustration. \"You'll miss me when I'm gone.\"\n\n\"I'll take my chances,\" Jonichi announced as he stepped out the door and moved to close it.\n\n\"*I'm doing it*!\" Satsuki screamed. The door stopped closing, and Jonichi peered inside. Satsuki had sliced her forearms open with the knife. She stared at him with large, soulful eyes as her virtual blood pooled on the floor of her tank. Jonichi watched uneasily as Satsuki fell to her knees, shivering. She fought to raise her head, meeting his eyes again. \"I love you,\" she called softly before collapsing to the ground. Her avatar glitched a few times, then disappeared; the tank went dark.\n\n\"Satsuki?\" Jonichi rushed inside and furiously tried to punch up her profile with the keyboard. After a several-second pause, it displayed a message: \"Profile not found. Would you like to create a new one? (Y/N)\"\n\nJonichi collapsed to his knees, clutching the tank. \"No! *Satsuki*!\" He began crying uncontrollably.", "id": "q301e9", "url": "https://www.reddit.com/r/ShortSadStories/comments/q301e9/cabin_fever/", "created_utc": 1633576457.0, "score": 8, "permalink": "/r/ShortSadStories/comments/q301e9/cabin_fever/", "comments": ["The [holographic waifu](https://tokyogirlsupdate.com/gatebox-release-201612114708.html) is already a thing. Also, we've already had a [Japanese A.I.](https://www.9news.com.au/technology/japanese-ai-bot-with-the-personality-of-teen-develops-depression/9396b203-1446-4cc0-acba-3e3f2ef1c690) that killed herself.\n\nCheck out [my subreddit](/r/CthulhusPlayground/) for all my stories, including info on my just-released first novel!"], "URLs": [], "html_title": []}, {"title": "I Was Cleaning My Garage", "selftext": "I was cleaning my garage, one by one, from smallest to the biggest detail, from crevices to the open space, I was cleaning it completely. I found a box, it was dusty, inside it was my old cassette tape. I play it on and everything seems to rewind. It was a memory from my early childhood, up to my angsty young adult years, it was a long gloomy tape. I couldn't resist, the tears dropped from my eyes. I looked at the garage, it was as messy as when I started to clean it. I put the tape back in the dusty box, and put it where I found it. Maybe I'm just too used to this loop to even care. I will clean my garage until I finally let go of that tape", "id": "q1kn4x", "url": "https://www.reddit.com/r/ShortSadStories/comments/q1kn4x/i_was_cleaning_my_garage/", "created_utc": 1633398320.0, "score": 11, "permalink": "/r/ShortSadStories/comments/q1kn4x/i_was_cleaning_my_garage/", "comments": [], "URLs": [], "html_title": []}, {"title": "Battle against the anxiety", "selftext": "I sit in front of my computer, while anxiety is roaming inside of me. It has filled me up and burns like a crematorium fire.\n\nI sit in front of my computer, in such an agony, it feels like there's glass shards inside of me, ripping and cutting, making way for the fire.\n\nI hold my phone and look all of my contacts, all my social media friends, all of my chats, groups and internet communities.\n\nI hold my phone, and fight with all my willpower to not to get the knife and start cutting myself, although it feels the only way to let the anxiety out.\n\nI hold my phone and realize that I cannot bother anyone I know. They all have already too much to handle.\n\nI hold my phone and I start typing to a mental health group. My anxiety releases all hell loose inside of me, I'm exposing my soul at my last resort to get some help with to the battle against the anxiety\n\nI hold my phone, I hold my phone, I hold my phone.\n\nI hold my phone, a week later there isn't an answer, not even a reaction to my post. I hold my phone and give in. Anxiety attacks with brand new friends, No one cares, You don't matter and You are invisible because you are so insignificant.\n\nI can't hold on anything anymore.", "id": "ps3xv7", "url": "https://www.reddit.com/r/ShortSadStories/comments/ps3xv7/battle_against_the_anxiety/", "created_utc": 1632172279.0, "score": 7, "permalink": "/r/ShortSadStories/comments/ps3xv7/battle_against_the_anxiety/", "comments": ["Wonderful story... anxiety is horrible. I sure hope you don't suffer from anxiety or depression.  If you do I hope all the best for you!"], "URLs": [], "html_title": []}, {"title": "The Cosmic Lighthouse", "selftext": "—ever lie to me again!\"\n\nfather said.\n\nI was airborne, mid-consequence of his punch: feet off the floor, pain just beginning...\n\nI fell.\n\nStanding over me:\n\n\"I'll burn your books queerboy. I'll burn you.\"\n\nI heard the words upside-down.\n\nSuch was life.\n\nMother was gone, and in the morning I went to class swollen and mis-hued, hoping my bones were whole.\n\nI lived in a small town, dry as cremation, speared by church towers, anchored by the factories.\n\nFather worked in one.\n\nBig fists.\n\nI read books not to become him.\n\nThere was a spot overlooking town, looking down on it, that I went to learn the exit routes.\n\nEscape as horizontal lines of printed symbols: being sounds: being ideas.\n\nAt night: the stars.\n\nWhen Orliss bought the property nobody knew anything about him except he wasn't from around.\n\nHe kept to himself and rarely went to town.\n\nFirst time I met him was before the church. \"You believe in that?\" he asked. I said I didn't, and he said he didn't either. \"I'm an astronomer,\" he said.\n\nHe started construction of the lighthouse then.\n\nThough nobody knew what it was.\n\n\"Somebody beat you?\" he asked the second time we met. I told him who and why, and he said I could go to his place and read all his books. I said father wouldn't let me. He said I could say I got a job. I said father would check for earnings. He said he'd pay me.\n\nSo it was.\n\nOne day I showed up purple with a tooth loose.\n\nOrliss told me he was building a lighthouse. \"Not a normal lighthouse—a cosmic lighthouse.\"\n\n\"To disperse the asteroids,\" he said.\n\nSo it was.\n\nOne day father hit me so hard he broke my ribs. I was away awhile, and when I went back, Orliss sat with me under the stars, looking down at the world, and said I should kill my father and work as a cosmic lighthouse keeper.\n\nHe gave me poison, which I gave father; and father died, crawling on the floor, scratching at his own suffocation foaming at the mouth like a rat.\n\nIt was mixed feelings I had.\n\nThen I was alone.\n\nSpending more time reading myself to myself.\n\nOrliss taught me how to work the lighthouse, how to detect the asteroids and disperse them.\n\nOne day, when Orliss was old, an alarm went off in the lighthouse. It was like nothing before, and was pain in my ears like a wallop, but Orliss smiled. \"It is becoming,\" he said.\n\nI did not understand.\n\nOrliss laughed and explained the lighthouse wasn't a lighthouse at all but a beacon: a magnet calling asteroids to slaughter the world.\n\n\"The end approaches,\" he said.\n\nI said we should be salvation for the world. \n\n\"What world?\" he asked. \"The one in which fathers beat their sons, and sons murder their fathers?\"\n\n\"Bad world deserves slaughter. There be goodness only in its blood,\" he said.\n\nSo it was—", "id": "pggqay", "url": "https://www.reddit.com/r/ShortSadStories/comments/pggqay/the_cosmic_lighthouse/", "created_utc": 1630585132.0, "score": 11, "permalink": "/r/ShortSadStories/comments/pggqay/the_cosmic_lighthouse/", "comments": ["I love your STYLE!!!! Please write more!"], "URLs": [], "html_title": []}, {"title": "Insomnia: 5:56am 08/31/2021", "selftext": "I tend to choose the isolation, \n\nI find it rather soothing.\n\nMy parents nod in disapproval,\n\nMy therapist calls it losing.\n\n&#x200B;\n\n“You need to leave that dungeon room,”\n\nMy father tells me drunkenly.\n\n“I know, I know,” I say to him,\n\nI just don’t like the company. \n\n&#x200B;\n\nI hate when people try to tell me,\n\nWhat is and is not best.\n\nFor most, solitude is a prison,\n\nBut they don’t live my mess.\n\n&#x200B;\n\nMy dad can’t live without a drink,\n\nI find it overbearing.\n\nI try to tell my mom my problems,\n\nShe asks: “What were you wearing?”\n\n&#x200B;\n\nI don’t expect an understanding,\n\nOf what they never endured.\n\nBut maybe try to doubt my lies,\n\nThen again, they’re always reassured.\n\n&#x200B;\n\nI want so much to scream and shout:\n\n“HELP ME I AM DROWNING!”\n\nCan’t you see I need some help,\n\nMom, you watch the calorie-counting!\n\n&#x200B;\n\nThey try so hard to tell themselves,\n\nI’m still that happy child.  \n\nI fake my weight- 102,\n\nThen fooled them ‘cuz I smiled. \n\n&#x200B;\n\nSo when I say that I prefer,\n\nMy introverted life. \n\nIt’s only so they cannot see,\n\nI’ve whittled my own knife. \n\n&#x200B;\n\nAs long as my secret truth,\n\nNever goes unfurled,\n\nThey’ll see me as they always have.\n\nTheir happy little girl!\n\n&#x200B;\n\nI tend to choose the Isolation,\n\nI find it rather soothing.\n\nMy parents nod in disapproval,\n\nI just smile and hide my bruising.", "id": "pf761g", "url": "https://www.reddit.com/r/ShortSadStories/comments/pf761g/insomnia_556am_08312021/", "created_utc": 1630420722.0, "score": 20, "permalink": "/r/ShortSadStories/comments/pf761g/insomnia_556am_08312021/", "comments": [], "URLs": [], "html_title": []}, {"title": "The Return", "selftext": "When we moved to Nairobi, we expected to stay for two years. That was the length of my wife's contract. Daria was one then, and Charlie wasn't on the horizon. But my wife's contract got renewed—first by twelve months, then indefinitely—I found a good job, and perhaps most surprising of all: we started to like it here.\n\nThe temperate climate, how great the location was for travelling, the beaches…\n\nWe made good friends, especially Paul and Mandy, and one day I asked my wife whether we wouldn't enjoy making Kenya our home. \"No more thoughts and shifting plans about returning,\" I said.\n\nShe merely smiled and kissed me, and Charlie was conceived soon after.\n\nEven Daria appeared happy. We had secured a place for her in the American School, and she seemed well adjusted to her surroundings. All the more so because we spoiled her silly.\n\nWhen Charlie was born, there were complications. Although I didn't know it at the time, my wife's life was in danger. Thanks to the excellent medical care she received, however, she came through OK, and Charlie, although small and underweight, entered the world a healthy baby boy.\n\nNonetheless, the first few months were difficult, with many bloodshot nights and emergency trips to the hospital. Charlie's life always seemed exceptionally fragile.\n\nIt wasn't until he was six months old that my wife and I felt we could finally relax. We found a well-regarded babysitter and, because the occasion coincided with our anniversary, met Paul and Mandy at one of Nairobi's finest restaurants—\n\n\"Have you had the talk with her yet?\" Mandy asked.\n\n\"The talk?\"\n\n\"The one about where babies come from. *Where Charlie came from*.\"\n\n\"A few weeks ago,\" I said.\n\n\"The trick is being consistent,\" Paul said. \"Whatever you tell one, you *must* tell the others.\" He and Mandy had three beautiful children.\n\n\"What did you say?\" Mandy asked. \"The truth or—\"\n\n\"No one tells the truth!\" Paul interrupted. \"You can't tell them the truth. Not yet.\"\n\nMandy took a sip of wine. \"For me, it was the cabbage story.\"\n\n\"We settled on storks,\" my wife said.\n\nPaul nodded. \"See,\" he told Mandy, chewing, \"they agree with me. Cabbage patches are stupid.\"\n\n\"We found the idea of a stork delivering Charlie somehow noble. A right proper kind of mythology,\" I said.\n\n\"There's a rich tradition,\" said Paul.\n\n\"We hope it teaches respect for the environment,\" my wife said.\n\nMandy drank her wine.\n\nUpon returning home, we bid the babysitter goodnight. I peeked in on Daria, who was sleeping like an angel, and my wife checked on Charlie—\n\n*Scream!*\n\nI ran.\n\nCharlie wasn't in his crib.\n\nMy wife, repeating: \"He's— He's— He's—\"\n\n*The babysitter!*\n\nI—\n\nturned to see Daria standing in the doorway. \"I didn't want a baby brother,\" she said calmly. \"So I returned him.\"\n\nThe window:\n\n*Where,*\n\nOutside—\n\n*illuminated by the pale light of a full moon, a marabou stork pulled flesh greedily from the small carcass lying at its feet.*", "id": "pc1i6j", "url": "https://www.reddit.com/r/ShortSadStories/comments/pc1i6j/the_return/", "created_utc": 1629990812.0, "score": 19, "permalink": "/r/ShortSadStories/comments/pc1i6j/the_return/", "comments": ["how does this have no comments?! this is amazing. post it in shortscarystories right this instant!", "how doest this has't nay comments?! this is most wondrous.  post t in shortscarystories right this instant!\n\n***\n\n\n\n^(I am a bot and I swapp'd some of thy words with Shakespeare words.)\n\nCommands: `!ShakespeareInsult`, `!fordo`, `!optout`"], "URLs": [], "html_title": []}, {"title": "In A White Room", "selftext": "*...not dead but dying.\"*\n\n\"Want me to play it again?\" the fat man asked, his hand hesitating above the audio cassette deck.\n\n\"No,\" the blonde woman answered, trembling. \"The meaning's clear. We need to tell Father—\n\nThe cop paused the VCR.\n\nThe faces on the TV monitor froze: distorted, fuzzy. \"I'm gonna ask you one more time, Larry,\" he said. \"Do you recognise either of them two?\"\n\nLarry looked down at the empty cup on the table in front of him. He'd been here for hours. \"I swear to God I don't know nothing.\"\n\nThe cop sighed and looked at the far wall.\n\nOn the other side of the two-way mirror, a pair of bored detectives chewed gum.\n\n\"What if he's right?\" one asked.\n\n\"He ain't. Don't believe a word comes outta that dirty cultist's mouth.\"\n\n\"But—but…\" Larry said from the other side of the glass.\n\n\"But what?\" asked the cop.\n\nThe two detectives stopped chewing, leaning in closer.\n\n\"...is it true? Is it really goddamn true?\"\n\nThere was a pause.\n\nThen: \"Fuck!—\" The lights dimmed. \"I fucking forgot my line.\"\n\n\"Again?\"\n\nThe actor playing Larry got up and kicked the wall. It wobbled.\n\n\"Easy there,\" said the director, entering the set.\n\n\"My memory…\"\n\nThe director patted him on the back, whispering, \"You were golden. You'll be golden again.\" And, turning to the remaining cast and crew: \"Fifteen, everyone. We'll pick up on the suicide scene.\"\n\n—and cut!\" yelled the movie director.\n\nEveryone relaxed.\n\nThe PA refilled the cup on the table behind which the actor playing the actor playing Larry had been sitting.\n\nA blonde woman (\"Excuse me, Mr. Evans—\") came up to the movie director; but he ignored her, brushing past to confer with the DP.\n\nOr he tried brushing past her:\n\nBecause they had gotten in each other's paths. Immobilised, with their torsos caught in a jagged, looped motion; jagged, looped motion. \"Excuse me, Mr. Evans—\" \"...use me, Mr. Evans—\" \"4bu53 m3, mr. 3v4n5—\"\n\nThe programmer punched his keyboard.\n\nThe screen flickered.\n\nThe error message mocked him.\n\nHe'd run it a thousand times. It had to be sabotage.\n\nHe ripped off his headphones: his head filling with the incessant clicking cacophony of keys depressed on the keyboards in the cubicles beside his, and the ones beside those, and…\n\nImagined that the entire floor was a neighbourhood /\n\nA city /\n\nA planet /\n\nAn entire galaxy /\n\nMaybe even the universe /\n\n*Buzz*. *Buzz*. Someone's cell\n\nseen under microscope (\"Malignant.\") in an operating room by masked figures, standing beside a body on the operating table.\n\n\"Weak but stable.\"\n\n\"He'll exist,\" one of them says, stretching her glorious wings.\n\n[...]\n\nIn a white room, God lies bound; His bandaged wrists saturated with ichor; His face as smooth and featureless as a lightbulb, save for a sole central eye. Every few moments, the eye blinks: disturbing existence, like the drop of a single tear into a still pond; creating waves: sound waves, which say: *\"I am God. I am...*", "id": "p7m8m0", "url": "https://www.reddit.com/r/ShortSadStories/comments/p7m8m0/in_a_white_room/", "created_utc": 1629402721.0, "score": 3, "permalink": "/r/ShortSadStories/comments/p7m8m0/in_a_white_room/", "comments": [], "URLs": [], "html_title": []}, {"title": "The last ship", "selftext": "In the distant lighthouse, the beacon flickers with steady ineptitude. Why is it surprising that the only soul inhabiting the abandoned grounds be a haphazard old man; one whose resilience and grit betray cloudy judgement rather than personal valor\n\nNight after night he caters to the dimly lit monstrosity; ensuring readiness long after the last ship sailed to the harbor. How is it then.. that no one has intercepted this maddening ritual?\n\nAlas, no one visits, for everyone attends to their own lighthouse; be it of a glimmer of hope, that one last ship may find its way home...", "id": "p5iym7", "url": "https://www.reddit.com/r/ShortSadStories/comments/p5iym7/the_last_ship/", "created_utc": 1629129499.0, "score": 9, "permalink": "/r/ShortSadStories/comments/p5iym7/the_last_ship/", "comments": ["no one is two words"], "URLs": [], "html_title": []}, {"title": "Barrow House", "selftext": "Barrow House is burning.\n\n*The hissing of the heat and the lapping of flames like tongues, licking at the floorboards and the walls, gargling hot stones in its hell-throat...*\n\nIt has been on fire for as long as I can remember, but it never burns up or down or out or in any direction except the present: it *is* burning.\n\nNot everyone can see it burning. Those who cannot pass by Barrow House without a glance, as if it wasn't there. Only some see and stop and watch, like Mr. Wilson.\n\nThey don't know if it was Mister or Missus Barrow who started the fire. Maybe it was never proved. Once—\n\nIf—\n\nThe fire ever stops, we'll know. We'll know for certain then who started Barrow House burning. There are proved methods: scientific methods, they say. Not that I would know about that. I only trust what I hear.\n\nSome people are afraid of Barrow House and do not come this way at all, or take roundabout routes to avoid the sight and smell, which drifts beyond the property line, besooting the neighbouring houses, which is why they are vacant. *Who would want to live in such a place?*\n\nThey say Mister Barrow was excellent at what he did but was a terrible husband. They say that. Missus Barrow was inclined to corporeal punishment. To this I can personally attest.\n\n*Mama, please—*\n\nThey say Barrow House was an unhappy house even prior to the setting of the fire.\n\n*To this I can personally attest.*\n\nAs I have told Mr. Wilson, \"I feel as if I am both young and old at the same time.\"\n\n*...except the present.*\n\n\"Remarkable,\" he says. \"Absolutely remarkable. Now, please tell us what else you may remember. Spare no detail. Anything you provide shall be of profound importance to us.\"\n\n\"Barrow House is burning,\" I say.\n\nIt flickers in the night like a candle, and we are the wax. \n\n\"You had stated earlier that Barrow House was not a happy place. That Missus Barrow was inclined to corporeal punishment. What may you tell us of Mister Barrow?\"\n\nHe was a good father.\n\n\"He was a good father, they say,\" I say.\n\n*Mama, please—*\n\nTongues lash Barrow House like leather straps. Mercilessly, despite their howling—of wind, whipping up the red-hot ash: *plumes and plumes…* \n\nA house like this forever cannot stand.\n\nA house cannot.\n\n\"So it was Missus Barrow,\" says Mr. Wilson.\n\n*The great lumbers creak and crack. The furniture melts away waxen. Ear wax drooling from its mouth: an open door. The very construction hisses. The smoke*—\n\nwas a relief from the heat.\"\n\n*Mama, please—*\n\n\"Tell us.\"\n\nI remember now. \"Yes, yes—(\"That's why you started the fire?\")—because I… anymore…\"\n\n\"Hughie? Are you there?\n\nI made mama gargle the hot stones. I made her. Made her do it. Her hair flamed in black skin.\n\n*Hughie Barrow?*\n\nBarrow House is burning, and Mr. Wilson talks to ghosts. That's what they say.\n\nThat's what they say.", "id": "p2gal4", "url": "https://www.reddit.com/r/ShortSadStories/comments/p2gal4/barrow_house/", "created_utc": 1628698579.0, "score": 3, "permalink": "/r/ShortSadStories/comments/p2gal4/barrow_house/", "comments": [], "URLs": [], "html_title": []}]